 
 60: {
   "wall": 4,
   "note": "collage",
   "firstName": "Katrina",
   "lastName": "Mendoza",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Sustainable Systems",
   "title": "trashy self portrait",
   "description": "For one of my entries, I kept track of how much trash I accumulated throughout one week. I then use this trash (whatever may be salvageable) and recreated a portrait of myself. I have used materials such as the plastic covering of water bottle cases to cutting out a particular design of my ripped pajamas."
 },

 61:{
   "wall": 4,
   "note": "painting",
   "firstName": "Khanh",
   "lastName": "Phan",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "Water Puppetry",
   "description": "This piece of painting portrays the behind the scene of water puppetry, a form of traditional entertainment in Vietnam. During the water puppet show, the performers have to stand in the water in the backstage while using bamboo sticks to control the puppets. Therefore, what the audiences see are only the puppets. For this project, I want to honor the performers who devote themselves to this form of traditional art as well as their efforts they put into each performance in order to make Vietnamese culture become more well known. Here, I painted myself as a water puppet performer with wet hair and my body soaked into the water."
 },

 62:{
   "wall": 4,
   "note": "wire face",
   "firstName": "Kiara",
   "lastName": "Li",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Space and Materiality",
   "title": "Self Portrait in Wire",
   "description": "Exploring the creation of a 3D structure with wire was a personal challenge I eagerly embraced. Crafting my self-portrait using this medium turned out to be an emotional rollercoaster.\n\nInitially, I believed a well-executed design sketch would guarantee success, only to face setbacks when proportions were overlooked, prompting a necessary redesign. Presenting the 3D face in class brought a mix of emotions; disappointment arose as classmates struggled to perceive it as a human face due to its small size. Yet, a shift in perspective occurred when I illuminated the artwork, revealing captivating shadows and rekindling my admiration.\n\nThis journey, marked by failures, successes, setbacks, and ultimate triumph, resonated with the intricate tapestry of life. Navigating self-doubt, seeking balance, and persistently striving for success mirrored the nuanced process of bringing my wire self-portrait to life. It symbolizes the challenges inherent in life's journey and the continuous pursuit of creative and personal achievement."
 },

 63:{
   "wall": 4,
   "note": "Lipstick on a Pig - painting",
   "firstName": "Mallory",
   "lastName": "Pangilinan",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "Lipstick on a Pig",
   "description": "“Lipstick on a pig” was a phrase that I always resonated with, especially since going to an art school filled with talented, wealthy, and beautiful people my age. So, when ‘conceptual self portrait” was an assignment that was introduced to me, it was pretty easy for me to come up with the idea visually. Oil paint is my main medium, so I decided to use it for this piece. This piece is very straightforward, a pig with lipstick on is just how I feel. It mostly represents my imposter syndrome, feeling like I don’t fit in with my talent or my looks, despite trying to hard. Feeling like no one will truly accept me. It was very therapeutic and has helped me to process those feelings"
 },

 64:{
   "wall": 4,
   "note": "2 photos",
   "firstName": "Melody",
   "lastName": "Gallant",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Superego/Id",
   "description": "For my piece I chose to represent myself with the dove and the lion, each carrying a lot of symbolism for what I wanted to show. The dove represented my superego, a psychology term that labels the part of the psyche that puts what we consider to be morally right over all other desires. This part of myself I consider to put other people's needs over my own and thus sending off parts of myself to help while I disappear. The lion counterpart is the Id, the part of my psyche that ignores all moral reason and is driven simply by desire. The lion being the symbol of pride helped me double down on the feeling of self interest and obsession. Having multiple obscured images of myself in a circle visually captures the endless cycle of being selfish, a trait I try very hard to purge from myself. I chose to use black and white to distinguish which is considered \"good\" and \"bad\", but ultimately I chose to use the same photo of myself for both portraits because I don't believe anything can be totally good or bad. There's good and bad in everything so while these have different connotations I really wanted there to be a line or acknowledgement and similarity between the two in the composition."
 },

 65:{
   "wall": 4,
   "note": "mask photo",
   "firstName": "Mina",
   "lastName": "Chen",
   "collaborators": "",
   "program": "Interior Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Out of the Woods",
   "description": "This project is divided into two parts: making the mask and photographing the mask in an uncanny way While interviewing my partner, she highlighted the significant influence of her cultural background and her strong artistic yet humble nature. To encapsulate these traits, I aimed for an earthy and traditional aesthetic in the mask, achieved through stitched patterns on beige fabric matching the mask's brown body. These handcrafted details lent a unique artistic flair. Incorporating red, brown, and gray yarns, I outlined deer features, enhancing its rustic appeal and adding soft textures. When I was photographing the mask, I wanted to showcase nature's beauty and the predator-prey dynamic. By positioning the image amidst leaves, I created an illusion of a predator lurking, echoing the natural distance between viewers and the deer, evoking both unease and admiration for nature's beauty. Special thanks to Prin Suwannachin for modeling for the mask."
 },
 
 66:{
   "wall": 4,
   "note": "dyptych digital + collage side by side",
   "firstName": "Mina",
   "lastName": "Chen",
   "collaborators": "",
   "program": "Interior Design (BFA)",
   "course": "Time",
   "title": "Echoes of Nostalgia",
   "description": "I wanted to document the different stages of my life through diptychs. The digital collage on the right represents my childhood, while the analog collage on the left is inspired by my aspirations for the future. In the digital collage, I manipulated the scales of objects to convey the feeling of perceiving everything as larger than life. For the other part of the collage, I aimed to evoke a sense of carefree confidence, choosing to use watercolor and magazine collages in its composition. I employed lines and geometric shapes to create a connection between the two collages."
 },

 67:{
   "wall": 4,
   "note": "dog series black and white",
   "firstName": "Mira",
   "lastName": "Das",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Time",
   "title": "out of time",
   "description": "I decided to represent when one of my dogs, Gabbar, passed away in March 2023 from cancer for this project. He was diagnosed in December and was given less than 2 months, so it was expected. Still, he seemed perfectly healthy and upbeat until the day of his passing, so it felt like time passed extremely fast that day, even though we all knew the day would come. In order to represent the passing of time as well as my emotional state, I chose to have the images I illustrate fade into the background, as my dog has slowly been fading from everyday memory, unfortunately. By making each panel in the sequence smaller and darker, I wanted to express my anticipated despair and eventual grief. I also decided to include dates (“MAR 18”, etc.) to emphasize the passing of time, as well as to memorialize the last few days of his life. I chose to ink this illustration as sequential art makes me think of traditional comics, and I also wanted to use solely black and white visuals. After I had all my pencil lines covered with ink, I decided to cut my paper to make the composition longer and more spread out. After cropping the page, I used a brush and covered the background with ink to emphasize the fade into nothingness. I debated on adding color, but I think it would’ve taken away from the dramatic effect of the black-and-white visuals and storyline."
 },

 68:{
   "wall": 4,
   "note": "dragon",
   "firstName": "Miu",
   "lastName": "Yamazaki",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Kuraokami",
   "description": "This is a piece of the Kuraokami, a legendary Japanese dragon and Shinto deity of rain and snow.  The common myth I used to hear a lot in Japan about the rain/sun bringer triggered me to working on the concept of weather, which led to making this dragon model as one of my pieces for this project.  The body of the dragon is constructed by strips of ribbon sewn together, and beads are added on each of the seams to present the shimmers of the skin.  On the base of the body, strips of ribbons that are woven and folded in different ways are attached to present the wavy spikes and patterned scales.  Moreover, the separately made face  is painted with acrylic paint on a mini canvas.  The eyes and whiskers are also beads, to match the body.  \nThis piece not only is a simple model of the dragon, but uses different materials to present the significance of the liveliness, and power of the god, that manifests in their appearance."
 },

 69:{
   "wall": 4,
   "note": "mask subway egg",
   "firstName": "Nadya",
   "lastName": "Suwarno",
   "collaborators": "",
   "program": "Design and Technology (BFA)",
   "course": "Integrative Studio 1",
   "title": "ARUNIKA",
   "description": "Arunika is a wearable artwork that emerges as a testament to the resilience of human spirit in face of the unknown. Taking upon the shape of an exquisite sea turtle, it is revered in various cultures of their connection to the sea and longevity. It becomes a vessel of reassurance, reminding the wearer that, like the resilient sea turtle, they possess the strength to navigate life's uncertainties.\n\nThe creatures' flippers protecting the egg mimics how sea turtles are led back to their natal home through magnetic cues. The mask's eye openings are thoughtfully designed to convey a sense of vision and foresight, encouraging the wearer to face the future with clarity and purpose. \n\nThrough the act of wearing Arunika, the individual is invited to tap into their inner reservoir of strength, knowing that no matter how turbulent the journey may be, they carry with them a symbolic home—a sanctuary of courage and resilience. In essence, Arunika transcends its physical form, becoming a wearable narrative that encourages the wearer to embrace the ebb and flow of life, confident in their ability to navigate the vast, uncharted waters ahead."
 },

 70:{
   "wall": 4,
   "note": "self portrait in bk and wh",
   "firstName": "Paree",
   "lastName": "Gauba",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "N/A",
   "description": "Through this iteration of my self portrait, I attempt to explore my complex cultural identity. I am Indian, but I moved to Singapore as a teenager and as a result, during my developing years, I was never enough 'Indian' for folks back home or 'caucasian' enough for people in my international high school. Moving to New York for higher education has given me the time and space to truly embrace my culture without judgement– yet I still harbor a sense of cultural conflict within. The composition began with minimal cultural patterns visible behind my posterized portrait. However, in this second iteration, I utilized a white pen and drew these patterns to take over the composition, covering some of the previously printed patterns using black acrylic paint in the process. In essence, the evolution of this piece itself alludes to what I hope to achieve eventually– true and unapologetic  acceptance of my culture. Moreover, the analog iterations made the composition more cohesive, and I have grown to be satisfied with this work post the second round of modifications."
 },

 71:{
   "wall": 4,
   "note": "just the photo with a mask",
   "firstName": "Prin",
   "lastName": "Suwannachin",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "The Extroverted Introvert Mask",
   "description": "As I interview and get to know my partner better, I'd like to encourage her to be more extroverted and feel free to express herself to her fullest. The mask represents her balance of being an introvert, yet she is still an outgoing person and is eager to meet new people and willing to expand her comfort zone within her own style. \n\nModel: Mina Chen"
 },

 72:{
   "wall": 4,
   "note": "three faces, cut out elements",
   "firstName": "Queena",
   "lastName": "Lee",
   "collaborators": "",
   "program": "Undecided",
   "course": "Time",
   "title": "Past, Present and Future",
   "description": ""
 },

 73:{
   "wall": 4,
   "note": "flowers",
   "firstName": "Sean",
   "lastName": "Yan",
   "collaborators": "",
   "program": "Product Design (BFA)",
   "course": "Space and Materiality",
   "title": "Constructed Bouquet",
   "description": "I personally felt like the prompt was a little limited as we could only choose between a bag, chair or toy. I decided to make a flower vase with flowers in it as it could fall under the category of a \"bag\" since it's an object that is holding something. We were only supposed to choose two polyhedron shapes for the objects but I decided to go with multiple different shapes as the main objective of this project for me was to use as many polyhedron shapes as I could. I made the flower vase and flowers from bristol paper as I liked the flexibility of the paper and how thin it was, despite the challenges of it folding and bending too easily. The flower vase consists of a dodecahedron for the base, pentagonal pyramid for the middle and a partial icosahedron for the top/opening. The roses consists of a partial icosahedron stuffed with scrap pieces of bristol paper to act as the petals and the asters are constructed with a partial dodecahedron for the petals and pentagonal prism for the pistil. For the stems, I used wooden dowels. The vase is connected and held together by brass fasteners and the flowers are held together by paper tabs and slits. Additionally, I was able to hold the flowers onto the stems by drilling two holes into each wooden dowel and sticking in small wooden sticks, one underneath the flowers and one within the flowers to hold it in place. For the last step, I painted everything with spray paint."
 },

 74:{
   "wall": 4,
   "note": "\"Rewind\" Type-Portrait bk and wh",
   "firstName": "Sharanya",
   "lastName": "Khemka",
   "collaborators": "",
   "program": "Strategic Design and Management (BBA)",
   "course": "Drawing and Imaging",
   "title": "Rewind",
   "description": "This portrait was done using Illustrator, it is a childhood picture of me composed using lyrics of my favorite songs over the years, quotes that inspired me, and emotions I felt during specific stages of my life."
 },

 75:{
   "wall": 4,
   "note": "charcoal self portrait",
   "firstName": "Thuc",
   "lastName": "Pham",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Time",
   "title": "Portrait of a Blank Slate",
   "description": "My project illustrates how I experience time, or the lack thereof, during sleep. As I rarely dream or my dreams lack a coherent timeline, the concept of time simply does not exist when I am unconscious. To portray this “unreal” landscape, I painted an almost surreal depiction of myself within my dream, surrounded by moving elements yet remaining still. Drawing inspiration from the classic work “Ophelia” by Sir John Everett Millais, I painted myself to be “dead” in sleep, robbed of my sense of time. The charcoal created a black-and-white filter on the scene, separating the awake audience from the serenity and stillness of the piece."
 },

 76:{
   "wall": 4,
   "note": "Graphite Self-Portrait",
   "firstName": "Vicky",
   "lastName": "Tang",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "Fate",
   "description": "This is a self-portrait of myself. In the image that I created myself in, I added a hand with red string on it, showing how there is fate behind everything. On the walls, I have string and lyrics of my favorite song."
 },

 77:{
   "wall": 4,
   "note": "",
   "firstName": "Yujin",
   "lastName": "Seo",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Space and Materiality",
   "title": "Friendship",
   "description": "When choosing what to make with wire, I looked back to my life and considered what my real priorities were, and what values I always thrived to keep. They all connected to one conclusion. Relationship with friends.\n\nI have chosen this picture after scrolling through hundreds and thousands of photos, because I thought it most perfectly fitted the definition or the value that I wanted to portray through this relatively simple project. He is my old friend who were in the same hospital after we were born- so basically someone whom I have been friends with for my entire life."
 },

 78:{
   "wall": 4,
   "note": "digital collage",
   "firstName": "Zoe",
   "lastName": "Finger",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "N/A",
   "description": "I created this piece using photos I've taken of things that I find beautiful. I wanted to put together a piece of art that portrays the way that I look at the world, and by using my own photographs to create one unified image I think that I succeeded in doing so."
 },

 79:{
   "wall": 4,
   "note": "origami portrait",
   "firstName": "Eden",
   "lastName": "Schulman",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Space and Materiality",
   "title": "N/A",
   "description": "Once I completed the wooden frame during class, we were able to decorate with whatever materials we wanted. We did have to make sure to add out plastered elements on them. I decided to plaster jewelry pieces of mine that have meaning to me. I also decorated the rest of the frame with origami cranes that I made. As a young kid, I was obsessed with folding origami cranes. In my free time I would always fold cranes. If you folded 1000 cranes, you could make a wish. The self portrait part of the project I did on Procreate. I then printed it out to fit into the frame. I wanted the self portrait to take on a realistic look and create a warm toned aesthetic."
 },

 80:{
   "wall": 5,
   "note": "pink dress w black bows (use real garment, not images)",
   "firstName": "Alexia",
   "lastName": "Behar",
   "collaborators": "Alyssa Kim",
   "program": "Strategic Design and Management (BBA)",
   "course": "Integrative Studio 1",
   "title": "N/A",
   "description": "The initial step of bridge 2 required us to interview our partner with the twelve questions by Bhanu Kapil for “Vertical Interrogations”. This interview would be critical in order “to consider how personal identity is made and changed” and “to create a wearable object that shifts the identity of the wearer. What stood out to me whilst interviewing Alyssa was the contrast between Alyssa’s experience living in America whilst knowing and appreciating Korean culture and its values. After making a moodboard, the piece of clothing I designed would encompass several components of this version of Alyssa’s identity. Pink was chosen as the colour for the dress as I thought it would reflect the concept of girlhood but also how it is naturally associated with female childhood since pink acts as a major part of gendered associations and a gender binary. I also decided to incorporate a Brazilian technique of sewing circles of fabric and then sewing them together, each individual circle named \"fuxico\". I was inspired Marina Bitu. One of my first final ideas was to make a Durumagi, a traditional style Korean coat with many Goreum, which is a one loop bow used in hanbok, traditional Korean wear. Underneath the coat, there’d be a more mature and revealing dress. The two pieces would represent the identity shift of Alyssa perception of her self in the past versus the present. However, I decided to merge both of my designs into one and just focus on enhancing one shift in Alyssa’s identity. This was the identity before Parsons and who she sees herself as a child. The final design included four Goreum to reiterate being wrapped. The process of making the dress contributed to my work for Seminar, in which I wrote about seeing Alyssa in the garment as a bystander."
 },

 81:{
   "wall": 5,
   "note": "garments (shirts) not paintings",
   "firstName": "Anna",
   "lastName": "Bolla",
   "collaborators": "Isabella Mchale",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Loss and the Emptiness that Follows",
   "description": "This project is about creating a painting and a sculpture that work together but can also be shown separately. The memory we connected on was the unintentional absence of a father figure. Our fathers passed away when we were 11 due to unforeseen circumstances.  \n\n For the painting part of this project, Isabella used a reference image from Google to sketch the outline of the lungs. On top of that, Isabella was inspired by the lightboxes doctors use when taking a closer look at people’s medical scans. As for the sculpture part, Anna was inspired by Anonymous artists who made grief sculptures out of clothing. \n\nFor this project, Anna distressed two recycled men’s dress shirts to create a kind of ghost-like shape. Isabella painted two canvases black and cut out lung-shaped holes, connecting them with the scraps from the shirts. When presenting this artwork we decided to hang the sculptural element behind the painting, with the intention of it being viewed through the painting. \n\nThe ghost silhouettes that Anna created using the shirts symbolize the absence of our fathers in our lives, they are now gone but fragments of them remain in our memories. As for the painting part, we both connected on the fact that the loss of healthy lungs was a big part of our father’s death. Ultimately we wanted this painting/sculpture to be like looking at loss and the emptiness that follows."
 },

 82:{
   "wall": 5,
   "note": "balloons",
   "firstName": "Carina",
   "lastName": "Dai",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Time",
   "title": "Captured",
   "description": "For this piece, I was thinking of letting people who I love to blow up balloons and filling a container with these balloons. The force that the balloons exert on one another makes them distorted, yet they are still and steady in a structured way. Over time, each balloon will slowly lose air and deflate, which might cause the gap between each balloon to widen and get to the point where the surfaces of each balloon no longer touch each other. The deflated balloons might eventually scatter to the bottom of the box at the end of the semester. By capturing the breath of those I love, and through this change in relationship between the balloons, I wish to concentrate on the question whether tension, conflict, and relationships always fade away?"
 },

 83: {
   "wall": 5,
   "note": "wooden shoe",
   "firstName": "Emma",
   "lastName": "Li",
   "collaborators": "",
   "program": "Product Design (BFA)",
   "course": "Space and Materiality",
   "title": "The High Heel Study",
   "description": "To understand the nature of an object through different forms of observation and translation, it is important to understand the construction of the object. As such, to understand the form of my chosen object, the high-heeled shoe, I created an orthographic drawing that allowed me to visualize the accurate dimensions of the shoe using the side view, top view, and front view. To further understand the shoe, I brought it to life from my drawings using 20 gauge wire to create a life-size model. With this 3D model, I was able to gain a better understanding of the way the shoe is constructed, thus, allowing me to become creative with designing a wooden structure that represented the shoe with 5 intersecting planes. As a result, this intimate study of my object allowed me to gain a deep understanding of how objects, specifically high heels, are constructed and how different elements of it interact with each other."
 },

 84:{
   "wall": 5,
   "note": "Collab w Serena Huang",
   "firstName": "Grace",
   "lastName": "Gallagher",
   "collaborators": "Serena Huang",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Distress",
   "description": "This project consisted of us making a mask to replicate a certain emotion. The emotion we choose was distress or fear. We wanted to have interactive parts of the mask, so we had the skin being pulled away from the mask as if it was pulling the skin layer off of the face. This mask can represent a deeper meaning about feeling isolated and wanting to escape. Sometimes when we face large emotions we tend to self destruct instead of finding the logical solution to the problem and emotions. The person is pulling the skin off in hopes of it getting better or escaping, but instead this is very self destructive leaving the person with the face underneath."
 },

 85:{
   "wall": 5,
   "note": "great sculpture and story about identity. also include photo of piece with student",
   "firstName": "Jessica",
   "lastName": "Saadia",
   "collaborators": "",
   "program": "Strategic Design and Management (BBA)",
   "course": "Space and Materiality",
   "title": "Radiant Roots",
   "description": "As a Middle Eastern Syrian Jew, my community plays a crucial role in influencing my outlook on life and world views. Our past molds us into who we are today by providing us with a value system and moral compass. Ties to our roots nurture individuality and foster exchange of culture within the melting pot of NYC. As a first-generation American, I  decided to preserve my Syrian Jewish culture instead of shifting away from it to fit in. I felt that noticing the crossover of one’s past and future is crucial in forging a distinct identity.\nInspired by my heritage, I created a symbolic chandelier highlighting the importance and weight history has on shaping our future. This chain-suspended light fixture is made up of an 11-sided wooden polygon with a hinged top door, bottom light socket and adorned with raw branch pieces throughout. The suspended branches symbolize the metaphorical and literal foundation of a person, equivalent to the roots of a tree. The Arabic and Hebrew inscriptions were a result of bible lessons from my Syrian-born father and grandfather. It translates to “A people with no past has no future.” \nThis project allowed me to deepen my cultural understanding, uncover new aspects of my identity, and bond with family over stories of the past. Although Parson’s has students of various backgrounds, we can all benefit through rooting ourselves in history."
 },

 86:{
   "wall": 5,
   "note": "just one with baskets ",
   "firstName": "Khanh",
   "lastName": "Phan",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "\"Anyone want to buy flowers?\"",
   "description": "This work is a transformed version of the baskets that were originally used by the street vendors in Vietnam. With two baskets on the shoulders, street vendors sell all kinds of goods that buyers need such as noodles, snacks, tofu, or newspapers while singing out loud to advertise for their goods. Here, this artwork presents the main product in the baskets as flowers. This object has been considered as a street icon, a Vietnamese culture since it has been used for hundreds of years; however, what the street vendors carry is not simply a culture representation, but a burden that they have to make their living day by day based on these baskets. Their whole family’s lives rely on how many flowers they sell per day. After decades, street vendors become a job that is passed from generation to generation. This is the reason why I chose recycling plastic spoons as the main materials for this piece. The cycle of reusing or recycling the materials somewhat symbolizes the repeating cycle of these street vendors baskets over decades."
 },

 87:{
   "wall": 5,
   "note": "Wood boot",
   "firstName": "Mabel",
   "lastName": "Lok",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Space and Materiality",
   "title": "Study of a Boot",
   "description": "As it was my first time coming across orthographic drawing, it was difficult at first. However, as soon as I got the flow, the orthographic drawing became easier to follow. During the study of the boot, I looked closer at my photographs and the real life object. Drawing this out, I had to be very mindful of the softness of the pencil as it gives different tonal values in the drawing.\n\nThe boot made in both wire and wood are made exactly to the real size, which is up to knee height. The wire work was where I found most difficult, since I struggled in the beginning to evenly coil the thicker 1/18 gauge. As I got familiar with the material, I began to work towards building the structure so that the tall boot can stand alone - using thin 1/24 wires to outline the shapes as well as to hold the balance of the structure. \n\nThe wood work required much more dedicated thinking, measuring and planning. Following my orthographic drawing, I shifted the measurements to a 4'x4' 1/2\" plywood. When cutting on the band saws, I added the wavy outline on the sides to imitate the crease that leather fabric creates. Then finally, the connector slots took the most consideration in maintaining the outline of the shoe, as well as creating dimension and structure. Overall, I enjoyed making the wooden boot."
 },

 88:{
   "wall": 5,
   "note": "Wire boot",
   "firstName": "Mabel",
   "lastName": "Lok",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Space and Materiality",
   "title": "Study of a Boot",
   "description": "As it was my first time coming across orthographic drawing, it was difficult at first. However, as soon as I got the flow, the orthographic drawing became easier to follow. During the study of the boot, I looked closer at my photographs and the real life object. Drawing this out, I had to be very mindful of the softness of the pencil as it gives different tonal values in the drawing.\n\nThe boot made in both wire and wood are made exactly to the real size, which is up to knee height. The wire work was where I found most difficult, since I struggled in the beginning to evenly coil the thicker 1/18 gauge. As I got familiar with the material, I began to work towards building the structure so that the tall boot can stand alone - using thin 1/24 wires to outline the shapes as well as to hold the balance of the structure. \n\nThe wood work required much more dedicated thinking, measuring and planning. Following my orthographic drawing, I shifted the measurements to a 4'x4' 1/2\" plywood. When cutting on the band saws, I added the wavy outline on the sides to imitate the crease that leather fabric creates. Then finally, the connector slots took the most consideration in maintaining the outline of the shoe, as well as creating dimension and structure. Overall, I enjoyed making the wooden boot."
 },

 89:{
   "wall": 5,
   "note": "rib cage",
   "firstName": "Marianne",
   "lastName": "Jeffs",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Space and Materiality",
   "title": "A Borrowing of Bones",
   "description": "Looking at how our bones protect the important parts of our body, I wanted to emphasize the fragility they hold and leaves parts of us vulnerable. Specifically focusing on the ribcage, this armors both the heart and lungs which are essential to the human body. When feeling overwhelmed and overworked, our bodies can react to this, such as panicked breathing and increased heart rate. When I am caught in a panicked state, I tend to hold my hand over my heart and ribcage to remind myself to slow down. I decided to use a muslin cloth to imitate medical gauze, putting scrap pieces of fabric over certain bones to emphasize that bones can be brittle, so it is important to take care of every part of yourself. The eyes on both the singular left lung and heart add into the idea of our well-bieng because they are always watching us, for when we feel affected so can our bodies."
 },

 90:{
   "wall": 5,
   "note": "hand",
   "firstName": "Rachel",
   "lastName": "Yan",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Space and Materiality",
   "title": "n/a",
   "description": "Branching off of the ideas of haptic and touch in the assignment prompt, I created this piece with the intention of the piece being able to move, via touch from the viewer. Hands can communicate a variety of messages, so I wanted the choice in message to be up to the touch of the viewer, to portray whatever they wanted to say. My initial drawing was of a hand with it's finger's crossed, because I wanted a sort of signature on the piece, and the letter \"R\" in sign language is the pointer and middle finger crossed, with the ring and pinky tucked behind the thumb. That's why the thumb is stationary and positioned the way it is, to keep a remnant of the letter R in the piece, even if the other fingers are positioned differently. I chose to use wood for the fingers and clear acrylic for the palm, as I wanted the focus to be on the posability of the fingers, and the notion of touch as well."
 },

 91:{
   "wall": 5,
   "note": "head",
   "firstName": "Roman",
   "lastName": "Ingrassia",
   "collaborators": "",
   "program": "Architectural Design (BFA)",
   "course": "Space and Materiality",
   "title": "N/A",
   "description": "This a head made of organic wooden shapes and 16 gauge wire, it is about 10\"x12\"x18\". I used the laser cutter and some hand cutting to make my shapes, and then drilled holes, and connected with wire."
 },

 92:{
   "wall": 5,
   "note": "foot",
   "firstName": "Roman",
   "lastName": "Ingrassia",
   "collaborators": "",
   "program": "Architectural Design (BFA)",
   "course": "Space and Materiality",
   "title": "Foot",
   "description": "This is a plaster cast of my foot I made for my Space and Materiality class. for the mold I used Accu-Cast 570 alginate, and for the cast I used 5 pounds of Hydrocal statuary plaster. This work is obviously inspired by Roman copies of ancient Greek statues, although unlike the original marbles, mine will remain uncolored like the museum works we admire today"
 },

 93:{
   "wall": 5,
   "note": "bubble wrap",
   "firstName": "Saanvi",
   "lastName": "Gupta",
   "collaborators": "",
   "program": "Strategic Design and Management (BBA)",
   "course": "Integrative Studio 1",
   "title": "Reuse Rethinking project",
   "description": "For this project we were required to use materials lying around the house to make something of use. We were made to experiment with the materials; in my case the bubble wrap. I experimented with different techniques, boiling it, weaving it, pleating and knotting it. That i how i came up with the idea of The bubble wrap dress."
 },

 94:{
   "wall": 5,
   "note": "plush star ",
   "firstName": "Sadie",
   "lastName": "Kaino",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Integrative Studio 1",
   "title": "What are you?",
   "description": "This piece is a pillow inspired by Japanese streetwear specifically in Harajuku, drawing from elements of my childhood and life through beading, plush objects, embroidery, text, and mosaic tiles. The object represents how my mixed Japanese and Italian heritage has led to countless comments throughout my life asking \"what are you\" referencing my race and 'complimenting' my \"exotic\" features. Even within my own family, relatives from my Italian side continue to comment on my 'exoticness' isolating me from those familial spaces as well. The text \"しゅしんどこですか\" translates to \"Where are you from?\" in Japanese, further speaking to the idea of being an outsider in Japanese spaces as well."
 },

 95:{
   "wall": 5,
   "note": "",
   "firstName": "Sofia",
   "lastName": "Yu",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Space and Materiality",
   "title": "My Love",
   "description": "Through this weaving, I wanted to express the feeling of love. Specifically, the feeling of having a crush on someone. I wanted to express how it feels to be in love, from the excitement to the craziness to the joy of it. Shades of pink and red melt together and different organic textures spill out of the work, like overflowing feelings. The heart is on the left side, representative of the heart in my chest, and the various yarns, fabric and ribbons surrounding create a chaos that feels like butterflies in one’s chest. Love is simultaneously messy and pretty, and I think the medium of weaving really properly expressed that."
 },

 96:{
   "wall": 5,
   "note": "",
   "firstName": "Sophia",
   "lastName": "Ormond",
   "collaborators": "",
   "program": "Photography (BFA)",
   "course": "Space and Materiality",
   "title": "Coiled Mind",
   "description": "This self-portrait serves as a visual manifestation of the inner workings of my mind. Prompted by the theme \"It's All In Your Head\", this head encapsulates my mental landscape. My mind is complicated but creativity flows through me like the blood in my veins. I'm addicted to spontaneous art- art that tells you where to go rather than sticking to a set of fixed guidelines. \"What happens when making becomes a form of thinking and thinking becomes a form of making?\" is a question for discussion. I believe that my head answers that question... this is what happens. Using air dry clay and pipes for armature, I built a head and then completely wrapped it in endless variations of coils."
 },

 97:{
   "wall": 5,
   "note": "Head piece/mask how to display? perhaps include a picture for reference?",
   "firstName": "Sophia",
   "lastName": "Wang",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Reach for Home",
   "description": "From the letters and interviews with my partner, I was able to learn about her fear of leaving home and coming to NYC from Albania. In this contemporary mask, I decided to include elements of Albania, their nation’s flower red poppy, and the beads commonly found on their traditional clothing. I aim to use these elements to create a sense of home, constructing a large-scale mask capable of surrounding or wrapping the head and body. I wish to convey a comforting message that family will always be there to support our back and that connections will not disappear due to the physical separation.\n\nMoving on to the construction details of the mask, the flowers on the mask, shoes, and the draping vines down the body showcased are stitched on a fabric base and are either hand-crocheted or made with papier-mâché. The silhouette is to resemble the shape of the red poppy and is supported with thin wire stitched to the fabric. This is achieved by wrapping nylon shoelaces to the wires, providing an edge capable of stitching. The mask itself is attached to an altered headband from the inside of a construction hat, enhancing the wearability of the mask. \n\nThe bedroom of our dorm is the location selected for the photoshoot, and the uncanny is emphasized greatly by the fact that the model is wearing her shoes on the bed. In my culture, wearing outdoor shoes on the bed is something uncommon and weird, as they contaminate the ultimate place of privacy and relaxation. Therefore, the fact that the figure in the photo was wearing shoes while reading comfortably on the bed resulted in a great sense of uncanny. This also indirectly leads back to the statement of her not considering the dorm bedroom truly as home."
 },

 98:{
   "wall": 5,
   "note": "",
   "firstName": "Zahra",
   "lastName": "Aboul-Magd",
   "collaborators": "",
   "program": "Other",
   "course": "Space and Materiality",
   "title": "N/A",
   "description": "Anxiety is something most people have these days and there are way of dealing with it such as medication, therapy etc. The main thing I have found works best for me is controlling my breath. When given this prompt I found myself feeling overwhelmed with anxiety, unable to figure out what to do. I immediately thought about lungs. My lungs are what keep me stable and bring me back to earth. For my piece I created lungs out of wool to give the effect of the softness of lungs but also the firmness. I included a real breathing tube to replicate the treacea but not to scale of the real one in contrast to the scale of the wool lungs I made I order to depict a deep breath or the never ending deep breaths I take."
 },

 99:{
   "wall": 6,
   "note": "garment, not interview/publication",
   "firstName": "Anishka",
   "lastName": "Tewari",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Persona Unlocked",
   "description": "“Persona Unlocked” is a wearable art piece that explores the concept of hidden identities and the narratives that often remain concealed beneath the surface. The project’s objective was to create a unique wearable art piece that exposes an alter ego for my partner.\n\nInitially, she came across as someone with a minimalistic fashion taste and a straightforward way of life, and someone who was super introverted . However, as I got to know her better, I discovered layers of her personality that she rarely shared with others. Beneath her reserved exterior, I found a playful, carefree, and somewhat goofy side that exudes happiness.\nWhile she does have minimalistic fashion sense, and avoids colorful maximal fashion, there is a part of her that is attracted to that side of fashion and wished she embraced it.\n\nI wanted the inside to be adorn not just with color for aesthetic but with little elements that tell us more about Joanna’s diverse facets of her personality.\n\nI started by  sourcing waste material from the fashion rooms to use and my colorful base.\nI bought pastel pom poms and beads to create funky flowers, and used old candy wrappers stuffed with pom poms, to add more playful elements.\nI created tiny teddy bears with the pom pom too, to play with the childish energy.\n\nI also wanted to replace the traditional buttons on the jacket with latches to emphasize the idea of unlocking the other side to her.\nonce i had added them, it resembled a straight jacket, playing even more into the idea of holding back and restraining ones trueself."
 },

 100:{
   "wall": 6,
   "note": "",
   "firstName": "Christina",
   "lastName": "Koo",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "Still Life",
   "description": "While creating this project, I wanted to get the most out of the different mediums I had and merge them together to end up with an interesting outcome. I cut out different parts of each medium and started to assemble them together, experimenting with the composition of the object layouts and seeing what worked and what didn’t—the whole process was mostly intuitive. The use of negative or positive space on the white background was something that I focused more on, as I wanted to draw more attention to the objects but also incorporate it into the actual drawing to create a compelling effect; for example, utilizing the white, negative space as the fabric the objects are placed on. My biggest takeaway from creating this piece was that making art intuitively and trusting your gut in the process of doing so has the possibility of resulting in captivating art."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Echo",
   "lastName": "Huang",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Drawing and Imaging",
   "title": "Please Write to Me",
   "description": "This is a unrealistic space where I combined bubbles and water in the sink with a children playground. I was inspired by the concept of liminal spaces, the spaces of transitions. The fact that liminal spaces,  like hallways and hotel rooms, can strike poeple's memories made me want to create one of my own. Thinking back, those indoor playgrounds in shopping malls always remind me of the friends I made a long time ago. The friendships were short, but they always stays in my memory. I think of forgetting memories similar to the process of water flowing down the sink. The memories stays like bubbles and they left a long-lasting moisture in your heart. I also included envelopes and letters to tell how much I wanted to keep in touch with them. But reaching out to them is like sending letters that never arrives. The feelings remain, but the people never return."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Eden",
   "lastName": "Schulman",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "N/A",
   "description": "For my imagined space, I decided to represent the feeling of being in a nightmare. My piece takes place in a dark hallway with multiple passageways. Those passageways seem like they offer a way out of this ominous hallway, but they don't. In my piece I wanted to capture the feeling of nervousness, anxiety, and fear. Because my piece is based off of the feeling of being in a nightmare and feeling trapped, I added elements like water filling the hallway up and strange thick branches riding up along the walls and floor. I also wanted this piece to be dark. The use of light and dark also implies in my piece that the further you look down the hallway, the darker it gets. and as you look into the other passageways, you see it leads into darkness as well. Which way is the way out? Are there any?"
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Edmond",
   "lastName": "Huang",
   "collaborators": "",
   "program": "Design and Technology (BFA)",
   "course": "Integrative Studio 1",
   "title": "Paranormal Synchronicities Movie Poster",
   "description": "A movie poster of a horror-themed supernatural thriller that was supposedly going to air on October 31st, 2023 (i.e. Halloween). The project for which I made this poster involved creating something that would enhance my assigned partner's beliefs. Since my partner had a lot of beliefs that erred on the supernatural and spiritual side and I was super fascinated with the horror genre, I opted to make a horror movie poster. I included a lot of elements that embodied the beliefs my assigned partner had - some more cursory and some more apparent. I even included her as one of the main characters in the made up movie."
 },
 {
   "wall": 6,
   "note": "Mask, print",
   "firstName": "Felicia",
   "lastName": "Hertada",
   "collaborators": "",
   "program": "Design and Technology (BFA)",
   "course": "Integrative Studio 1\nIntegrative Seminar 1",
   "title": "Beauty Inside",
   "description": "In this project, I made a comforting mask for my partner who sometimes afraid to start a friendship because of the possibility of getting negative effects. When concluding the social identity issue from the interview, I immediately thought of the quote \"Don't judge a book by its cover\". There can be so much beauty and possibility of strong friendships if we get to know people better and are not afraid to start friendships even though caution is important. From there, this mask was inspired where when it's dark or we are just starting to get to know someone, maybe that person can look dangerous, which here is indicated by the red wire. However, maybe behind it all there is the beauty inside that person that we can only know after getting to know them more closely on the brighter side."
 },
 {
   "wall": 6,
   "note": "the puppet",
   "firstName": "HYEONWOO",
   "lastName": "MOON",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "Plight",
   "description": "Through this painting, I expressed the image of our human beings gradually being destroyed and corrupted by the elements created by humans. A human being who regrets and tries to stop time, and yet another entity of evil that continues to be injected. Through all of these, it is expressed that the actions taken towards peace and a better future in the present are actually ruining our society even more and killing each other."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Ian",
   "lastName": "Ritter",
   "collaborators": "",
   "program": "Photography (BFA)",
   "course": "Integrative Studio 1",
   "title": "Boyscout",
   "description": "A tryptic of Lina, delving into the dynamics of home, heritage, patriotism, and identity.  The tryptic lacks narrative progression, instead operating as pieces of a whole."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Jasmine",
   "lastName": "Lin",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Integrative Studio 1",
   "title": "Alice in Wonderland",
   "description": "I was given two scenes from the movie Alice in Wonderland. I took it upon myself to photograph and photoshop my friends into the Alice in Wonderland scene. I chose to only show Alice instead of both scenes."
 },
 {
   "wall": 6,
   "note": "red and black",
   "firstName": "Jodi",
   "lastName": "Tay",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Drawing and Imaging",
   "title": "N/A",
   "description": "For this assignment, I created a structure with layers and windows. I chose red and black as my color palette to create a chilling mood, and I made the color of the ground and the sky similar in value to make the structure look as if it were floating."
 },
 {
   "wall": 6,
   "note": "Durer",
   "firstName": "Katherine",
   "lastName": "Whitman",
   "collaborators": "",
   "program": "",
   "course": "Integrative Studio 1",
   "title": "Study of Albrecht Durer “Melancholia I”",
   "description": "I made a direct study of Albrecht Durer \nEngraving “melancholia I” as my final project for studio. "
 },
 {
   "wall": 6,
   "note": "1 of 2",
   "firstName": "Mina",
   "lastName": "Chen",
   "collaborators": "",
   "program": "Interior Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Reflection",
   "description": "In this artwork I aimed to explore my inner personality, emphasizing the process of overcoming insecurities and shyness to connect better with others. For my past portrait, I depicted how, as a child, I wanted attention from my parents by appearing extroverted despite inherent shyness. Reflecting on the present, my portrait portrays an outwardly talkative and extroverted persona, masking internal struggles with opening up and fears of vulnerability. Looking towards the future, my focus shifted to a journey of personal growth, aiming to embrace insecurities and foster self-acceptance and confidence."
 },
 {
   "wall": 6,
   "note": "grid of photos",
   "firstName": "Minsung",
   "lastName": "Kim",
   "collaborators": "",
   "program": "Product Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "\"Double Life\"",
   "description": "Fabricating and morphing the truth is what many of us consider a Lie, in a life where we have the freedom to choose our actions as narrators we many times bend the truth. Whether to boost our social status or give the illusion that we are someone else this piece documents the two parallel worlds of reality and the tongue. People are condemned to their egos and pride, by contouring the truth of our failures we boost   a false sense of confidence, this series of photos documents a day of skating, the tricks that aren't landed, and the sometimes boring periods twisted into something more entertaining for us to tell. By blocking the full truth of events each and everyone of us in a sense live a double life, one that is given to us, and the other we share for self indulgence."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Tanya",
   "lastName": "Bansal",
   "collaborators": "",
   "program": "Design and Technology (BFA)",
   "course": "Space and Materiality",
   "title": "My most self",
   "description": "We first built a frame. I chose to use oil as the medium of my self portrait. I painted my working space in the morning, as I think I am my most self during that time. My behavoiur according to me is affected by a lot of things which is exhausting by but how the world works. But when I am waiting alone at 5am, there is no show, no reason to be, no motivation to do things a certain way, just me. It's just me being my most authentic self. That could be calm, angry, frustrated or anything that I deem fit for that day."
 },
 {
   "wall": 6,
   "note": "Photographs, he would like to print some of them in large scale. Which I think woould work well. ",
   "firstName": "Thomas",
   "lastName": "Maggart",
   "collaborators": "",
   "program": "Photography (BFA)",
   "course": "Integrative Studio 1",
   "title": "Pride of a man",
   "description": "I had made this project to represent how my life has changed since I have moved here and how I sort of feel like it is my duty to photograph New York life. These pictures encapsulate everyday life but also showcase things that add to the culture of New York such as established music producers, rappers and other fellow creatives. All of these pictures are taken on 35 mm film or a fujifilm digital camera. If I am selected I would like to blow up the image and show it as a large print."
 },
 {
   "wall": 6,
   "note": "scroll puddle dyptych",
   "firstName": "Tiffany",
   "lastName": "Liu",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Time",
   "title": "A Puddle",
   "description": "This piece fit due to its utilization of a long landscape canvas. As the reader views the puddle from left to right, the piece progresses through the stages of rain. Starting from no rain, drizzle, heavy rain, and to sunshine. Plants in the background also help depict the passage of time in the piece. \n\nI really wanted to create a piece that had length. We discussed in class about how art on historic scrolls was a fantastic example of a time map. Mainly because they told a story and by the time you got to x point, time has passed."
 },
 {
   "wall": 6,
   "note": "blue painting",
   "firstName": "Xizi",
   "lastName": "Zhou",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Time",
   "title": "年月日",
   "description": "For my work 1, two pieces are pink background. The left piece expresses the painful process that I wake up every morning or probably even noon. The green geometric shape is my bed. My bed sheet is green. The bed sheet is what I have used in school since junior high school, full of memories for me. I really love my bed, because bed is warm and comfortable, and love me forever. For the right pieces, I used watercolor and markers to paint. I like the evolution of Chinese characters. I can feel the flow of time. \n\nFor my work 2, there are four small parts. For the blue-background three, I was inspired by Monet. He painted the same things at different times. So I looked at the cube under the window at different times. The last cube is empty because in different weather and light, the cube has different colors and shadows, so I connect in mind that it's transparent. For the orange one, I really love the motion when my cat sneeze. I sketched her abstract."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Yinan",
   "lastName": "Xue",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Drawing and Imaging",
   "title": "Memory Palace-Mangrove",
   "description": "This project aimed to utilize the memory palace technique to construct a visual scene housing information to be remembered. My creative intention was to build an immersive mangrove ecosystem inhabited by native flora and fauna within an abandoned art gallery structure. This resonated with the concept of the memory palace by linking visual imagery with information storage.\n\nThe materials and architectural choices were relevant in creating an atmospheric, memory-enhancing space. The red glass and wooden art gallery induced a sense of wonder and discovery, while the scattered frames on the ground provided contained spaces to exhibit creatures. The three-tiered structure of producer (mangrove trees) - connector (glass strips) - repository (gallery) mirrored the ecosystem hierarchy.\n\nSketching using one-point perspective principles allowed me to accurately convey depth and scale when translating my mental envisioning onto paper. This informed the 3D modeling process in Blender to build a structurally-sound digital scene. Finally, vintage-toned posters helped further convey both the repository concept through splitting information into parts, as well as the passage-of-time ambience via the muted coloration. Ultimately, content resonance took primacy over stylistic elements."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Yujin",
   "lastName": "Seo",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Space and Materiality",
   "title": "Marionette",
   "description": "I have chosen to do an image of a wooden doll controlled by a hand, because I felt like it would fit the intention of the project, as well as reminding myself of my portfolio subject."
 },
 {
   "wall": 6,
   "note": "",
   "firstName": "Yuting",
   "lastName": "Wang",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Drawing and Imaging",
   "title": "N/A",
   "description": "My work includes a building and a girl. The building is The New School University Center, and the girl is me. Before I started school, all the information for the school I knew was from the Internet, and I didn't have any real experience. I fantasized about coming to The New School until I experienced what it was like to be a student at The New School. In my work, I was standing on the street and I could only see the outside of the building of The New School. I blew bubbles towards it, and the scene in the bubble contained my dormitory, my classroom, and the scene from inside the school, which represent my experiences at The New School. All the places in this drawing are in perspective. For colors I chose tetradic colors which are blue, orange, red, and green. I chose these colors to express the fantastic feeling."
 },
 {
   "wall": 6,
   "note": "Painting on cardboard",
   "firstName": "Zoe",
   "lastName": "Imas",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Integrative Studio 1",
   "title": "3 People in Harlem",
   "description": "My painting was heavily influenced by the neighborhood itself. I learned a lot about how Harlem’s history, specifically the Harlem renaissance, affected the culture in and around the neighborhood. My intention was to highlight the sense of community within the neighborhood and also to showcase Harlems beauty, as a way to counteract people’s preconceived notion’s of Harlem. My studio class inspired me to look deeper into the neighborhoods of New York and to base my work off of my own experiences and thoughts rather than what I can find online."
 },
 {
   "wall": 7,
   "note": "artist book",
   "firstName": "Anastasia",
   "lastName": "Smirnova",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Time",
   "title": "A Story About a Night",
   "description": "My artist’s book is a handmade artwork which develops the subject of the inner warmth in every person’s life. This artwork is made out of 22 embroidery pieces with the use of my own text and images illustrating it which creates an impression of reading a fairytale. The main goal of it is to make people think of a bright future ahead of them and calm down while holding a soft piece of art in their hands.My book tells my personal story of a trip in Ireland with one precious person. I am telling the story about seeing lights in the darkness as a metaphor of a bright future ahead, even if it is a hard time now. I want my book to transfer the warmth and that’s why I want to do it entirely handmade."
 },
 {
   "wall": 7,
   "note": "artist book/interactive (will the book be presented already cut out or will viewers interact with the book?)",
   "firstName": "Antara",
   "lastName": "Chatterjee",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Time",
   "title": "Detangling the eras",
   "description": "I decided to create a book related to hair because for my previous project I had recreated an image of me cutting my own hair and welcoming a new era of creative liberty. Similarly I wanted to make a book with different hairstyles from different eras. Each hairstyle from its respective era held immense significance and was seen as revolutionary even. The book not only contains visuals but text to dive deep into their historical significance. The white patches were hollowed out once I printed the book and thus once the viewer opened it, it had the same face for each hairstyle which I drew digitally at the end. It not only created a fun illusion but was symbolic of me trying on these various hairstyles and once again payed homage the picture representative of my creative liberation."
 },
 {
   "wall": 7,
   "note": "Ship cabin",
   "firstName": "Carolyn",
   "lastName": "Mottern",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Space and Materiality",
   "title": "Ship's Cabin-Model",
   "description": "A model of a ships cabin. The room belongs to the navigator of the ship. I remembered this room from a book my mom read to me when I was little. I wanted the design of the model to seem cozy and comfortable because the memory of my mom reading to me feels this way. I started with cardboard as the base and covered constructed the walls with slices of wood. I weathered the wood with paint to give it depth. Then I made the objects that fill the room like the maps and the fireplace. In the fireplace I put an electric candle to give to room a warm glow."
 },
 {
   "wall": 7,
   "note": "Diorama of car crash",
   "firstName": "Celine",
   "lastName": "Wang",
   "collaborators": "Lizi Chodrishvilii",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "DIORAMA A car crash on Broadway - Lafayette NYC",
   "description": "Crafted a three dimensional miniature model of a nyc “yellow taxi” crash on\nbroadway lafayette. Gloomy, sad, tragic scene of people escaping from the accident.\nNew York City is very fast paced and during rush hours, people seem to be in a hurry.\nTherefore, people tend to drive at a fast speed and sometimes aggressively, such as squeeze\nin between vehicles and any available opening to get by. This diorama represents a tragic\nseen of a crash to raise awareness of safety. To emphasize the importance of safe driving,\nwe made a tragic car accident scene, hoping to inspire New yorkers to drive safely,\nfollowing the signs to avoid any accidents."
 },
 {
   "wall": 7,
   "note": "",
   "firstName": "Daenie",
   "lastName": "Park",
   "collaborators": "",
   "program": "Strategic Design and Management (BBA)",
   "course": "Space and Materiality",
   "title": "Your ideas are getting snooped on",
   "description": "This artwork originated from the stress I experienced while I am taking a class that required me to create a physical construction that I had never done before in my life, having never learned art. Watching classmates who were familiar with creating artwork by hand effortlessly come up with creative ideas and dive into the project, skillfully handling various materials, made me feel a sense of relative deprivation. That led me to imagine having the hacking system in my body to listen to what kind of creative ideas others were conceiving in their head.\n\nThe inspiration for this artwork comes from the shape of a stethoscope. The narrative behind this art work is placing the ear shapes near people's hearts allows me to 'hack' their ideas. Fashioned after blood vessels, the red wire crochet metaphorically signifies the presence of a system within my body capable of hacking, completed with ears engraved with the words 'Your ideas are getting snooped on.' The collected ideas from the ears are stored in a memory chip situated within the central resin segment. I aimed to convey the complex anatomy of the human body by incorporating a varied selection of materials to the fullest extent, and I also sought to introduce the computer system into the organic framework for a contrasting effect."
 },
 {
   "wall": 7,
   "note": "not the video but the deck of cards. could be displayed in grid",
   "firstName": "Ginger",
   "lastName": "Vieth",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Space and Materiality",
   "title": "Heatless Curls",
   "description": "My found object for this assignment was a curling iron I had found at a thrift store. I wanted to continue a theme of electricity/technology for my assignment. Part of the prompt was to utilize the object in a way that it is not supposed to be used. For this, I played with the idea that you should not leave open wires around heat. I created a sculpture of a woman's head with her hair being made of wire, displayed through a short video of me curling her hair."
 },
 {
   "wall": 7,
   "note": "",
   "firstName": "Ireen",
   "lastName": "Jeang",
   "collaborators": "",
   "program": "Design and Technology (BFA)",
   "course": "Integrative Studio 1",
   "title": "Looming Clowns",
   "description": "I created two intertwined objects relating to my partner's social identity when she migrated to a foreign country and her previous alter ego project in studio class. Using fragile and sharp materials, I created a somewhat enclosed sphere to represent my partner's comfort zone that was on the verge of breaking down because of the negative words and actions she received when she first moved to Canada. The shadows of the clown's faces created from the string lights that looms over her personal bubble represent the negative, belittling attitude the people showed towards her."
 },
 {
   "wall": 7,
   "note": "small diorama",
   "firstName": "Junyi",
   "lastName": "Wang",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Escaping From My Room",
   "description": "This is a mixed media collage based on my childhood memory. When I was a kid, I really enjoyed watching TV. Not only because I could watch my favorite cartoons, but also because I believed that the voices and characters on TV made me feel like someone was with me. I wasn't alone. I'm terrified of being alone at home, but most of the time I can't control that because of my parents' busy schedules. The scariest thing was that the TV had no signal. I glued cotton and fabric into a teddy bear to represent my childhood. It also has black and white photos on it to express how much I wish my parents could be with me. I used a 3-D pen to draw a circle that looks like it wraps around the teddy bear and can also be used to hold the TV model. I drew the pattern on the ground in red and black and used swirling lines to show my emotions of fear, anxiety, and frustration."
 },
 {
   "wall": 7,
   "note": "",
   "firstName": "Krishna",
   "lastName": "Shah",
   "collaborators": "",
   "program": "Product Design (BFA)",
   "course": "Space and Materiality",
   "title": "Positivity of Negative",
   "description": "Through the project, I was able to make two versions of my piece- first a bit technical and the second more creative. I selected the my space to be the intersection of the the staricase. The creative model that I made had the concept of making stairs for the birds. I wanted to make the stairs for the birds as it was the exact opposit of the human stairs. Also I used more delicate and airy medium to make the transparent creative model of my project."
 },
 {
   "wall": 7,
   "note": "",
   "firstName": "Lily",
   "lastName": "McMahan",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Sustainable Systems",
   "title": "Tales of Grief and Hope",
   "description": "This piece is a hand-crafted book of stories which were specifically written with the intention of building the capacity of New Yorkers to view the urban environment as part of the natural world. The imagined, socially-ingrained duality which separates humans from 'nature' detrimentally fuels climate anxiety and grief. However, if we start to pay attention to the non-human species in our immediate environment, view them as autonomous beings, and create a kinship with them, then our urban alienation starts to melt away. In order to accomplish this, I wrote and illustrated three stories about iconic species/natural phenomenon in New York City: street trees, squirrels, pigeons, the bedrock, Central Park's boulders, and Manhattan's surrounding waterways. My research revealed that humans have always sought the archetypal stories, myths, and tales which explain our world and lend moral guidance. By continuing to write in this fable tradition, I hope readers gain a mystical understanding of the natural world which has been stripped away by modern science. I made many creative choices to ground the reader in the physical sensations of the natural world. First, I created each sheet of paper by hand, using junk mail and fragments of leaves. The unique texture on every page reminds the natural elements which create paper, unlike many high-gloss children's books today. Also, I bound the book using embroidery thread and a stick gathered from a NYC park. That the reader has a physical piece of another species in their hand while reading my stories. Additionally, I strung wood and stone beads together to make a bookmark. These child-friendly design choices appeal to their urge to make sense of the world around them through touch. It can also be appreciated by adults, as the stark contrast to mass-produced books reminds readers of their origins."
 },
 {
   "wall": 7,
   "note": "",
   "firstName": "Lucas",
   "lastName": "Hsu",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Transfer",
   "description": "The concept and design of my deck were inspired by the hyper-fixation of things I saw and felt moving to New York City, my awareness heightened by the concept of transfer – change, juxtaposition, turbulence. These objects and emotions I experienced are reflected in the meanings of the cards, which are written in the instruction manual.\n\nThe visual language of my deck approaches transfer through letterforms, specifically Chinese characters, and how I could juxtapose ideas of familiarity and unfamiliarity. For each card, I took a Chinese character that reflected the meaning of the card, deconstructed the strokes based on the Eight Principles of Yong, and then reconstructed the strokes into imagery that reflected the meaning of the card – creating visual juxtaposition. The objective and familiar Chinese characters turn into abstract forms to be questioned, similar to how I saw objects on the street or felt conflicting emotions moving to New York City – with a curious, questioning eye.\n\nThe manual is also fully bilingual, and for the definitions I used double-sided printing on vellum paper so both languages would appear on the same page."
 },
 {
   "wall": 7,
   "note": "",
   "firstName": "Mikhail",
   "lastName": "Lychagin",
   "collaborators": "",
   "program": "Strategic Design and Management (BBA)",
   "course": "Integrative Studio 1",
   "title": "searching for Identity",
   "description": "The idea is to show that we all consist from similar patterns. Maps of european cities are simillar to eye patterns and fingerprints. We all similar in the way of our differences. The main theme was shift that’s why I chose things that we cannot change like fingerprints and things that are definitely important part of our identity but could be changed like a place where we live etc"
 },
 {
   "wall": 7,
   "note": "book with video. if the video can't be displayed in the book, just display video on screen!",
   "firstName": "Nasongphorn (Pie)",
   "lastName": "Thongkukiatkul",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Time",
   "title": "Our Heart",
   "description": "I was inspired by my previous project, making a film and creating a book; I combined the book and video medium to create a unique experience for my audience - a video book. The story revolves around a character named 'Mr. Heart', and the major theme of the work is nostalgia and family. The untold story of Mr. Heart and his parents is brought to life in this work, revealing some of the unseen moments of their relationship. To evoke a sense of nostalgia for childhood memories, I decorated the book with vibrant colours and playful elements and added a special touch with a diary notebook from Mr. Heart's parents, complete with an animation. I aimed to create a warm and comforting experience for my audiences, giving the sense of closure we often felt in our younger years."
 },
 {
   "wall": 7,
   "note": "Book",
   "firstName": "Queena",
   "lastName": "Lee",
   "collaborators": "",
   "program": "Undecided",
   "course": "Time",
   "title": "My Personal Manifesto",
   "description": "A personal manifesto can guid and ground me on my values and beliefs. I reflect on myself from the previous years and discover my goals.\n It led me to find what my manifesto can refer to and lean in to.\n My manifesto reflects my current values and beliefs. It outlines how I want to be passionate and achieve, and how I can intend it to live my life. \nThe images were taken while I lived in Vancouver. Each image is the moment when I realized what was important in my life and was inspired."
 },
 {
   "wall": 7,
   "note": "torso",
   "firstName": "Shane",
   "lastName": "Smith",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Space and Materiality",
   "title": "Fragile Form",
   "description": "I chose my torso as my sacred body part. I did so because I have had a long, not great, relationship with food and my body. The piece was made to show the strength and power I get from this area of my body. I don't see it as being fragile, or weak, but strong. This is also where the orientation comes from as the body is put on a three legged base leaning towards the side with no leg, as if the body is holding itself up. I created a base out of newsprint paper and painters tape. I then used wire to create a bone structure around the piece. Using plaster strips, I formed the bones and curves further. I finished this process by using bigger sheets of plaster strips to stretch it across the form like skin. I wanted to play on how delicate my body appears by using \"fragile\"/moldable materials, but then turning them into something solid, something that can't be easily destroyed (which is a common correlation to things considered fragile). I also wanted the body to look moldable still, like clay, even in its final form. Using a mixture of acrylic paints helped with this look. To create the wood table base, I cut a flat piece of wood into a square, and then three wooded dowels at different angles and sizes. The goal was for the legs to look wobbly, and as if they have little support and that was achieved. In reality the wooden base is stable and only needs three legs to function. The base was secured with screws and wood glue, then stained/gloss finished. The final piece is supposed to show the strength in delicacy."
 },
 {
   "wall": 8,
   "note": "plaster",
   "firstName": "April",
   "lastName": "Hoffmeister",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Space and Materiality",
   "title": "The Maze With No Escape",
   "description": "The Maze With No Escape was Inspired by Ana Mendieta’s ‘Silueta’ figures. I wanted\nmy model to explore the limitations set \nonto women by society. Drawn by the \nsymbol of a maze, I decided to engrave\nan ‘inescapable’ maze into the figure. \nAiming to convey the social constructs \ninscribed into our culture. Furthermore, \nto amplify the purpose of this piece I casted a screw through the head of the \nfigure, depicting the violent nature of gender roles."
 },
 {
   "wall": 8,
   "note": "box",
   "firstName": "Arindam",
   "lastName": "Kalita",
   "collaborators": "",
   "program": "Product Design (BFA)",
   "course": "Space and Materiality",
   "title": "The tea box",
   "description": "This project was about highlighting the community that I belong or relate to. I come from a state in the Northeastern part of India called Assam. Tea plays a huge role in the Assamese culture. This Tea box was made keeping in mind the symbols of the Assamese culture. The laminated patterns on the exterior was inspired from the Gamusa (a traditional fabric). The lid of the box also features illustrations of Bihu dance which is the traditional dance form of the state. \nThe box itself has a lid and a drawer. The top part is supposed to be the compartment for two types of tea and the drawer acts as a storage for the spices that are supposed to go in the tea. \nThe designs are made using the lamination technique. First the the individual pieces were cut using the laser printers than pasted on the surface of the wood base to create the effect of carved wood. The box was stained using tea as well as its a more sustainable form of staining wood and also a good replacement for toxic artificial stains. The tea stain gives this box its soothing yellow bamboo colored patina.  \nThis tea box acts as an object that uses tea as a source to express the Assames culture on its five surfaces."
 },
 {
   "wall": 8,
   "note": "All three pieces Carina submitted feel related and would work well exhibited together ",
   "firstName": "Carina",
   "lastName": "Dai",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Time",
   "title": "A Wall's Silent Dialogue",
   "description": "In the relentless march of time, we are all witnesses to our own existence and the evolving world around us. In my piece, I sought to explore the concept of witnessing by capturing a series of photographs documenting the gradual destruction of a wall over time. I positioned myself in close proximity to the wall, adopting a perspective that intimately connected me with its process of decay.\n\nThis project invites viewers to engage with questions about perception and the transient nature of existence. It encourages viewers not merely to observe the photographs but to become witnesses themselves, contemplating the beauty in decay, the passage of time, and the ever-evolving nature of our world."
 },
 {
   "wall": 8,
   "note": "zine",
   "firstName": "Diya",
   "lastName": "Dhiman",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Come Back to Earth (pls)",
   "description": "I decided to explore the theme of addiction. Having witnessed the struggles of individuals battling various forms of addiction and recognizing the impact on both the individual and those around them, I aimed for a universally relatable approach. he goal was to create a narrative that could apply to any type of addiction, whether it be substance abuse, overindulgence in food, dependence on technology, or even an unhealthy relationship with a person.\n\nThe key challenge lay in finding an object that symbolized addiction. I settled on ramen, a universally comforting food. Addiction often begins with a sense of comfort and solace, much like the warmth of a familiar meal. However, as it deepens, the comforting noodles metaphorically transform into consuming worms, gradually hollowing out the individual and leaving only a shadow of their former self."
 },
 {
   "wall": 8,
   "note": "drawing with wire shoe",
   "firstName": "Emma",
   "lastName": "Li",
   "collaborators": "",
   "program": "Product Design (BFA)",
   "course": "Space and Materiality",
   "title": "The High Heel Study",
   "description": "To understand the nature of an object through different forms of observation and translation, it is important to understand the construction of the object. As such, to understand the form of my chosen object, the high-heeled shoe, I created an orthographic drawing that allowed me to visualize the accurate dimensions of the shoe using the side view, top view, and front view. To further understand the shoe, I brought it to life from my drawings using 20 gauge wire to create a life-size model. With this 3D model, I was able to gain a better understanding of the way the shoe is constructed, thus, allowing me to become creative with designing a wooden structure that represented the shoe with 5 intersecting planes. As a result, this intimate study of my object allowed me to gain a deep understanding of how objects, specifically high heels, are constructed and how different elements of it interact with each other."
 },
 {
   "wall": 8,
   "note": "Deck of cards. Would need a vitrine or can be installed in the wall. ",
   "firstName": "Grace",
   "lastName": "Han",
   "collaborators": "",
   "program": "Architectural Design (BFA)",
   "course": "Integrative Studio 1\nIntegrative Seminar 1",
   "title": "Values Compass",
   "description": "This deck of cards is a handcrafted deck of 104 creative cards designed for players to discover through interaction with art and creative writing practices, what their core values, identities, aspirations, and personalities are. It wishes to give guidance and reflection, or be used as educational material with artistic flair, showcasing from game and action, the importance of knowing who we are and acting not only from mere self interest but from passion of life and the future, of the world and those around us. \n\nI was inspired by a book about a traveler who researched 101 countries and what their 101 values are. 52 cards present these unique values mined from global perspectives, and 52 transparent cards showcase abstract, intuitive designs and drawings. Abstract forms and shapes transcend cultural boundaries, and can be enjoyed universally. I thought of the human action associated in the pursuit of a value, and with least words possible, manifested images in a continual, rhythmic way. Players first interact and pick illustrations, which pivot upon one’s instinctual and visual inclinations, or emotional intelligence. They then find the matching value from the manual, such as 'Endurance' or 'Happiness' and reflect, have discussions with fellow players, or journal about their choices. Playing continues until one ends up with a set of values which speak to them the most. \n\nThis skewed slightly from the original prompt of the assignment which was closer to a deck of Tarot cards. I ventured through the process and gained a lot of creative freedom and ideas as we explored disciplines in the world of cards/print during our studio classes. I am grateful for this project, to have navigated and experiment around the school in my first year, and also to express myself and my ideas."
 },
 {
   "wall": 8,
   "note": "clay object",
   "firstName": "Hohyun(Michael)",
   "lastName": "Cho",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "On the Sunny Side of the Park",
   "description": "My project is based on a memory about a date with my girlfriend. I used air-dry clay and pottery tools to make a flower vase. This artwork is special to me because it captures the memory of our most memorable moments during our relationship. I focused on one of our favorite spots-Washington Square Park. A place where we can share a cup of coffee and decompress while enjoying the live jazz. Another important aspect of our relationship is flowers. We always marked any special occasions, celebrations, anniversaries, and sometimes just because. Therefore, I wanted to create a sentimental and personal vase filled with our memories so she can always have a place for our flowers. A small and unnoticed detail that can be overlooked is the coat of coffee I glazed over the vase. I did this because coffee was the first thing we bonded over before starting our relationship. As time went on this love for coffee has been a staple in our relationship."
 },
 {
   "wall": 8,
   "note": "little building",
   "firstName": "Madeline",
   "lastName": "Teska",
   "collaborators": "",
   "program": "Design History and Practice (BFA)",
   "course": "Space and Materiality",
   "title": "N/A",
   "description": "For this assignment, I am drawing a lot of inspiration from my personal experiences at gay bars and as a member of the LGBTQIA+ community. Through this project, I am going to recreate the scene of a gay bar while referencing my life as a lesbian and member of a supportive and empowering community. I am taking a lot of inspiration from the lesbian pride flag and will be using primarily red, pink and yellow colors for my piece. Pride flags are a predominate symbol of LGBTQIA+ Pride and have been used to showcase that for many years. Gay bars have adapted through history as a safe haven for my community, a place to express yourself freely without judgment or fear. I have spent a long time struggling with my personal forms of self expression and was unsure of who I wanted to be. Although, when surrounded by the love and safety of my community, a gay bar always feels like home."
 },
 {
   "wall": 8,
   "note": "cards and diorama",
   "firstName": "Saanvi",
   "lastName": "Gupta",
   "collaborators": "",
   "program": "Strategic Design and Management (BBA)",
   "course": "Integrative Studio 1",
   "title": "Suramya",
   "description": "My card deck explores a fusion between Indian traditions and the dramatic flare of Bollywood. The Indian culture is a vibrant tapestry of traditions, values and practices that continue to evolve while retaining their deep-rooted significance, on the other hand, Bollywood is a unique combination of entertainment, music and fun. My aim is to find a unique cultural experience for the players and viewers alike. The deck can be meticulously arranged, and the player may select up to 3 cards. Each card within the deck is imbued with specific emotional or situational themes which portray the player's current situation. Furthermore, each card also has its own Bollywood song. The link to the playlist is given at the end of the manual. In addition to their specialised use, these cards can also be employed in a conventional manner similar to normal playing cards."
 },
 {
   "wall": 8,
   "note": "",
   "firstName": "Sadie",
   "lastName": "Kaino",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Space and Materiality",
   "title": "N/A",
   "description": "This piece is put together to create a very geometric object, while working with softer and less rigid materials. I designed the individual cells to create the illusion of a second form within the pink exterior, while none of the patchwork tiles actually touch."
 },
 {
   "wall": 8,
   "note": "head",
   "firstName": "Shane",
   "lastName": "Smith",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Space and Materiality",
   "title": "Stretched Perspectives",
   "description": "My head, based on my face, is stretched across my skull and held together by surgical pins (under the knife). It is a reflection upon body dysmorphia and how the face is nothing but a moldable/displayable subject for people.The piece started with a foam head. I shaped it with a heated metal tool to get the shape of my own bone structure in the front, and then a spine in the back. I covered the back with air dry clay and then let it set to get the look of an exposed skull. I decided the leave the dry cracks as it felt more authentic. I then covered it in a sparkly, translucent power, and added silver leaf to the center crease. For the face, I made a mold of my head/ears using plaster strips. I chose to keep a \"normal\" expression as if the surgery to my face that is so extreme was something I was familiar with/used to. I then dyed brush on rubber and used my plaster mold, as well as the paper extensions I added on, as a base to brush it onto. After a couple hours the cast slipped right out and It slipped onto the foam head like a glove. I pulled everything back and connected the ears with sewing pins so they were more secure and hid them with the excess rubber. I added my earrings, and carefully added a small gaged wire in the back of the skull/onto the latex skin making it look like they are doing the job of pulling the face back. For a final touch, I placed everything on a clear sheet base, that is held up by a half inch cylinder, to give the illusion of it floating slightly off the table while being presented."
 },
 {
   "wall": 8,
   "note": "",
   "firstName": "Suhani",
   "lastName": "Mukherjee",
   "collaborators": "",
   "program": "undecided (BFA)",
   "course": "Space and Materiality",
   "title": "A heel",
   "description": "I believe that the objects and possessions we have, such as my black heel, are not just material items but carry deeper meanings. These objects we own can serve as symbols or reflections of our cultural background, personal connections, and relationships. In the context of the culture of my object, this strappy black heel was gifted to me by my mother, with the prefixed excuse that she ordered the wrong size of it online. Therefore for me, it is a symbol of this silent show of affection between my mother and I. In this case, this heel is also a symbol of the shared values and traditions within your Indian culture, as gifts and familial relationships are often highly significant in Indian culture."
 },
 {
   "wall": 8,
   "note": "object",
   "firstName": "Thuc",
   "lastName": "Pham",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Space and Materiality",
   "title": "Vertigo",
   "description": "The piece revolves around femininity and how women are expected to achieve this impossible balance between their rougher side and softer side to be considered “perfect”."
 },
 {
   "wall": 8,
   "note": "wire shoe",
   "firstName": "Vicky",
   "lastName": "Tang",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Space and Materiality",
   "title": "N/A",
   "description": "This wire shoe almost exactly replicates a shoe that I own myself. I used around 100 feet of the black wire to complete the straps of the shoe."
 },
 {
   "wall": 8,
   "note": "",
   "firstName": "Yuki",
   "lastName": "Zhao",
   "collaborators": "",
   "program": "Interior Design (BFA)",
   "course": "Space and Materiality",
   "title": "Seeing the World in Red",
   "description": "Everyone has their filter for sensing the world. My filter for world definitely will be red since I always care about the unfair and unequal. Therefore, this project is visualizing how I see the world."
 },
 {
   "wall": 9,
   "note": "model ",
   "firstName": "Amy",
   "lastName": "Chen",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Space and Materiality",
   "title": "3.35",
   "description": "A monument dedicates to the comfort women during WWII. To tell a better story, I choose to show both side of the story rather than limited to the comfort women. The overall structure is a mock up of a simple and crude shelter the women lived in. There’s a bruised woman body on one side and a soldier wearing old-Japanese military uniform figures on either side of the monument. The middle point hang a 1940 version of Japanese flag and each side is fill with some items of the figures. \nSome items that portrait the women’s story has:\nWooden genitalia- this reflect the most on the soldier’s side. It shows how women were not seen as human, but as a sexual-relief tool.\nCondom- a tool that can make sex safer for women in modern day are often not being use, but a tool could’ve benefit those women from these rape.\nLeg pieces and traditional clothing for young women of a specific tribe in Hualian, Taiwan, where the monument is being proposed.\n3 acrylic pieces that says: 3。350: each person is limited to 3 minutes each, and each women could have up to 350 soldiers a day; 貞潔: meaning purity in Chinese; andクリーン: meaning Clean in Japanese.\nThe flag with fetas- the result of the rape, many women are require to keep working even pregnant or treated poorly/ being killed. The beautiful gift of baring a new life is now the most cruel reminder of their life.\nThese item were chosen to portray the life before, during, and after the abomination act.\n\nMost item in the soldier’s side are war-related, what they see in their everyday life. The items as \"tools\", related to the Women’s genitalia, most of these war items are tools, so they’re carve out of wood."
 },
 {
   "wall": 9,
   "note": "wire sculpture",
   "firstName": "April",
   "lastName": "Hoffmeister",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Space and Materiality",
   "title": "N/A",
   "description": "This piece depicts a naked figure of a woman dancing on four different panels, her body is furthermore distorted through the geometric lines that have been added to the background. The contrast of the fluid movements created through the sturdy material of wire allows the piece to look like its defining the natural laws of physics."
 },
 {
   "wall": 9,
   "note": "7page pandemic memoir ",
   "firstName": "Carolyn",
   "lastName": "Mottern",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Integrative Seminar 1",
   "title": "Memoir-2020",
   "description": "For this project we were to write a five page paper about our experiences during the pandemic. When I first received the prompt I did not feel very inspired. But as I started writing the paper and getting into the ideas it began to be kind of cathartic. The beginning of 2020 and the pandemic were tough on everyone and I had not actually really processed the drastic change to my lifestyle that covid brought. This paper is one that I am proud of from my first year. I think writing out everything that I was feeling in this way was actually the start of some very good emotional healing."
 },
 {
   "wall": 9,
   "note": "zine",
   "firstName": "Charis",
   "lastName": "Pao",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Sustainable Systems",
   "title": "The 'Revive' Zine",
   "description": "Based on our class discussions and readings about climate action, I designed an easily accessible form of advocacy and awareness in a visually captivating way. Each panel is illustrated to depict a different aspect of global warming with descriptions and statistics that inform audiences. Actual sources are linked through citations and QR codes that further the purpose of the advocacy project. The zine is designed to be printed and made through one sheet of paper - keeping in mind the environmental aspects of the cause. The zine can be easily integrated into store fronts and public spaces where it can be referenced or distributed to a large group of people. \n\nThe title 'Revive' signals the need to restore a balance to our planet in order to preserve it."
 },
 {
   "wall": 9,
   "note": "cutting board",
   "firstName": "Daniel",
   "lastName": "Berger",
   "collaborators": "",
   "program": "Design and Technology (BFA)",
   "course": "Space and Materiality",
   "title": "Challah Board",
   "description": "Over the course of four weeks, students were tasked with creating a 3D object that showcases their connection to their identified community, personal beliefs, or personality. The item should express their feelings of belonging to a particular community of their choosing.\n\nPersonally, the Jewish community, is where I feel most energized, fulfilled, and connected to something larger than myself. The Jewish community defines everything in my life, from my core values to my relationships, and my interactions with the world. While Orthodox Jews are more engaged with the daily practice of traditional Judaism, in almost every affiliation of Judaism, Jewish people host a Shabbat or holiday meal at some point in the year. These meals are sacred, serving as a space to share ideas, bond with family, and celebrate the Jewish tradition. In Jewish practice, bread is the centerpiece of these meals. In fact, in Jewish law, for eating to be considered a proper meal, one must eat bread. At these Shabbat and holiday meals, it is the practice to have two special loaves of bread called challah and to place them on a special board covered by a decorative piece of cloth. This board is meant to emphasize the importance and sacred nature of the challah. Ultimately, what it means to be a part of a community is to come together, and although my daily practice as an Orthodox Jew encompasses many factors, the challah board represents the essence of the Jewish community as the space where all types of Jews coalesce."
 },
 {
   "wall": 9,
   "note": "bag",
   "firstName": "Eden",
   "lastName": "Schulman",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Sustainable Systems",
   "title": "N/A",
   "description": "In an earlier assignment for my Sustainable Systems class, I created multiple bioplastics. One of those bioplastics was a success. That one successful bioplastic I created, I created my own measurements and added components to the recipe. I realized, because it worked so well, that I wanted to create a bag from it. So I proposed the idea and got to work. It took about a week and a half to make the bioplastics and let them fully dry. Once it was dried, I peeled away the foil that I poured it onto. Then I began cutting the bioplastics into one long continuous thin line. With the bioplastic string that I cut up, I began to crochet it. I crochet 6 squares and cut out another 6 squares. I wanted my bag to have a quilt-like pattern. Then I sewed everything together including the side parts to the bag and the bottom part of the bag. I used my original bioplastic from the previous experiment for the bottom. Then I crochet the strap and sewed it on. Throughout Sustainable Systems we learned about how to be sustainable and how the Earth is being impacted by climate change/global warming. creating this bag, means that it can biodegrade and no toxic plastic was used."
 },
 {
   "wall": 9,
   "note": "knitted hat",
   "firstName": "Emma",
   "lastName": "Miller",
   "collaborators": "",
   "program": "BA/BFA",
   "course": "Integrative Studio 1",
   "title": "(Fake) Beanie",
   "description": "For this project called \"my so-called life\", we were supposed to bring 2 objects to class. One was completely handmade and the other was a real or found object. I brought in a guitar pick (real), and a knitted beanie. I claimed that my grandmother had made the hat so the story behind it was fake and I constructed it myself."
 },
 {
   "wall": 9,
   "note": "include as sculpture and/or include if we have 'wearables' performance",
   "firstName": "Gabriel Paolo",
   "lastName": "Villos",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Space and Materiality",
   "title": "Hammered Head",
   "description": "My wearable headpiece, Hammered Head functions as a form of protection for the wearer. The headpiece is meant to be worn in and damaged as a sign of that protection from a physical environment. For me it was simply the day to day commute from house to school that was my battlefield. I chose metal to depict hardness and also be able to show signs of damage better. It also contrasts the fragility of my plastic material which is full of holes and is softer. Through my process I was able to make organic elements such as holes and more curvier shapes of the uneven metal contrast the geometric form of the piece."
 },
 {
   "wall": 9,
   "note": "",
   "firstName": "Iris",
   "lastName": "Ferranti",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Twin peaks sign",
   "description": "For this project I made a miniature version a sign outside of the town Twin Peaks. I only used paper, glue and acrylic paint."
 },
 {
   "wall": 9,
   "note": "",
   "firstName": "Rachel",
   "lastName": "Vita",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Space and Materiality",
   "title": "House of Sonny",
   "description": "I collect these figurines called Sonny Angels and I wanted to create a \"house\" for them. When constructing our models, we had to use mechanical fasteners rather than glue which was a challenge. For my model, I used plastic tabs and embroidery thread to \"sew\" the pieces together. Through my design, I wanted to maintain the playfulness and happiness of the Sonny Angels through the colors and designs. I also liked how packing them inside the space and including the one figurine hanging off the side creates this fun and lively environment that’s more reminiscent of a club or party."
 },
 {
   "wall": 9,
   "note": "",
   "firstName": "Rachel",
   "lastName": "Vita",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Space and Materiality",
   "title": "Sweet Nostalgia",
   "description": "Baking is one of my favorite hobbies and I've always done it since I was very little. In this project, I wanted to create a cake and combine two of my passions: baking and art. Because baking is deeply rooted in my childhood, I wanted my model to have a nostalgic feeling. I constructed my mold so the cake would appear lopsided and painted my model with pastel pink, blue, and green to create a dreamy, innocent look. During the process, I learned that you could use spackle as fake frosting, so I put it in a piping bag and piped out a decorative pattern on the edges."
 },
 {
   "wall": 9,
   "note": "DVD case with book",
   "firstName": "Rachel",
   "lastName": "Vita",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Time",
   "title": "My Real Life Coming of Age",
   "description": "For my project, I based it off of a video I made a month before I graduated high school. The video, “My Real Life Coming of Age,” stars my closest friends and was inspired by teen movies I’ve watched. Creating this video was a way for me to make something special with my friends before we left for college and to preserve a part of our lives that was coming to an end. In the video, I narrate a poem that my friend Emma wrote which perfectly incapsulated our feelings towards growing up and graduating. Because the original video was meant to be cinematic, I wanted to create a DVD case as if it were a real movie. My actual book is inside of the DVD case since many DVDs come with a booklet. In the booklet, I used stills from the video and various pictures I took during my Senior year and the poem. I wanted to control how the reader read through by how I split up the poem throughout the book and where I placed the text on the page. Generally, I had the text flow from top to bottom and the pictures follow along with it. On some pages, I placed the text in one block, allowing the reader to slow down. On others, I split up the text in chunks so I could control the rhythm the reader reads at. With the pictures, I used consecutive stills to show the progression of an action. Also, on pages 18-19, I used lots of smaller pictures and organized them in chronological to order, highlighting the number of events and special moments from my Senior year and the physical changes of my friends and I from the beginning and end of the year."
 },
 {
   "wall": 9,
   "note": "Isolation object",
   "firstName": "Reagan",
   "lastName": "Carlson",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Space and Materiality",
   "title": "Isolation",
   "description": "When creating my piece, I chose to focus on disconnection in the form of social isolation. For this reason, I decided to surround both sides of my head with a mirrored fan that cuts off my sight with my reflection. This emphasizes the theme of social isolation, leaving the wearer only left with their head and your thoughts around them. Additionally, the piece is rigid, and binding, showing how imposed social isolation is uncomfortable. Social isolation also results in a loneliness, which is why the wearer is meant to be cut off from the world with the fans at each side. For my conceptual photo I wanted to emphasize my theme of social isolation. For that reason, I wanted to create a photograph that had me lost in a blur, confined only to my head, surrounded on all sides by the fans."
 },
 {
   "wall": 9,
   "note": "soft sculpture",
   "firstName": "Sofia",
   "lastName": "Yu",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Space and Materiality",
   "title": "Flesh Ball Sex Object",
   "description": "This work is a soft sculpture that centers around objectification. With the prompt of “create a soft sculpture,” it felt like a wonderful opportunity to pursue this concept. Inspired by a conversation with my roommate on the universal experience of harassment, I wanted to explore what male perception of the female body can look like. Where does the boundary between femininity and sex object lie? At what point in our interactions are we simply dehumanized? This is my take on what the so-called ideal “woman” is. Made of fabric scraps and created with a mix of machine and hand stitching, the visible stitches convey how fabricated this societal idealization of women can feel like."
 },
 {
   "wall": 9,
   "note": "Collab with Triet Vo Textile sculpture would require a pedestal, or pehaps can be installed in the floor.",
   "firstName": "Tracy",
   "lastName": "Qiao",
   "collaborators": "Triet, Vo",
   "program": "Architectural Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Navigation",
   "description": "\"Navigation\" illustrates the vivid emotions of international students living far from home. One Chinese and one Vietnamese collaborated to depict the simultaneity of the need to adapt to a new city - New York - with an irresistible gravitation towards home. The two nests lit by warm light are each artist's conception of their home's material cultures. They use embroideries, patchwork and collage to materialize traditional customs, familiar elements and important sceneries. Despite their emotional presence, the two nests are elevated from the representation of where the artists physically reside, emphasizing the unavoidable truth about how distant homes have become."
 },
 {
   "wall": 9,
   "note": "book spreads could be hung as panels, or digital",
   "firstName": "Xihong",
   "lastName": "Liu",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Sustainable Systems",
   "title": "Chip's story",
   "description": "For my project, I designed a children's picture book for kindergarten through second grade students to briefly talk about how microplastics are formed and the dangers they pose to humans. Also, it gives suggestions for methods to reduce plastic pollution and be environmentally friendly. I illustrate the story through the journey of the main character, Chip, who is transformed from a shampoo bottle fragment."
 },
 {
   "wall": 9,
   "note": "felted head",
   "firstName": "Xizi",
   "lastName": "Zhou",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Space and Materiality",
   "title": "Damp place",
   "description": "This is a soft sculpture made by felt, bobbles, and pins. There is a female head with pearl stud earrings who grow a lot of mushrooms on her brain. \nEvery time when I feel sad, there is a mushroom grow up in my head. Every mushroom represents different physical expression and action. Mental internal friction makes my mushrooms grow fast. Having to many mushrooms is not a good thing. However, it is not a bad to have some of the mushroom. We need to learn how to deal with the mushroom, because mushroom help us improve. So, treating your mushroom well, they are not horrible things."
 },
 {
   "wall": 12,
   "note": "High school shit and coming of age drama",
   "firstName": "Ajani",
   "lastName": "Belle",
   "collaborators": "",
   "program": "Photography (BFA)",
   "course": "Integrative Studio 1",
   "title": "Ajani Belle Bridge 2: Friend of Fear",
   "description": "Seeing that everything combined of Sophia's fears falls under the umbrella of a fear of a change I decided my film would center around that. As first year students we're all experiencing a big shift in our lives. Part of Sophia's fear was nothing topping high school so I decided to flashback to high school in my film. I also put the \"Into the Spider-verse\" clip because that was the coming of age moment for Miles when he was fully entering the next chapter of his life of being Spider-Man. I also used clips from \"Degrassi Next Class\" and \"Grand Army\" to show how lonely and depressing the switch from highschool to college can be but also how it can get better. I mixed up the clips to lead up to Miles jumping off the building in the Spider-Verse clip as I wanted it to be a build up to taking that next step in life. I used music from the series finale of Star Wars: The Clone Wars to set the emotional tone of the film. \n\nSources:\n\nGrand Army\n\nSpider-Man: Into the Spider-Verse\n\nDegrassi Next Class\n\nStar Wars The Clone Wars Soundtrack: \"Burying the Dead\" by Kevin Kiner\n\nhttps://youtu.be/cfQczP603RI?si=jkkhYAFV5o5Jq0Nu"
 },
 {
   "wall": 12,
   "note": "yes with some kind of performance ",
   "firstName": "Gabriel",
   "lastName": "Tenesaca",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Hourglass Interviews",
   "description": "I interviewed my partner whose fears were aging and wasted time. I wanted to offer a solution to these fears by showing that it’s okay to change your goals as you grow older, and that some things might not work out but open the door for new possibilities instead. I would go on to interview other Parsons students about their current goals, if they feel they’ll reach that goal, and if they’re content with where they are right now. \n\tFor equipment, I borrowed a Canon Vixia HF M32, and used my phone as the microphone while conducting interviews. I used Premiere Pro to arrange the clips, mix the audio, and add captions. Song name is “Limerence” by Yves Tumor."
 },
 {
   "wall": 12,
   "note": "cute video animation",
   "firstName": "Hayden",
   "lastName": "Tutton",
   "collaborators": "",
   "program": "Photography (BFA)",
   "course": "Integrative Studio 1",
   "title": "Her Name is Keren",
   "description": "This animation was based off an interview I did with my partner Keren. We discussed details of her childhood, hobbies, lifestyle, hometown etc. I then took the details that I thought were most interesting and interpreted them through my own creative lense. We had an option of using manual animation or Procreate so I mainly used procreate but did do the introduction manually. As I worked on the animation I would discover new ways to transition from one scene to the next or make the video more interesting. I wanted it to have a wacky and childlike feel, while also being obvious it was still about Keren. Our paper that corresponded with this assignment in Seminar was really helpful in making this. Our prompt was to write 2-3 page a creative essay on aspects we choose from our partners interviews. I used my writing as a an aid to visualize what to include in the animation. We did an exercise in Seminar where we had to turn a normal paragraph into a creative writing type. I chose to transform my to poetry which made me think deeper about how I can go even further in depth on these small aspects, like laundry."
 },
 {
   "wall": 12,
   "note": "",
   "firstName": "Jacqueline",
   "lastName": "Filip",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Memories of Buni",
   "description": "An ode to my memories as a child spent with my grandma in her garden. The video is shot from my perspective as a young girl observing the world around her."
 },
 {
   "wall": 12,
   "note": "yes to video",
   "firstName": "Kylie",
   "lastName": "Lu",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Integrative Studio 1",
   "title": "Which is me",
   "description": "This portrait is an encounter with myself because this is a new way to know about myself. I drew out the different ME in combined sections and chose the color of red and dark tones.  I consider myself to have lots of different personalities or characteristics in daily life. It is hard for me to recognize what my style is, sometimes I get confused with what I should be like, or in other words, what should I act like ME, the style that people see me. The process of seeing myself internally and from external comments sometimes bothers me a lot. I felt that in the way I understand myself, I get more confident in presenting ME, not the way people would think that ME fits my style. The movie project is related to the painting, which expands a further picture of me."
 },
 {
   "wall": 12,
   "note": "thriller",
   "firstName": "rachel",
   "lastName": "george",
   "collaborators": "joe cox, mia arculeo, elizabeth su",
   "program": "Architectural Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "Just A Dream",
   "description": "When thinking about what to do with this film, all of us agreed that we wanted to make it a psychological thriller, where the viewer is kind of creeped out by the state of the main character. We also all naturally agreed that this film needed music and only one character, to make it simple for the viewer to understand. We all decided that we wanted to make Mia the main actor and just make her look psychotic the whole entire film. When coming up with the plot of the story, we wanted to highlight that Mia only daydreams in real life, so we kind of wanted to show day dream in the beginning of the story, and towards the end of the story reality starts to kick in and Mia starts to wake up. I think one thing when developing the idea for this film, was the transitions. We wanted the movie to flow like a dream, where things just happen out of blue but they flow, and it makes sense. I think towards the end of the film we wanted to make it more abrupt because the truth of reality is that things happen for no reason sometimes, and thinks are hard to comprehend, so that’s the point that we wanted to get across with this."
 },
 {
   "wall": 12,
   "note": "animation",
   "firstName": "Rai",
   "lastName": "Everett",
   "collaborators": "",
   "program": "Integrated Design (BFA)",
   "course": "Integrative Studio 1",
   "title": "JOE",
   "description": "The end goal of the project as a whole was to represent my partner, Joe, in the most authentic way I could. By employing multiple things that my partner loves, I was able to create a fuzzy feeling because of how intimate it was. From song lyrics to One Piece Manga pannels I wanted to include all the things that I could that make Joe...Joe! Close discussion and fun questionnaires all helped inform my decisions as well. \nHaving always wanted to create a mixed media video, I had to take a chance and do it! There were no excuses as everything I needed was at my hands. Mixed media pieces always feel rather intimate as they take a lot of mechanical work, they take time and it shows that thought was put into them."
 },
 {
   "wall": 12,
   "note": "",
   "firstName": "Roan",
   "lastName": "Fraser",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Integrative Studio 1",
   "title": "Memory of Ketamine Therapy",
   "description": "I wanted to depict my memory of doing ketamine therapy for my depression. Often visualizing my experiences and memories can help me further process them and this felt like the perfect opportunity.\n\nEvery time I went felt the same and I aimed to use visual metaphors of circles as well as the pacing of the video to show the cycle of each appointment. Although many of the experiences I show through this video occurred over the span of months they all feel like the same memory. Boiling my experience down into a short video did justice to how much I actually remember, and now that I have a summary of my thoughts and feelings, it has relieved me from some of the fear of forgetting them.\n\nWhile in ketamine therapy I would always listen to the same album on CD; Whatever and Ever Amen by Ben Folds Five, and a few visuals in the video are sourced from it: the rings are a cut up photo of the back of the CD, and there is also a clip from an iTunes visualizer of the album."
 },
 {
   "wall": 12,
   "note": "",
   "firstName": "Talia",
   "lastName": "Dang",
   "collaborators": "",
   "program": "Product Design (BFA)",
   "course": "Sustainable Systems",
   "title": "Tackling Food Waste: A Call To Action!!!",
   "description": "Embark on an engaging exploration of the pervasive issue of food waste through my illustrative video project. I aim to shed light on the intricacies of food waste beyond the mere act of discarding leftovers.\n\nThe journey unfolds by delving into the profound impact of food waste on our environment, the strain it places on valuable resources, and its consequential effects on our day-to-day lives. Through a captivating narrative, I aim to convey the importance of this issue and inspire action.\n\nMy video endeavors to simplify the complexities of food waste in a fun and easy-to-understand manner, making the information accessible to a broad audience. By unraveling the story behind food waste, I seek to empower viewers to make informed decisions and implement small changes that collectively contribute to a significant positive impact.\n\nJoin me on this adventure, and together, let's transform into food waste warriors, taking small yet impactful steps toward a healthier planet. Get ready for an enlightening journey as we navigate the world of food waste and strive for a more sustainable and mindful future."
 },
 {
   "wall": 13,
   "note": "All three pieces Carina submitted feel related and would work well exhibited together ",
   "firstName": "Carina",
   "lastName": "Dai",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Time",
   "title": "Drip",
   "description": "I am making a video that recreates some of the scenes that have occurred or inspired by my previous dreams, where elements and objects in it are combined in a strange way that you would not normally expect, or transformations into something that is totally unexpected and unrelated. \n\nMusic sources/credits: Single person Studio, \"Dancer In The Dark\" song by Yico Zeng\nMusic edited by: Carina Dai"
 },
 {
   "wall": 13,
   "note": "video",
   "firstName": "Cecilia",
   "lastName": "Yang",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Time",
   "title": "Distraction",
   "description": "In this project, I tried to illustrate a simple story: a student kept thinking about cooking the noodles when doing her time assignment. Through “sound montage” and video collages, I forced my audience to experience the theme of “distraction” by providing a flood of sounds and images. The film is about the process of creating it, and the process of creating the film turns out to be the film itself. This experimental film has this LOOP nature with a clear explanation of the content in the middle and an end, which can link to the beginning; thus, the audience can enter the video at any time and figure out the story after a few loops."
 },
 {
   "wall": 13,
   "note": "Can",
   "firstName": "Diana",
   "lastName": "Luo",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Time",
   "title": "N/A",
   "description": "In this project, I chose to recreate a famous scene from Kar-wai Wang's film Chunking Express. I chose to alter some scenes and include some of the narrations from his other movies such as Fallen Angel. In this video, I used an old camera to capture multiple photos of the same action and a low shutter speed to create movement. This is similar to how some parts of Kar-wai's film use step printing, I wanted to explore more possibilities of Photo Roman through this technique. I also applied a filter to limit the color pallet, it is used to create harmony and tension."
 },
 {
   "wall": 13,
   "note": "The one with the circle and the spray paint",
   "firstName": "Fangai",
   "lastName": "Yan",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Time",
   "title": "N/A",
   "description": "This film communicates the stress emerging from the pursuit of perfection. The motif of the circle captures how details of life slowly destroys ideal standard, symbolizing a perpetual cycle of striving for flawlessness."
 },
 {
   "wall": 13,
   "note": "Video of project",
   "firstName": "Ginger",
   "lastName": "Vieth",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Space and Materiality",
   "title": "Heatless Curls",
   "description": "My found object for this assignment was a curling iron I had found at a thrift store. I wanted to continue a theme of electricity/technology for my assignment. Part of the prompt was to utilize the object in a way that it is not supposed to be used. For this, I played with the idea that you should not leave open wires around heat. I created a sculpture of a woman's head with her hair being made of wire, displayed through a short video of me curling her hair."
 },
 {
   "wall": 13,
   "note": "The GIF with the laptops. This would need its own screen I think. Maybe on a small screen like an iPhone. ",
   "firstName": "Julia",
   "lastName": "Kim",
   "collaborators": "",
   "program": "Interior Design (BFA)",
   "course": "Time",
   "title": "Overconsumption",
   "description": "\"Overconsumption\" serves as a thought-provoking commentary on the consequences of overconsumption of media, urging introspection on the balance between digital engagement and the preservation of mental well-being in an increasingly interconnected yet demanding world."
 },
 {
   "wall": 13,
   "note": "There is a performative aspect to this piece. Student may need to find way to exhibit docuemntation.",
   "firstName": "Kelly",
   "lastName": "Su",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Time",
   "title": "It Comes and Goes",
   "description": "From the assignment requirements, I thought of my “daily rituals. While I don’t have many, I do wake up and go to bed thinking of affirmations and words of gratitude, and I wanted to convey how my emotions swell and deflate, come and go. When thinking about the medium for my daily ritual I planned to depict, I knew I wanted a medium that would shift in some sort of way, even when it was a still image, and the chemical reaction between iodine and cornstarch popped into my head.\n\nMy inspiration for the premise of this project came from a science experiment I performed during middle school. Originally, we used iodine and starchy water for a germ transmission activity, but I found the chemical reaction more fascinating than the activity itself.\n\nThe premise of the project itself is experimental—in the hands of chemistry, there’s much spontaneity that could make or break the whole project. Using iodine and cornstarch to paint in general was a success in itself, but I hadn’t realized how performative the work truly was until I’d filmed it. Much of this project felt like I wasn’t in control—chemical reactions are fickle, especially when you don’t know every facet of the reaction itself, or the used materials. Even still, this project taught me a lot more about control: even if there are parts of the project out of my hands, I can be creative with what I do have control over, just like how I have control over my emotions and how I apply them to the chaotic, spontaneous world around me."
 },
 {
   "wall": 13,
   "note": "whoa wacky! YES!",
   "firstName": "Melody",
   "lastName": "Zhang",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Time",
   "title": "Back鸭ard",
   "description": "The film provides a glimpse into the mind of an introvert – a space of inner peace within a world of chaos."
 },
 {
   "wall": 13,
   "note": "video - animated + sound",
   "firstName": "Michelle (Elle)",
   "lastName": "Choo",
   "collaborators": "",
   "program": "Communication Design (BFA)",
   "course": "Time",
   "title": "Elle's Soundscape Sagittarius A",
   "description": "For this soundscape animation, I created an unidentifiable sculpture out of clay (with organic and rigid shapes) and used its image from different angles as subjects for my video. I then colored and warped these images with all different kinds of video effects to create a sequence of abstract movements. Although this project needed to mostly be unidentifiable, I did have a loose concept. The sculpture represents human pollution that is infecting the waters of our planet, and as it slowly decomposes it changes its shape and texture. In the end, the water is consumed by the pollution and its color becomes unnatural. The sounds I used for my soundscape are combinations of recordings I did myself as well as audios that were distorted to sound like the bottom of the sea."
 },
 {
   "wall": 13,
   "note": "conceptual - not a really clear visual understanding but interesting",
   "firstName": "Sophia",
   "lastName": "Wang",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Time",
   "title": "The Manipulated Relations",
   "description": "In this project, I wish to present the concept of manipulated time by using audio. The entire video is audio driven, suggesting that the pace of the flash light varies on each separate set accordingly to the character speaking. The dialogue is an excerpt taken from the play A Midsummer Night’s Dream by William Shakespeare. I found the play interesting as the plot and the movement of time is driven by characters blindly manipulated by love. In the video, the scenography work I created of the forest is multiplied.\n\nThe center frame being the pace controller, playing in a constant speed. The frame on the left representing Hermia and the right representing Helena. When one is speaking, they’re corresponding frame’s spotlight speeds up. The forest trees are formed with distorted hands, further symbolizing for manipulation.\n\nThe audio of the recorded dialogue is processed by adding some studio reverb. Moreover, the single channel audio was worked to achieve the effect of two, left and right channels. Panner keyframes were added to do so. In addition, I also layered the audio of light rain on top of the background music, in order to help advocate the central conflict between the two female characters. Lastly, when watching the video, the audiences would have to first close their eyes. This is to allow the audience to better immerse and feel embodied within the video."
 },
 {
   "wall": 13,
   "note": "FILE 02 video - really nice camera work!",
   "firstName": "Tiffany",
   "lastName": "Tran",
   "collaborators": "",
   "program": "Fashion Design (BFA)",
   "course": "Time",
   "title": "Who am I?",
   "description": "“Who am I?” is a mosaic of identities, a memoir cast in the hues of past, present, and those yet to be unveiled. Through the lens of portrait photography and storytelling, “Who am I”  delves into a visual and emotional exploration of identity, capturing its essence as a a fluid and multifaceted construction and uniqueness of every individual. It explores how we perceive ourselves, how others perceive us, and how these perceptions evolve over time. The narrative is a reflection on the complexities of feeling lost, overwhelmed, and navigating through an identity crisis, all while pondering the elusive concept of self. Blended with visual and textual elements, “Who am I” challenges preconceptions and invites introspection.\n\nThey aren’t just about capturing moments; they are about capturing souls. It aspires to be a gallery of personalities, an artistic exploration of cultural identity, self-acceptance, societal expectations, and transformation. Employing a non-linear and unconventional structure, metaphorical imagery, sensory elements, typography, and effects, the book plays with colors to evoke different emotions and time periods. \n\n“Who am I?” presents different facets of one’s identity at different points in the book, allowing the readers to piece together the puzzle of one’s identity over time, the enigma of existence. In “Who am I?,” the question lingers, lingering like the final notes of a melody. Through the eyes of others, we glimpse ourselves. Through the years, we craft our identity. Through time, we answer the eternal question.\n\nWho are you? The answer, perhaps, lies within these pages, where time and identity entwine, where portraits whisper the secrets of the soul, and where time, as a constant presence, guides us through these stories. “Who am I?” is not just a book; it’s an experience. It’s art, it’s soul, and it’s a whole lot of fun. \n\n(https://cattuongt505.wixsite.com/who-am-i)"
 },
 {
   "wall": 13,
   "note": "video is rudimentary, but music and sound is origianl and lovely.",
   "firstName": "Tobias",
   "lastName": "Cobin",
   "collaborators": "",
   "program": "Fine Arts (BFA)",
   "course": "Time",
   "title": "I AM HOME",
   "description": "I AM HOME is a photo roman that explores the idea of \"home\". Is it a house, an object, a person, yourself? It is comprised entirely of images and the soundtrack is an original song, written and played by myself, overlayed with audio from home videos taken throughout my life. I am home."
 },
 {
   "wall": 13,
   "note": "not a great start, but really sweet. visually compelling as it goes on",
   "firstName": "Yinan",
   "lastName": "Xue",
   "collaborators": "",
   "program": "Illustration (BFA)",
   "course": "Time",
   "title": "The only one left behind",
   "description": "The freedom of this project is very high, so I will mainly explain the content of the story, and the materials involved are Premior Pro and Procreate. My imaginary creature is a kind of elf, and her image is a reference to the classic elf look, with a little red pointed hat.  And her moral is not just the appearance of an elf on the surface, her deep meaning is a fairy tale dream that only children with childlike innocence can have.\nMy little elf wakes up in the city.   She feels like she has been asleep for so long that she no longer knows where she is, so she tries to find her family in the steel jungle.\nI show the city as a black and white image in my photo-roman, and the elf will have color.   When the elf finally finds color in this black and white city, she finds that it is a tombstone belonging to the children’s fairy tale, and it is a funeral belonging to the naivete.   The black and white repression of the city will not longer allow the existence of innocence, and this last spirit also slowly disappeared in this funeral, turned into a burial flower for the tombstone."
 },
 {
   "wall": 13,
   "note": "lot's of video compositing - fun",
   "firstName": "zhengyuan",
   "lastName": "Zhao",
   "collaborators": "",
   "program": "Design and Technology (BFA)",
   "course": "Time",
   "title": "Zombie Zapper Z",
   "description": "This video symbolizes my childhood fantasies.   In my world, I was always the hero who killed zombies.   The desire for superpowers was great, the power of magic.   The idea to incorporate these characteristics in my works originates from my childhood when I was scared of horror movies and zombies at the same time admiring and fantasizing about the wizard world of Harry porter.   It is in this manner that I wish to face my childhood fears and overcome them with the fairy-tale magic of childhood.\n\nIn this piece, I used fun music, and some funny things, but in the video I was very serious.   I have made this comparison to establish that I take this issue with the seriousness it deserves.   This is not a joke, I want to encounter this.   For me, all the other quirky things are not just amusing features that give me some relaxation sense, but a certain recognition that I won’t get wonders like in the video."
 }
]