
  1:{
    "work number": 1,
    "firstName": "Jenny",
    "lastName": "Lee",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Time",
    "title": "It Never Ends.",
    "description": "I often question whether living in the present and yearning for the past is truly the optimal way to navigate life. Nostalgia has become an addictive force, influencing our present experiences. However, I find myself questioning the virtue of this longing. Nostalgia perpetuates an endless cycle, tempting us to relive moments in our minds. Yet, there’s a wisdom in recognizing the temporality of things. Life’s flow serves a purpose, creating space for new experiences and personal growth. It’s about embracing the transient nature of life, moving forward, and avoiding the trap of being stuck in an unending loop of nostalgia. These charcoal drawings are all used in the actual photo roman video."
  },

  2:{
    "work number": 2,
    "firstName": "Kesiah",
    "lastName": "Munyaruganda",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "This is a self portrait project from my space and materiality class. I chose to make one based on my braids because they have been an important part of my identity and appearance. I wear them as a form of style but also as a form of protection for my natural hair. So I used wood to represent protection, as a strong and firm material. I carved it into thin and thick styles, representing the variation of braid patterns."
  },

  3:{
    "work number": 3,
    "firstName": "Liz",
    "lastName": "Park",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Integrative Studio 1",
    "title": "Yet, Nobody",
    "description": "lkd_dgy|There are many things I would like to achieve during my time in this world. Namely, I would like to learn as much as I can. The colleague inside the broken airplane window represents the dreams I have of studying abroad in America. The ghost character depicted in this drawing represents me, connecting with the assignment’s theme of personal memory. I created this artwork in 2.5D to showcase my growing passion for drawing, my journey to America, and how I continue to expand my world through Parsons. I am close to realizing my dream of living as an artist, but there is still a long way to go.||The small things around the big structure are different from what I learned in Korea, RI, and NY. An alarm shows time skills and basic learning from Korea. Sea creatures show RI’s nature and learning about people from other countries and how to live together. Flowers show different kinds of love I learned before coming to NY: love for family, pets, a partner, friends, and art.||I drew myself as a ghost because ghosts are mysterious. Everyone knows about them but doesn’t see them. In Korea, trying to fit in made me feel invisible. But living in Korea wasn’t all sad. I used bright colors and pastels to show I’m not just someone to feel sorry for, but someone who can surprise the world and make a name. I’m nobody now, but soon, I can be someone."
  },

  4:{
    "work number": 4,
    "firstName": "Juliet",
    "lastName": "Wang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Time",
    "title": "rooms that I could never call home",
    "description": "As a child, my sister and I used to build forts. Even at home, we still need to create a “safety place”, creating a sense of nostalgia and connection to the ordinary experiences of childhood. It’s a way to assert a measure of control and comfort within our immediate environment.||After growing up, I came to the US to study alone. Living in multiple host-families, I had many rooms, but none could be called  “home”. Every time I move, adapting to new environments is like the process of building a fortress. This time I'm building my safety room in the classroom.||I edited a video recording of my video call with my mom, videos I shared with my family, of daily life, and of me moving alone. I incorporated some violent elements by adding a video of my father making threatening remarks to our cat. It was an exploration of the multifaceted nature of my personal identity and the diverse influences that shape my life. Since most of the dialogues in the video are Chinese, I translated them into English and wrote them down on the paper with my child’s handwriting.||I also transformed the space, adorned the walls with familiar photographs, and strategically placed items that held sentimental value. When entering this small space you can watch the projection inside, forming a kind of boundary, separating the people inside from outside. The crowded quiet is wrapped under tables and blankets.||This installation prompted discussions on the universality of childhood experiences, the impact of cultural and personal backgrounds, and the ways in which we navigate the intricacies of identity. By building this space with furnitures and objects nearby, I aimed to create a physical manifestation of the emotional shelter I always sought through rooms that I could never call home."
  },

  5:{
    "work number": 5,
    "firstName": "Kiara",
    "lastName": "Li",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Digital Self-Portraiture: Transformations with Photoshop and Illustrator",
    "description": "The process of creating these six self-portraits (three in Photoshop, three in Illustrator) is an exploration of self-analysis. Emphasizing black and white tones, these artworks focus on the placement of abstract shapes. The three pieces crafted in Photoshop retain many hand-drawn elements to enhance the texture of the works. Before completing this project, my understanding of self-portraits was rooted in traditional painting methods. However, in this project, using Illustrator to create abstract patterns representing myself and employing masks to segment black and white spaces reflect my personality. The compositions in Photoshop, blending different hand-drawn facial features into images, provide a novel perspective on self-reflection. This not only marks my initial exploration of digital drawing tools but also represents the first time I fully comprehend my own existence."
  },

  6:{
    "work number": 6,
    "firstName": "Yuti",
    "lastName": "Jetani",
    "collaborators": "",
    "program": "Undecided (BFA)",
    "course": "Drawing and Imaging|Integrative Studio 1|Integrative Seminar 1|Sustainable Systems|Time",
    "title": "Got us together",
    "description": "A.This is a beautiful portrait of a brother and a sister celebrating Rakshabandhan, an Indian festival to pray for the safety and prosperity of sibling, cousins or any relation of brother and sisterhood. Coffee is the one thing my brother and I bond over, I miss my brother back home, we used to quietly make coffee in the middle of night because our mother never allowed us to have coffee after 8pm.|B. This is a live observation drawing.|C. I created a juxtaposition drawing of leaves and oxygen masks as in no time in the future every plant will be equivalent to one oxygen cylinder every human would need."
  },

  7:{
    "work number": 6,
    "firstName": "Yuti",
    "lastName": "Jetani",
    "collaborators": "",
    "program": "Undecided BFA",
    "course": "Integrative Seminar 1|Yuti",
    "title": "NOT LOVE",
    "description": "A fun little experiment on my poem skill where picked words from a page in magazine about divorce and made a short poem out of it."
  },

  8:{
    "work number": 7,
    "firstName": "Diana",
    "lastName": "luo",
    "collaborators": "Diana Roh",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "N/A",
    "description": "The project is about a portrait that we create for our partners, and my partner is Diana Roh. To gather resources and information, we designed a set of guided questions for each other to answer. During the interview Diana and I had some deep conversations and I discovered that one of the main issues that bothers her the most is how she must take care of her family and at the same time think about her future. She is bound by social and family expectations as well as the traditional Asian mindset of taking care of family responsibilities and her desire to escape from it.||I used a lot of symbols when making the portrait of Diana. I used a half-open eye left eye to represent Diana’s desire to escape from the current situation, but the closed right eye represents her fear of escaping from family responsibilities. The hand gestures emphasize the idea of seeking freedom and wanting to escape. I also utilized symbolism to transform Diana’s words into abstract images. There are four main symbols I used in my work, hair, Asian symbol, scares, and the eagle’s claws. I used a large amount of overflowing hair to represent Diana’s struggles that are pulling her back and represent how she is overwhelmed by her emotions a lot of the time. The hair is strangling and suffering her, pulling her back away from her dreams. I added the Asian symbol at the background that I thought could represent her Korean identity being a daughter, girlfriend, and friend, relationships that she couldn’t ignore when chasing her dreams and when seeking freedom."
  },

  9:{
    "work number": 8,
    "firstName": "HYEONWOO",
    "lastName": "MOON",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "24/7",
    "description": "She grew up as a child with the warm affection of her parents and grandparents. Her parents were busy and can be seen as if they were not there for her in person, but they had always been watching and supporting her from afar. Although she received absolute care and attention from her parents, she later had to live on her own, and in a vast and unfamiliar new environment, she felt loneliness and emptiness that she had never felt before, and experienced emotional experiences such as crying alone in her room. Nevertheless, through her belief and determination to overcome adversity by believing in herself alone rather than relying on anyone else, I thought that the bear was suitable to visualize everything about her as one object. ||Bear’s characteristics have many similarities to hers. Bears also grow up receiving tremendous care and affection from their parents when they are young, and at the same time, their children are taught to overcome adversity alone so that they can survive alone in the harsh wild. During this process, the young bear feels afraid and lonely, and howls like Hannah cried in the cold room alone before. Like the bear, which becomes the strongest animal in the jungle only after enduring these difficult processes and hardships, Hannah’s difficulties in an unfamiliar environment will later make her stronger. Considering all these points, the bear is the most appropriate way to represent her as an object to make a mask. In order to express two conflicting emotions, the right side of the mask was designed into a round shape to give a soft feeling, and the left side was designed with a rough shape to express loneliness and sadness. Two contrary sides with different colors represent ambivalence that she has."
  },

  10:{
    "work number": 9,
    "firstName": "Katrina",
    "lastName": "Mendoza",
    "collaborators": "",
    "program": "",
    "course": "",
    "title": "N/A",
    "description": "The project was inspired by mountain ranges. For six days, I recorded my walk from my home to the subway station which is six blocks down. For each block, I recorded the amount of trash bags when I walk back home from the subway station to my home. The more trash bags present in a block, the higher each “mountain range” will be."
  },

  11:{
    "work number": 10,
    "firstName": "Christina",
    "lastName": "Koo",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Wandering Through the City",
    "description": "While I aimlessly wandered through the city, walking in different directions and neighborhoods of Manhattan, I visually mapped out places I visited and interesting observations I encountered throughout my journey in my sketchbook. When I thought about the design of maps, I thought of them being confusing with so many different routes and lines heading in different directions, especially in a busy city like NYC. This thought inspired me to take on a more literal direction for the project and overlap a drawing of an actual map of the areas I walked through. I decided to use watercolor to illuminate the effect of the photo documentation and to produce a dreamy-like feeling that represents my memories of certain observations and sightings I had from the walk. Using a dripping technique, I created lines heading in many different directions, representing the grid lines and planes of an actual map. Below this layer is a collage of drawings of buildings, people walking, shops, trash bags, street signs, and scenic views of the Hudson River I witnessed. Utilizing the abstract feel of the watercolor, I was able to impersonate the busyness and chaoticness of the city and the geography of a real map while also capturing the whole essence of the experience of being a wanderer in the city and getting to pay attention to the little things and appreciating the world around me."
  },

  12:{
    "work number": 11,
    "firstName": "Nicolle",
    "lastName": "Gregory",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Game of Love",
    "description": "In an attempt to convey an imaginative space, I chose to create a game format for this assignment with the use of procreate. My inspiration stemmed from childhood games such as Mario Kart, in which a world is created to tell a story and allow characters to explore various levels and challenges. With this in mind, my main focus projected on creating numerous paths for the viewers to follow and make the piece feel visually interactive. I sectioned the game into \"levels\" by using perspective. The farther back into the space the \"world\" goes, the higher advanced the level is. Each world embodied an aesthetic (cloud, vapor wave, steam punk). Hearts are a common symbol I chose to use in this piece as I wanted to translate it into the stages of love (hence the title \"Game of Love\"). I strived for a whimsical take that feels colorful, even with the monochromatic palette required for this assignment."
  },

  13:{
    "work number": 12,
    "firstName": "Anishka",
    "lastName": "Tewari",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Libraries of Thought",
    "description": "​My project invites you to embark on a captivating exploration of the intricate landscapes within the human mind. ​This drawing serve​s as a metaphorical gateway into the vast expanse of synaptic connections, each ​synapse ​being ​a library shelf adorned with books​, Symbolizing thoughts, emotions, and memories that collectively form the intellectual and emotional library within each individual's mind."
  },

  14:{
    "work number": 13,
    "firstName": "Juliet",
    "lastName": "Blehm",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Drawing and Imaging",
    "title": "Spirit of the Sea",
    "description": "The most comforting form of spirituality I’ve experienced has always been while nestled within nature and complete solitude, where the energy and power of the planet absorbs all of my focus. Western culture often seems to lack an emphasis on the importance of the natural world, and for that, my interest in ancient cultures and religions who venerated the Earth has heightened. I love that in various societies of the past, each function and phenomenon of the universe was personified as a celestial deity, manifesting in each individual a greater reverence for the Earth on which they lived on. Maybe the incorporation of something similar in the modern age could help curb the environmental apathy that runs rampant. |\tThese thoughts fueled the creation of my chimera, a serene oceanic entity overlooking humanity. The setting, dynamic and chaotic, is meant to show the power and complexity that is Earth while the calm expression of the chimera acts as a balance, showing the creature to be a benevolent protector."
  },

  15:{
    "work number": 14,
    "firstName": "Nadya",
    "lastName": "Suwarno",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Time",
    "title": "Mapping Time",
    "description": "“One's end becomes another’s beginning”.|As time passes, the occurrences in our surroundings tend to slowly fade from our perception. Time is a rather complex topic that can string on endlessly. From a young age, I’ve grown a habit of collecting things along my journeys. From small sized rocks, dried flowers, ribbons to jackets. These collections become my belongings – a way for me to collect memories I value – good or bad. Mapping Time visualizes my ways of perceiving time as objects and objects as memories.||Frequently, we fail to appreciate these happenings and overlook their significance. Time enhances the worth of objects. This encompasses features like texture, color variations, flavor, fragrance, and the historical background of these objects. These aspects undergo transformation through weathering, modification via oxidation, and are sculpted by the relentless march of time. Observers can discern how time imparts intricate details to them, enhancing their distinctive character and essence. Surrounded by these “objects”, I feel invigorated. It’s as if I’m engaging with cherished friends, ones with whom I hold memories and take pleasure in having them in my environment. Each time I lay my eyes on them, they bring me back to those moments when our bonds were formed."
  },

  16:{
    "work number": 15,
    "firstName": "Prin",
    "lastName": "Suwannachin",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Spark of a Friendship",
    "description": "This piece is dedicated to the friendships I have made throughout my high school career. Every friendship starts out very vague and unclear and to a certain point, it was crystal clear. However, after graduation or leaving your friendship behind simply blurs the relationship once more like in the beginning where we were strangers."
  },

  17:{
    "work number": 16,
    "firstName": "Xizi",
    "lastName": "Zhou",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Time",
    "title": "年月日",
    "description": "For my work 1, two pieces are pink background. The left piece expresses the painful process that I wake up every morning or probably even noon. The green geometric shape is my bed. My bed sheet is green. The bed sheet is what I have used in school since junior high school, full of memories for me. I really love my bed, because bed is warm and comfortable, and love me forever. For the right pieces, I used watercolor and markers to paint. I like the evolution of Chinese characters. I can feel the flow of time. ||For my work 2, there are four small parts. For the blue-background three, I was inspired by Monet. He painted the same things at different times. So I looked at the cube under the window at different times. The last cube is empty because in different weather and light, the cube has different colors and shadows, so I connect in mind that it's transparent. For the orange one, I really love the motion when my cat sneeze. I sketched her abstract."
  },

  18:{
    "work number": 17,
    "firstName": "Gia Bao",
    "lastName": "Dang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Vision Through the Wondering Sight: La Collection de Memoire No.2",
    "description": "Starting this project with the intention of continuing my theme for all of my class finals \"Vision Through the Wondering Sight\", \" La Collection de Memoire\" is my second piece of the collection.  When I think of collages, I think of combining memories and image from different time and moment that happen on this earth. Doing so, we get a little trip wondering through these moments of times and  era. With that in mind, I have used vintage New York Time news paper on top of an 18x24 in Canvas. Using paint and rocks I have collects from one of my research. I have used the rocks as my brush, deep it in paint and start to rub it on the canvas using different tone of black and grays. While the paint is still wet, I have lay down a few sheet of the news papers and rip them off, whatever stay on the canvas become the background based with hidden message. Using the concept of time, I have drawn on a clock with glue, then used foil to stick on. Then I brush off the foils leaving behind a slight in of time indicate the meaning of time washing through this piece of collage. T proceed to put in an actual clock engine behind the canvas so this collage piece could actually runs as a clock. Then I printed out my previous work for Studio seminar class on denim fabrics and attach it on the collages. Using actual threads of bead to give more dimension. The beads hang like paint drop giving this piece some movement. In the end, I wanted to give this piece a feeling of time traveling and also can works as a clock and not just a collages."
  },

  19:{
    "work number": 18,
    "firstName": "Owen",
    "lastName": "Moeller",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Blink",
    "description": "This piece utilizes 6 panels and two contrasting perspectives to represent the travel from train station to train station in the city.  One does not see anything between the stops except the black tunnel walls, yet walks back out of the train station in a completely new environment.  The train stations may feel like the same place even though one has traveled hundreds of feet or even many miles. |While deciding the composition of the piece I discovered a second element to the piece.  The idea that there are three levels to the city.  In the drawing, the top two panels representing everything above ground: parks, buildings and roads; the middle two representing the area of space in between, the travel downwards; the bottom two being the destination below, the train station underground."
  },

  20:{
    "work number": 19,
    "firstName": "elene",
    "lastName": "lagurashvili",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Integrative Studio 1",
    "title": "Threads of Fusion",
    "description": "ChatGPT|In the dynamic realm of Integrative Studio 1, the assigned task presented a unique challenge—to individually explore our partners' backgrounds, discover commonalities, and then weave these elements into a self-portrait and a portrait of our partner on a unified canvas. My partner, hailing from Jamaica, and I, rooted in Georgia, engaged in rich conversations about our distinct cultural landscapes.|I found inspiration in the dynamic principle of pixels—a microscopic mosaic that unites to construct a larger image. Opting for an individual creative journey, I envisioned a montage that captured glimpses of Georgian and Jamaican landscapes and people. This visual symphony unfolded as a singular, harmonious portrait, paying tribute to the convergence of our backgrounds without direct collaboration.| It wasn't just about meeting the requirements but about navigating the vast landscapes of identity, a solitary artist inspired by the tales of Georgia and Jamaica. Each photo became a pixel, each post-it note a burst of color, forging an artistic escapade that transcended beyond collaboration. \"Threads of Fusion\" stands not just as a project but as a visual symphony, inviting you to lose yourself in the dance of pixels, a celebration of diverse threads converging into a singular, captivating narrative."
  },

  21:{
    "work number": 20,
    "firstName": "Snezhanka",
    "lastName": "Chakarova",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Integrative Studio 1",
    "title": "common denominator",
    "description": "I chose to represent gender equality in 4 images which correlate to the different experiences I have had over the years with living in my body and being looked at, perceived and evaluated. I considered the internal and external, observing and being observed. The characters are aware in various ways - of their similarities to others, the boundaries of objectification and non-compliance, bodily autonomy, abuse and political injustice. |Blue is synonymous with cold and despair in the face of isolation and judgement, and simultaneously tranquility and confidence in the possibility of true equity. Red, on the other hand, is symbolic of heat, anger towards established systems but also love for who we are and for everybody else. White is the empty space, neutrality, the common link or the flag waved. All of the primaries with one replaced - yellow, in order to bring a sense of imbalance. I was heavily influenced by the protests happening due to the overturning of Roe v. Wade and the case of the 400 cuts in Bulgaria."
  },

  22:{
    "work number": 21,
    "firstName": "Cora",
    "lastName": "Park",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Integrative Studio 1",
    "title": "N/A",
    "description": "I thought trying to replicate my partner’s face would not demonstrate our concept of this project. The contour drawings were based on the barest perception of each other, purely by looking at the other’s feature. The body knows what it knows, and if this deformation is what my hands captured, then I believe that is the way I perceive my partner, and what I wanted to demonstrate through my various faces. The more I thought about it, the more I liked how it turned out and thus my final project was decided. Since this is not my usual style, deformation-related works, using blind contour drawings I quickly made a few sketches of my subject and took it from there. The way the faces are stuck to the wooden board takes on my subject’s restrictive and organized nature while I contrasted that ideology by making the faces all look very different from each other to show my nature of going with the flow. In my opinion, not a single human should ever be perceived in a 'clean' and straightforward manner because that is not what is means to be human. A real 'human' is raw and vulnerable, can be designed in an infinite amount of ways."
  },

  23:{
    "work number": 22,
    "firstName": "Bella",
    "lastName": "Pommells",
    "collaborators": "Tamara Benarroch",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "Spinal Chord",
    "description": "Although the spinal chord is an internal structure, I wanted to honor it externally, as an imperative piece of the human body. Consistently performing and often under appreciated, the spine supports us throughout our day; maintaining structure as we perform our everyday routines. An upward spiraling root, twisting and curving to the diverse contortions of our body; A hulking beam with limbs growing out from either side. The spine is powerful and imperative, dividing our body to create a harmonious balance of stillness and symmetry. With a spine, we are limitless—relying on the security and vitality that it spreads to the farthest corners of our bodies to get us through our most triumphant moments.||Design wise, I was mainly focused on capturing the raw qualities of the spine and human body. The linear aspect of the structure allows everything to be stripped away, leaving room for the main components of the piece to really shine. The bone-like texture of the individual vertebrae was created by wrapping layers of plaster cloth around aluminum foil. Once dried, the cloth creates a stiff surface allowing it to resemble that of something bone-like. I also decided to paint the entire structure an off-white color, opting for a more natural and realistic look. Lastly, I bound each bone with silver wire, purposefully leaving the weavings exposed to enhance the starkness of the entire piece. The creative aesthetic was further enhanced in the photoshoot; the nude body and the singular spine combining to create a marriage of intimacy and appreciation. The lack of color and anonymity of the model allows for the piece to emerge robust yet elegant, just like a real spine. Overall, I think this work is one of aspiration; administering an alternative interpretation of an everyday body part while retaining authenticity throughout."
  },

  24:{
    "work number": 23,
    "firstName": "Darian",
    "lastName": "Castillo",
    "collaborators": "Gabrielle Conrad",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Darielle The Girlhood Doll",
    "description": "Both Gabrielle and I are in the beginning stage of adulthood and leaving our girlhood behind. We really wanted to reflect that concept in our sculpture. Because we both had American Girl dolls growing up, we thought making a doll would reflect us leaving our childhood, but putting her in an environment that reflects our current interests to illustrate us going into adulthood."
  },

  25:{
    "work number": 24,
    "firstName": "Tsunemasa",
    "lastName": "fujiwara",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Space and Materiality",
    "title": "EN",
    "description": "A watch-like sculpture inspired by the exoskeleton of a turtle. It consists of two layers. The top layer is the \"Outer shell\" of a turtle inspired by the traditional Japanese Kumiko design. It is made of precisely cut soft pine and colored yarns. The bottom layer is also made of yarn and soft pine wood, illustrating its exoskeleton structure.||What makes this piece special is that I was able to incorporate both traditional Japanese design elements and what I like, [marine creatures]. Furthermore, during the process, I was able to meet new people not only to gain inspiration and feedback but also to learn new techniques to execute each operation. Without these people, I would not have been able to create such a product as showcased in this exhibition. ||The reason I named this project \"EN\" is because I am from Japan, and in Japanese terms, the word \"EN\"/縁 holds a meaning of fate. As you can see, I have used red yarn for the main design pattern of its body, as there is a belief in East Asia that red yarn symbolizes fate between people. ||With this being said, in the final weeks of completing this project, I went through both a breakup in a relationship and the death of one of my close relatives, making it one of the worst weeks that I have undergone in my life. Although completing this project was not in an ideal environment, I am thankful for all the events that occurred, as they opened up countless doors to new opportunities and allowed me to meet new talented peers. Again, I believe all this was meant to happen for me not only to grow as an individual designer but also as a person, which I believe is a form of fate."
  },

  26:{
    "work number": 25,
    "firstName": "Rex",
    "lastName": "Wagenheim",
    "collaborators": "",
    "program": "Interior Design (BFA)",
    "course": "Time",
    "title": "Temporal Transitions",
    "description": "The prompt for this project was to create three separate self-portraits, each portraying a different time period of your life: the past, present, and future. I chose to focus on body dysphoria and my journey with gender identity and expression — specifically, I focused on the chest. Each portrait expresses feelings relating to the chest. The idea was to create digital collages/illustrations, using pieces of text and photos of signs that I found online. The pieces themself are simple, yet powerful and full of emotion. The body position/posture is emphasized in each piece, each one growing more and more confident in the chest."
  },

  27:{
    "work number": 26,
    "firstName": "Aashriya",
    "lastName": "Dinesh",
    "collaborators": "Tamara Benarroch, Bella Pommells, Jenna Vasquez",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "Arachnia",
    "description": "In this project, students are tasked with developing a body part cover inspired by exoskeletons' anatomy, and it explores forms of protecting ourselves from their world. How is this shell a metaphor for our state of mind? Our emotions? Our physical being? Etc."
  },

  28:{
    "work number": 27,
    "firstName": "Yi Lin",
    "lastName": "Zeng",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Space and Materiality",
    "title": "Delusion",
    "description": "Inspired by the organism Epimeriidae I created a shoulder armor relating to the sense touch. The sculpture's pointy edges evoke a sense of danger to its observers. Similar to the Epimeriidae, the piny crest along their mid-back and spines on their sides serve as a protection or serve as a “disruptive shape” that camouflages itself. The sculpture serves as a dichotomy between protection and harm. It reflects my tendency to exhibit hostile body language in an unfamiliar environment. The rigid structure exhibits the body as intrusive (represented by daylight photos) but the oxymoronic meaning (represented by night photos) is focused on vulnerability and protection."
  },

  29:{
    "work number": 28,
    "firstName": "Iris",
    "lastName": "Ferranti",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "My So called Life",
    "description": "For this project I brought in a fake anime figure base on fake TV show I created. I bought an old Pinky street figure and repainted, cut and glued it to create an entirely different figure. I also created a logo and name for the fake tv show that would be on the figures box."
  },

  30:{
    "work number": 29,
    "firstName": "Saskia",
    "lastName": "Marks",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Peer to Peer",
    "description": "The viewer is taken on a journey – their eye ‘starts’ off with our whole untouched faces, but with each fold, they observe an attribute suddenly extracted, eventually ‘terminating’ with a composition merely consisting of all of these extractions – what we are seen, remembered and perhaps associated with. In terms of this concertina-like design, it not only adds this undulating surge of dynamism, but almost causes the viewer to interact with the work, as they squat down or come up close to observe the text or spot the missing features. Essentially, this work questions what happens when we take away what makes ‘us’ us. What are we left with? Whilst only remnants of external ‘us’ are seen by the ‘end’ of this design, suddenly the texts (taken from our seminar essays) are more visible – we can now perceive and perhaps acknowledge what makes ‘us’ internally. Therefore, perhaps this work’s narrative also has a transient nature – considering how our external appearances can so easily not only physically change as well as fade over time, but change with each perspective, person to person – and yet, our internal voices linger throughout (both in life, but specifically here exemplified through the text), only recognised and appreciated by those who make the effort to notice. ||https://portfolio.newschool.edu/marks469/2023/10/04/image-text-portrait-self-portrait-peer-to-peer-final-piece/"
  },

  31:{
    "work number": 30,
    "firstName": "Di",
    "lastName": "Xiao",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Space and Materiality",
    "title": "My shoe",
    "description": "I create my own wearable wire shoe based on one of my shoes. I use certain techniques to make it look better ( adding wire laces etc) and also to make it more stable. In this way it could turn out to really have the function of a real shoe."
  },

  32:{
    "work number": 31,
    "firstName": "Luciana",
    "lastName": "Ussa",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Space and Materiality",
    "title": "Bendita Seas (Wire Shoe)",
    "description": "A steel annealed wire recreation of my favorite shoe based on orthographic views. I used both 16 and 24 gauge wire and pliers to create a outline of my pink shoes."
  },

  33:{
    "work number": 32,
    "firstName": "Autumn",
    "lastName": "Pitkin",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Color Pattern Object",
    "description": "As part of our curriculum, we delved into the intricate art of creating patterns and applying them to various objects. For my personal object, I decided on a pair of shoes. Throughout the project, I was introduced to the numerous features and tools offered by Adobe Illustrator. My aim was to create an aesthetically pleasing project, incorporating all the tools available in Illustrator. Despite its flawless appearance, achieving the final product required several attempts and experimentation. Nevertheless, I gained expertise in utilizing gradients, fill colors, patterns, strokes, line weight, and different brush techniques, which ultimately helped me create a masterpiece."
  },

  34:{
    "work number": 33,
    "firstName": "Jenny",
    "lastName": "Gao",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "The Masquerade Mask",
    "description": "The design combines organic (shellfish, coral, wave) and geometric structures (machines) as metaphors for present, future, and past.|Where the natural image of a beach is replaced by industrial ports, the narrator is astonished by the humanistic magic that brought another kind of beauty to this island, while missing the place in her childhood memory.||Here's the poem by ChatGTP:||Steel Symphony: Echoes of Seaside Dreams||Beneath the pallid canvas, steel and ash do play,|Where sunbeams pierce through heavy clouds, dreams hold sway.|Machinery in graceful dance, where once the hands would toil, In orange blaze 'gainst ashen skies, a testament to toil.||Oh, this modern marvel, a symphony of steel,|Where echoes of the past, and futures yet unreal.|Astonished soul in twilight's grasp, beholds the grand parade, In this metropolis of dreams, where memories won't fade.||No man’s touch, just whispers low, of gears and engines' thrum, The pulse of progress strong and true, in this industrial drum. Towers rise like ancient giants, their forms a silhouette,|Against the canopy of afterglow, a sight I shan't forget.||Yet 'mongst the yum of industry, a distant call does ring,|Of childhood shores and salty air, where waves used to sing. |A touch of longing, soft and sweet, for days that used to be, |A beach of youth, a simpler time, a memory set free.||In sepia tones, those days reside, where seagulls took their flight, And laughter danced upon the shore, in the golden fading light. But here I stand, in awe and pride, amidst this steel and grace, Where breeze kissed the shore, and all dreams get embrace.||So let the giants and city stand, a fusion of stories that time cannot steal. |In the twilight's embrace, a symphony of progress in a complex land."
  },

  35:{
    "work number": 34,
    "firstName": "Tiffany",
    "lastName": "Tran",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "Hidden",
    "description": "“Hidden”, the depths of one’s mind, is an embodiment of inner emotions. The butterfly—a symbol of hope and transformation— illustrates complexities and uncertainties that reside within. The fabric manipulation conveys the intricate nature of thoughts and emotions. Just as no pieces of fabric are the same, the human mind is a tapestry of unique patterns and textures. ||The red and black fabric, added intuitively to create volume and texture, signify the emotions and contrasts of our existence. The model, resplendent with an array of colors, sparkles, and vibrance, at first glance, may appear colorful and decorated, but holds a deeper narrative of those who envelop themselves in extravagant beauty may be masking or concealing their inner insecurities—a colorful cover disguising inner turmoil, often unnoticed by others. LED lights and fluorescent colors infuse fluidity, mirroring the changing nature of thoughts and emotions. These dynamic hues convey the multifaceted essence of the human soul, offering a visual transformation that mirrors one’s emotional arc, often filled with hidden emotions and unspoken words.||My polyhedron model, made from metal, acrylic sheet, plastic, and fabric, comprises 16 sides assembled using fasteners and wires. Exploring a diverse range of creative forms, I experimented with LED light effects, fluorescent colors, acrylic paints, resin, fabric manipulation, fashion elements, patterns, and textures. As the project’s concept is “The Surprise Inside”, I nestled these blossoms within the transparent plastic, elevating the theme with layers, volume, and captivating depth. These ribbon roses concealed within the translucent veil symbolize the hidden beauty and complex emotions that reside within seemingly transparent facets of life —representing mystery, entrapment, introspection, and concealed aspects beneath the surface that are not readily visible but linger. Just as the layers of ribbon create the illusion of a delicate rose, the human mind is multifaceted and possesses hidden depths."
  },

  36:{
    "work number": 35,
    "firstName": "Reagan",
    "lastName": "Carlson",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "Isolation",
    "description": "When creating my piece, I chose to focus on disconnection in the form of social isolation. For this reason, I decided to surround both sides of my head with a mirrored fan that cuts off my sight with my reflection. This emphasizes the theme of social isolation, leaving the wearer only left with their head and your thoughts around them. Additionally, the piece is rigid, and binding, showing how imposed social isolation is uncomfortable. Social isolation also results in a loneliness, which is why the wearer is meant to be cut off from the world with the fans at each side. For my conceptual photo I wanted to emphasize my theme of social isolation. For that reason, I wanted to create a photograph that had me lost in a blur, confined only to my head, surrounded on all sides by the fans."
  },

  37:{
    "work number": 36,
    "firstName": "Maria",
    "lastName": "Fonseca",
    "collaborators": "",
    "program": "Architectural Design (BFA)",
    "course": "Space and Materiality",
    "title": "Madison Square Park Project - Pavilion",
    "description": "For this project I created a welcoming space within the park to people who like to have quality time in the park. Who wants a comfort space to read, do homework, work, chat with others, and simply relax. My goal was to make this space both sustainable and artistic."
  },

  38:{
    "work number": 37,
    "firstName": "Allison",
    "lastName": "Rich",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Space and Materiality",
    "title": "Pillar of Existence",
    "description": "The spine is one body part that is often overlooked when speaking of sacred body parts. The ability to walk, move and perform daily activities that are necessary to achieve a decent standard of living all require the backbone for its support. With this recreation of the spine I created this piece to draw focus to the strength in which the body part holds and the movement in which it allows. I began to create the sculpture by molding the vertebrae of different sizes out of an air dry clay which were then covered in a gloss to give them more of a living feeling. Then I created the spinal cord using a combination of a thick wire that was braided and then covered in a red yarn. I then took the wire covered in the yarn and pulled it through a piece of rubber tubing the complete the creation of the spinal cord. The vertebrae were slid on the the spinal cord and attached using clay as well."
  },

  39:{
    "work number": 38,
    "firstName": "Mallory",
    "lastName": "Pangilinan",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Lipstick on a Pig",
    "description": "“Lipstick on a pig” was a phrase that I always resonated with, especially since going to an art school filled with talented, wealthy, and beautiful people my age. So, when ‘conceptual self portrait” was an assignment that was introduced to me, it was pretty easy for me to come up with the idea visually. Oil paint is my main medium, so I decided to use it for this piece. This piece is very straightforward, a pig with lipstick on is just how I feel. It mostly represents my imposter syndrome, feeling like I don’t fit in with my talent or my looks, despite trying to hard. Feeling like no one will truly accept me. It was very therapeutic and has helped me to process those feelings"
  },

  40:{
    "work number": 39,
    "firstName": "Mira",
    "lastName": "Das",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Time",
    "title": "out of time",
    "description": "I decided to represent when one of my dogs, Gabbar, passed away in March 2023 from cancer for this project. He was diagnosed in December and was given less than 2 months, so it was expected. Still, he seemed perfectly healthy and upbeat until the day of his passing, so it felt like time passed extremely fast that day, even though we all knew the day would come. In order to represent the passing of time as well as my emotional state, I chose to have the images I illustrate fade into the background, as my dog has slowly been fading from everyday memory, unfortunately. By making each panel in the sequence smaller and darker, I wanted to express my anticipated despair and eventual grief. I also decided to include dates (“MAR 18”, etc.) to emphasize the passing of time, as well as to memorialize the last few days of his life. I chose to ink this illustration as sequential art makes me think of traditional comics, and I also wanted to use solely black and white visuals. After I had all my pencil lines covered with ink, I decided to cut my paper to make the composition longer and more spread out. After cropping the page, I used a brush and covered the background with ink to emphasize the fade into nothingness. I debated on adding color, but I think it would’ve taken away from the dramatic effect of the black-and-white visuals and storyline."
  },

  41:{
    "work number": 40,
    "firstName": "Miu",
    "lastName": "Yamazaki",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Kuraokami",
    "description": "This is a piece of the Kuraokami, a legendary Japanese dragon and Shinto deity of rain and snow.  The common myth I used to hear a lot in Japan about the rain/sun bringer triggered me to working on the concept of weather, which led to making this dragon model as one of my pieces for this project.  The body of the dragon is constructed by strips of ribbon sewn together, and beads are added on each of the seams to present the shimmers of the skin.  On the base of the body, strips of ribbons that are woven and folded in different ways are attached to present the wavy spikes and patterned scales.  Moreover, the separately made face  is painted with acrylic paint on a mini canvas.  The eyes and whiskers are also beads, to match the body.  |This piece not only is a simple model of the dragon, but uses different materials to present the significance of the liveliness, and power of the god, that manifests in their appearance."
  },

  42:{
    "work number": 41,
    "firstName": "Hazel",
    "lastName": "Choi",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Midnight Snack",
    "description": "My creative intention was to create a montage of competing images based on my story. The story was, \"When I was young, I ate cookies as a night snack without my mom noticing. I got on the chair to take out the cookie jar on the shelf every night. One day, my mom noticed because she has good hearing. Therefore, she replaced the cookies with walnuts. I couldn't eat them anymore after that happened. When we eat cookies, my mom and I always talk about this. I hated my mom for that when I was young, but now it is funny how we tried to deceive each other. It becomes a fun memory. This project was to create a montage that incorporated the meaningful story I remembered. I completed this work with perfect results thanks to the professor's feedback. Based on that feedback, I believe the work was created perfectly, and it addressed any shortcomings I perceived."
  },

  43:{
    "work number": 42,
    "firstName": "Zoe",
    "lastName": "Finger",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "I created this piece using photos I've taken of things that I find beautiful. I wanted to put together a piece of art that portrays the way that I look at the world, and by using my own photographs to create one unified image I think that I succeeded in doing so."
  },

  44:{
    "work number": 43,
    "firstName": "Mina",
    "lastName": "Chen",
    "collaborators": "",
    "program": "Interior Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Out of the Woods",
    "description": "This project is divided into two parts: making the mask and photographing the mask in an uncanny way While interviewing my partner, she highlighted the significant influence of her cultural background and her strong artistic yet humble nature. To encapsulate these traits, I aimed for an earthy and traditional aesthetic in the mask, achieved through stitched patterns on beige fabric matching the mask's brown body. These handcrafted details lent a unique artistic flair. Incorporating red, brown, and gray yarns, I outlined deer features, enhancing its rustic appeal and adding soft textures. When I was photographing the mask, I wanted to showcase nature's beauty and the predator-prey dynamic. By positioning the image amidst leaves, I created an illusion of a predator lurking, echoing the natural distance between viewers and the deer, evoking both unease and admiration for nature's beauty. Special thanks to Prin Suwannachin for modeling for the mask."
  },

  45:{
    "work number": 44,
    "firstName": "Chara",
    "lastName": "Kim",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "I wanted to demonstrate trust through mutualism in nature, using an example of a sea lion and a lava lizard. The relationship between the two animals is defined by the lava lizard cleaning the seal’s pelt of pests and the seal providing the lizard a safe space to feed. I thought that this relationship required a lot of trust on both parties since they’re very close to each other and can easily harm each other, but are deliberate in only aiding each other. I found trust between animals to be very powerful, since animals aren’t raised to have a moral code like humans are expected to, but only do what they must to survive. Even in nature documentaries, there are strict rules that the people filming aren’t able to intervene if an animal is being attacked by another animal to not intervene in nature and let the environment take its course. Despite these harsh conditions and apathetic nature we’re supposed to show to certain natural situations, few animals find ways to positively interact with other species and benefit each other. There are no legal contracts or expectations like there are between humans, but rather complete trust that each animal won’t harm the other. This is more powerful since there are no repercussions if one were to violate the relationship, but they instead choose to uphold their relationship and pass it down generations."
  },

  46:{
    "work number": 45,
    "firstName": "Mabel",
    "lastName": "Lok",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Space and Materiality",
    "title": "Study of a Boot",
    "description": "As it was my first time coming across orthographic drawing, it was difficult at first. However, as soon as I got the flow, the orthographic drawing became easier to follow. During the study of the boot, I looked closer at my photographs and the real life object. Drawing this out, I had to be very mindful of the softness of the pencil as it gives different tonal values in the drawing.||The boot made in both wire and wood are made exactly to the real size, which is up to knee height. The wire work was where I found most difficult, since I struggled in the beginning to evenly coil the thicker 1/18 gauge. As I got familiar with the material, I began to work towards building the structure so that the tall boot can stand alone - using thin 1/24 wires to outline the shapes as well as to hold the balance of the structure. ||The wood work required much more dedicated thinking, measuring and planning. Following my orthographic drawing, I shifted the measurements to a 4'x4' 1/2\" plywood. When cutting on the band saws, I added the wavy outline on the sides to imitate the crease that leather fabric creates. Then finally, the connector slots took the most consideration in maintaining the outline of the shoe, as well as creating dimension and structure. Overall, I enjoyed making the wooden boot."
  },

  47:{
    "work number": 46,
    "firstName": "Mina",
    "lastName": "Chen",
    "collaborators": "",
    "program": "Interior Design (BFA)",
    "course": "Time",
    "title": "Echoes of Nostalgia",
    "description": "I wanted to document the different stages of my life through diptychs. The digital collage on the right represents my childhood, while the analog collage on the left is inspired by my aspirations for the future. In the digital collage, I manipulated the scales of objects to convey the feeling of perceiving everything as larger than life. For the other part of the collage, I aimed to evoke a sense of carefree confidence, choosing to use watercolor and magazine collages in its composition. I employed lines and geometric shapes to create a connection between the two collages."
  },

  48:{
    "work number": 47,
    "firstName": "Christina",
    "lastName": "Koo",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Biomorphic Creatures",
    "description": "During my walk outside around the city, I documented a variety of interesting stains I discovered on sidewalks, surfaces of buildings, and roads. After digitally transferring and tracing the outlines of these biomorphic forms in Illustrator, I experimented with arranging the composition of miscellaneous lines and shapes, playing around with the use of negative and positive space and color. When I observed the form of the stains, I was deeply reminded of living organisms in the sea, such as fish and coral reefs; hence, I decided that it would be interesting to transform these abstract forms into a more concrete, conceptual idea. I wanted to use many different vibrant colors to make the drawing visually striking and also a little funky. While creating this piece, I realized that inspiration for art can literally be found anywhere—even from something as simple as stains you find on the streets."
  },

  49:{
    "work number": 48,
    "firstName": "Jessica Saadia and Kritka Narayan",
    "lastName": "",
    "collaborators": "",
    "program": "",
    "course": "",
    "title": "Corks to Canvases – Sip, Recycle, Create.",
    "description": "In an effort to tackle cork waste in an engaging and environmentally conscious manner, we devised an initiative to transform discarded corks into captivating products and art pieces. Our mission is to inspire individuals, families, restaurants, and large venues to reconsider the potential of these seemingly insignificant wine corks and raise awareness about the environmental benefits of repurposing.|By strategically placing collection buckets at prominent locations, we aimed to organically cultivate a community-driven movement. The goal is simple yet impactful: encourage the act of repurposing wine corks to minimize waste. 'The Hot Plate' was made of 50 corks collected from friends, restaurants, and a wedding venue. The cork was then glued onto a wood scrap that we then attached handles to and finished off the product with a dark varnish."
  },

  50:{
    "work number": 49,
    "firstName": "Sean",
    "lastName": "Yan",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Space and Materiality",
    "title": "Constructed Bouquet",
    "description": "I personally felt like the prompt was a little limited as we could only choose between a bag, chair or toy. I decided to make a flower vase with flowers in it as it could fall under the category of a \"bag\" since it's an object that is holding something. We were only supposed to choose two polyhedron shapes for the objects but I decided to go with multiple different shapes as the main objective of this project for me was to use as many polyhedron shapes as I could. I made the flower vase and flowers from bristol paper as I liked the flexibility of the paper and how thin it was, despite the challenges of it folding and bending too easily. The flower vase consists of a dodecahedron for the base, pentagonal pyramid for the middle and a partial icosahedron for the top/opening. The roses consists of a partial icosahedron stuffed with scrap pieces of bristol paper to act as the petals and the asters are constructed with a partial dodecahedron for the petals and pentagonal prism for the pistil. For the stems, I used wooden dowels. The vase is connected and held together by brass fasteners and the flowers are held together by paper tabs and slits. Additionally, I was able to hold the flowers onto the stems by drilling two holes into each wooden dowel and sticking in small wooden sticks, one underneath the flowers and one within the flowers to hold it in place. For the last step, I painted everything with spray paint."
  },

  51:{
    "work number": 50,
    "firstName": "Prin",
    "lastName": "Suwannachin",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "The Extroverted Introvert Mask",
    "description": "As I interview and get to know my partner better, I'd like to encourage her to be more extroverted and feel free to express herself to her fullest. The mask represents her balance of being an introvert, yet she is still an outgoing person and is eager to meet new people and willing to expand her comfort zone within her own style. ||Model: Mina Chen"
  },

  52:{
    "work number": 51,
    "firstName": "Antara",
    "lastName": "Chatterjee",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Take the Bull by its horns",
    "description": "In this work I chose to merge myself with the mighty bull to draw attention to its characteristics of valour and strength, positive attributes I wish to imbibe. I titled this work, \"Take the Bull by its horns\" because that's the approach I wish to inculcate in my life. To display my connection to the bull and the seamless entanglement of both characters, I gave the illusion that my hair truly merged with that of the bull. The still and serene background also added a stunning contrast to the strength and tenacity I wished to display in the hybrid of our characters."
  },

  53:{
    "work number": 52,
    "firstName": "Melody",
    "lastName": "Gallant",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Superego/Id",
    "description": "For my piece I chose to represent myself with the dove and the lion, each carrying a lot of symbolism for what I wanted to show. The dove represented my superego, a psychology term that labels the part of the psyche that puts what we consider to be morally right over all other desires. This part of myself I consider to put other people's needs over my own and thus sending off parts of myself to help while I disappear. The lion counterpart is the Id, the part of my psyche that ignores all moral reason and is driven simply by desire. The lion being the symbol of pride helped me double down on the feeling of self interest and obsession. Having multiple obscured images of myself in a circle visually captures the endless cycle of being selfish, a trait I try very hard to purge from myself. I chose to use black and white to distinguish which is considered \"good\" and \"bad\", but ultimately I chose to use the same photo of myself for both portraits because I don't believe anything can be totally good or bad. There's good and bad in everything so while these have different connotations I really wanted there to be a line or acknowledgement and similarity between the two in the composition."
  },

  54:{
    "work number": 53,
    "firstName": "Ginger",
    "lastName": "Vieth",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "The Pacific",
    "description": "This deck of cards is based off of plants, fruits, and flowers that I grew up around in Los Angeles. The items in this deck are either native to my region of southern California, representative of my heritage and hometown, or a combination of the two. Many of the meanings for specific cards are derived from more literal metaphors of the plant. However some of the meanings for these cards come from specific memories from my childhood, tied to the communities and environments that I was surrounded by and a part of for most of my life.|\tThe physical cards are created from recycled cardboard that has been disassembled. The image on the cards depicting the plant is made of watercolor on sketchbook paper, which was then carefully cut out and collaged. The use of recycled materials and watercolor paints was an intentional choice, as to give the entire feel of the deck a more natural and organic sense.|\tThis deck will be beneficial to those who desire emotional and mental growth and would like to reflect upon their day to day life. Taking time to write and process fleeting thoughts you might have throughout your day may be the key to developing healthier and stronger relationships with yourself and others alike."
  },

  55:{
    "work number": 54,
    "firstName": "Thuc",
    "lastName": "Pham",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Time",
    "title": "Portrait of a Blank Slate",
    "description": "My project illustrates how I experience time, or the lack thereof, during sleep. As I rarely dream or my dreams lack a coherent timeline, the concept of time simply does not exist when I am unconscious. To portray this “unreal” landscape, I painted an almost surreal depiction of myself within my dream, surrounded by moving elements yet remaining still. Drawing inspiration from the classic work “Ophelia” by Sir John Everett Millais, I painted myself to be “dead” in sleep, robbed of my sense of time. The charcoal created a black-and-white filter on the scene, separating the awake audience from the serenity and stillness of the piece."
  },

  56:{
    "work number": 55,
    "firstName": "Sharanya",
    "lastName": "Khemka",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Drawing and Imaging",
    "title": "Rewind",
    "description": "This portrait was done using Illustrator, it is a childhood picture of me composed using lyrics of my favorite songs over the years, quotes that inspired me, and emotions I felt during specific stages of my life."
  },

  57:{
    "work number": 56,
    "firstName": "Christina",
    "lastName": "Koo",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Just Laugh It Off!",
    "description": "After a class lecture discussing artist Gillian Wearing’s project Wearing Masks, I was greatly inspired by the way Wearing uses and views masks as a representation of ourselves and the altering performances we put on our everyday lives in our roles in societies and families and in all interpersonal relationships. I realized that I, myself, as well, put on a mask every day and put on these performances. Drawing on that perspective, I wanted to create a piece that responded to Gillian Wearing and her work. I wanted to create an artwork that depicted a mask, or multiple masks of myself, that seems to be excessively laughing and happy, to portray how sometimes I feel like this mask or persona I put on constantly needs to be upheld or shown to people and the world around me, often hiding my true emotions behind the facade. Because I wanted to make the artwork feel superficial and uncanny in a way, I decided to use a digital platform, Procreate. The airbrushed texture of the faces accentuates the idea of masks and the plastic, hollow feeling they illuminate. In contrast to the deeper meaning of the artwork, I wanted to make this piece somewhat humorous and unserious to the viewer initially, hence the eye-catching bold, childish colors used, but as they start to view and analyze the work longer, it can be presumed that there is a darker, more serious story beyond the surface level that touches on the detrimental realities of self-identity and external perception."
  },

  58:{
    "work number": 57,
    "firstName": "Queena",
    "lastName": "Lee",
    "collaborators": "",
    "program": "Undecided",
    "course": "Time",
    "title": "Past, Present and Future",
    "description": ""
  },

  59:{
    "work number": 58,
    "firstName": "Angela",
    "lastName": "Lin",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "Cowboy Boots Orthographic",
    "description": "An orthographic drawing of a cowboy shoe from the side view, bottom view, and back view. An observation of the shoe's shape and form as preparation for a wooden construction."
  },

  60:{
    "work number": 59,
    "firstName": "Eden",
    "lastName": "Schulman",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "Once I completed the wooden frame during class, we were able to decorate with whatever materials we wanted. We did have to make sure to add out plastered elements on them. I decided to plaster jewelry pieces of mine that have meaning to me. I also decorated the rest of the frame with origami cranes that I made. As a young kid, I was obsessed with folding origami cranes. In my free time I would always fold cranes. If you folded 1000 cranes, you could make a wish. The self portrait part of the project I did on Procreate. I then printed it out to fit into the frame. I wanted the self portrait to take on a realistic look and create a warm toned aesthetic."
  },

  61:{
    "work number": 60,
    "firstName": "Diana",
    "lastName": "luo",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "In this project, I chose to create a dystopic space that is largely influenced by the horror manga artist Junji Ito. I chose to create a series of collages that resemble a mysterious door that inhabits a creature. Inside this door everything is only black and white, so this creature withholds a strong desire for colors. This door may appear wherever and whenever in the world, once it settles the creature inside of it will use its vines to find living beings and absorb energy (colors) from them. During this absorbing process, these living beings will start to become part of the creature itself, providing nutrients for it. The first collage is about the appearance of the door and how the living beings are killed and transformed. The last collage reveals that these ‘nutrients’ absorbed by the creature resulted in two ‘fruits’ which are the two heads growing in the center of the page."
  },

  62:{
    "work number": 61,
    "firstName": "Mina",
    "lastName": "Chen",
    "collaborators": "",
    "program": "Interior Design (BFA)",
    "course": "Time",
    "title": "Echoes of Nostalgia",
    "description": "I wanted to document the different stages of my life through diptychs. The digital collage on the right represents my childhood, while the analog collage on the left is inspired by my aspirations for the future. In the digital collage, I manipulated the scales of objects to convey the feeling of perceiving everything as larger than life. For the other part of the collage, I aimed to evoke a sense of carefree confidence, choosing to use watercolor and magazine collages in its composition. I employed lines and geometric shapes to create a connection between the two collages."
  },

  63:{
    "work number": 62,
    "firstName": "Danielle",
    "lastName": "Ilunga",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "For my piece, I wanted to express my fear of butterflies. I found it to be very challenging since it's very hard to convey something as \"scary\" when a majority of people tend to find butterflies gorgeous. I wanted to have an overwhelming amount of butterflies surrounding me and even coming out of my mouth to give it a creepy feeling. Despite that, this was my first piece on illustrator and I had a lot of fun!"
  },

  64:{
    "work number": 63,
    "firstName": "Paree",
    "lastName": "Gauba",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "Through this iteration of my self portrait, I attempt to explore my complex cultural identity. I am Indian, but I moved to Singapore as a teenager and as a result, during my developing years, I was never enough 'Indian' for folks back home or 'caucasian' enough for people in my international high school. Moving to New York for higher education has given me the time and space to truly embrace my culture without judgement– yet I still harbor a sense of cultural conflict within. The composition began with minimal cultural patterns visible behind my posterized portrait. However, in this second iteration, I utilized a white pen and drew these patterns to take over the composition, covering some of the previously printed patterns using black acrylic paint in the process. In essence, the evolution of this piece itself alludes to what I hope to achieve eventually– true and unapologetic  acceptance of my culture. Moreover, the analog iterations made the composition more cohesive, and I have grown to be satisfied with this work post the second round of modifications."
  },

  65:{
    "work number": 64,
    "firstName": "Arav",
    "lastName": "Tewari",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Forgotten Sacrifices",
    "description": "Some edges are difficult to define, like the narrative of how history is laid down and sometimes washed away from the stains of time. For example, most aspects of culture and mainstream media often brush over the efforts of colonized nations during World War II. During the war, there were over two million Indian deaths, as well as over Eleven Thousand losses from South Africa and other non-western colonies. Yet most people don’t know the extent at which these sacrifices were made.||This project is my attempt to honor the often-unacknowledged sacrifices of commonwealth soldiers during World War Two. I’ve tried to capture the sense of detachment that these brave individuals must have experienced when fighting for another nation’s battle in a far away land."
  },

  66:{
    "work number": 65,
    "firstName": "Kiara",
    "lastName": "Li",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "Self Portrait in Wire",
    "description": "Exploring the creation of a 3D structure with wire was a personal challenge I eagerly embraced. Crafting my self-portrait using this medium turned out to be an emotional rollercoaster.||Initially, I believed a well-executed design sketch would guarantee success, only to face setbacks when proportions were overlooked, prompting a necessary redesign. Presenting the 3D face in class brought a mix of emotions; disappointment arose as classmates struggled to perceive it as a human face due to its small size. Yet, a shift in perspective occurred when I illuminated the artwork, revealing captivating shadows and rekindling my admiration.||This journey, marked by failures, successes, setbacks, and ultimate triumph, resonated with the intricate tapestry of life. Navigating self-doubt, seeking balance, and persistently striving for success mirrored the nuanced process of bringing my wire self-portrait to life. It symbolizes the challenges inherent in life's journey and the continuous pursuit of creative and personal achievement."
  },

  67:{
    "work number": 66,
    "firstName": "Ammie",
    "lastName": "Liu",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Skin and Bone",
    "description": "In order to meet the requirement of using 8 pieces of paper while working with limited space in my room, I decided create a separate portrait for my partner and I by layering paper cut-outs on top of each other. The layering of paper was inspired by how cinematic it feels sometimes to listen to someone else talk about their life – it was like watching a scene of a movie that was carefully preserved through time. |I choose to portray my partner as a skeleton because I found it impossible to fully understand someone and represent them. During the duration of the project, I had the opportunity to learn about my partner's childhood spent in China, her relationship with her mom, her pet goldfish that died seven times, her hopes and dreams. However, these stories only offer snippets into my partner's life, moments that she wish could last forever. Hence, instead including a more realistic drawing of her, the skeleton seemed to me as something that's more intimate and long-lasting. |I was met with the same problem when it came to my self portrait - simply drawing an image of myself seemed to not be enough to represent who I am. Inspired by the memoir that I wrote in my seminar class, \"Never Have I Ever\", where I complied a series of all the things I didn't do while growing up, I decided to represent myself with a blank figure. This is because the person that I am at this moment is also constituted by the things that I never would have done, things that I never did, and people that i never was."
  },

  68:{
    "work number": 67,
    "firstName": "Iris",
    "lastName": "Ferranti",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Surreal figure drawing",
    "description": "This is a water color art piece I created. I first put three reference photos together in photoshop and altered the colors. I then painted them on and 18-24 piece of paper"
  },

  69:{
    "work number": 68,
    "firstName": "Aashriya",
    "lastName": "Dinesh",
    "collaborators": "Tamara Benarroch, Bella Pommells, Jenna Vasquez",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "Arachnia",
    "description": "In this project, students are tasked with developing a body part cover inspired by exoskeletons' anatomy, and it explores forms of protecting ourselves from their world. How is this shell a metaphor for our state of mind? Our emotions? Our physical being? Etc."
  },

  70:{
    "work number": 69,
    "firstName": "Katrina",
    "lastName": "Mendoza",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Sustainable Systems",
    "title": "trashy self portrait",
    "description": "For one of my entries, I kept track of how much trash I accumulated throughout one week. I then use this trash (whatever may be salvageable) and recreated a portrait of myself. I have used materials such as the plastic covering of water bottle cases to cutting out a particular design of my ripped pajamas."
  },

  71:{
    "work number": 70,
    "firstName": "Nadya",
    "lastName": "Suwarno",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Integrative Studio 1",
    "title": "ARUNIKA",
    "description": "Arunika is a wearable artwork that emerges as a testament to the resilience of human spirit in face of the unknown. Taking upon the shape of an exquisite sea turtle, it is revered in various cultures of their connection to the sea and longevity. It becomes a vessel of reassurance, reminding the wearer that, like the resilient sea turtle, they possess the strength to navigate life's uncertainties.||The creatures' flippers protecting the egg mimics how sea turtles are led back to their natal home through magnetic cues. The mask's eye openings are thoughtfully designed to convey a sense of vision and foresight, encouraging the wearer to face the future with clarity and purpose. ||Through the act of wearing Arunika, the individual is invited to tap into their inner reservoir of strength, knowing that no matter how turbulent the journey may be, they carry with them a symbolic home—a sanctuary of courage and resilience. In essence, Arunika transcends its physical form, becoming a wearable narrative that encourages the wearer to embrace the ebb and flow of life, confident in their ability to navigate the vast, uncharted waters ahead."
  },

  72:{
    "work number": 71,
    "firstName": "Kai",
    "lastName": "Deng",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Growing",
    "description": "Trees grow from the ground, skyscrapers grow from the sky. In between, sinking, hanging, thinking,  am I growing upwards or downwards?"
  },

  73:{
    "work number": 72,
    "firstName": "Nadya",
    "lastName": "Suwarno",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Integrative Studio 1",
    "title": "ARUNIKA",
    "description": "Arunika is a wearable artwork that emerges as a testament to the resilience of human spirit in face of the unknown. Taking upon the shape of an exquisite sea turtle, it is revered in various cultures of their connection to the sea and longevity. It becomes a vessel of reassurance, reminding the wearer that, like the resilient sea turtle, they possess the strength to navigate life's uncertainties.||The creatures' flippers protecting the egg mimics how sea turtles are led back to their natal home through magnetic cues. The mask's eye openings are thoughtfully designed to convey a sense of vision and foresight, encouraging the wearer to face the future with clarity and purpose. ||Through the act of wearing Arunika, the individual is invited to tap into their inner reservoir of strength, knowing that no matter how turbulent the journey may be, they carry with them a symbolic home—a sanctuary of courage and resilience. In essence, Arunika transcends its physical form, becoming a wearable narrative that encourages the wearer to embrace the ebb and flow of life, confident in their ability to navigate the vast, uncharted waters ahead."
  },

  74:{
    "work number": 73,
    "firstName": "Aiya",
    "lastName": "Zhumagaliyeva",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "I tried to create an image of a Kazakh girl using my acquired skills with creating and coloring patterns in Adobe Illustrator. The creative inspiration behind this project was that I was homesick while creating it. I chose to use more fluid and textured lines with vibrant colors to convey the picture more clearly."
  },

  75:{
    "work number": 74,
    "firstName": "Ammie",
    "lastName": "Liu",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Skin and Bone",
    "description": "In order to meet the requirement of using 8 pieces of paper while working with limited space in my room, I decided create a separate portrait for my partner and I by layering paper cut-outs on top of each other. The layering of paper was inspired by how cinematic it feels sometimes to listen to someone else talk about their life – it was like watching a scene of a movie that was carefully preserved through time. |I choose to portray my partner as a skeleton because I found it impossible to fully understand someone and represent them. During the duration of the project, I had the opportunity to learn about my partner's childhood spent in China, her relationship with her mom, her pet goldfish that died seven times, her hopes and dreams. However, these stories only offer snippets into my partner's life, moments that she wish could last forever. Hence, instead including a more realistic drawing of her, the skeleton seemed to me as something that's more intimate and long-lasting. |I was met with the same problem when it came to my self portrait - simply drawing an image of myself seemed to not be enough to represent who I am. Inspired by the memoir that I wrote in my seminar class, \"Never Have I Ever\", where I complied a series of all the things I didn't do while growing up, I decided to represent myself with a blank figure. This is because the person that I am at this moment is also constituted by the things that I never would have done, things that I never did, and people that i never was."
  },

  76:{
    "work number": 75,
    "firstName": "Khanh",
    "lastName": "Phan",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Water Puppetry",
    "description": "This piece of painting portrays the behind the scene of water puppetry, a form of traditional entertainment in Vietnam. During the water puppet show, the performers have to stand in the water in the backstage while using bamboo sticks to control the puppets. Therefore, what the audiences see are only the puppets. For this project, I want to honor the performers who devote themselves to this form of traditional art as well as their efforts they put into each performance in order to make Vietnamese culture become more well known. Here, I painted myself as a water puppet performer with wet hair and my body soaked into the water."
  },

  77:{
    "work number": 76,
    "firstName": "Allen",
    "lastName": "Chen",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Hua Jian Cheng Die",
    "description": "I created this mask in a design-thinking way based on the primary research I gathered in my seminar class and secondary research in related fields. ||For my partner, becoming more confident was the topic she needed to challenge herself on. In my understanding, becoming more confident doesn't mean needing to be more perfect, but rather having the courage to accept everything about ourselves, no |matter good or bad. That's why I chose the butterfly as the main shape for my creation. We all know that the butterfly evolved from the chrysalis. The chrysalis does not correspond to the society's standardized aesthetics of beauty. But all beautiful butterflies need to go through this process before they become beautiful beings. Just like the human being's self-reconciliation, only when we can accept everything about ourselves and start to reconcile with ourselves truly, can we become more self-confident. In addition, the asymmetry of the masks and the use of different materials also intuitively echoes the theme of \"imperfection\" by displaying \"broken beauty.\"||*The title Hua Jian Cheng Die is a famous Chinese idiom used to describe the process of turning a cocoon into a butterfly."
  },

  78:{
    "work number": 77,
    "firstName": "Diana",
    "lastName": "Luo",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Mask",
    "description": "My parents thought I was naughty when I was in primary school. In our culture, all kids should behave and somehow act like an adult when they are young. Under the influence of these mindsets, being too active was forbidden in my house. When I was a kid, if I had an idea, I immediately put my ideas into practice and I would often get punished for doing it. Such as drawing on walls and hiding under the dinner table. My parents tend to believe that strict teaching methods will result in well-behaved children, although there is a certain truth, this is not completely logical, the education of children is not blindly pursuing strict but combining the actual adjustment methods. Even now my parents are still advocating this parenting method, but they do not know that such education methods can cause emotional damage to us. For this mask, I primarily focused on creating a contrast between the adult body wearing the child mask to satirize this mindset that I believe everyone no matter what age you are, should have the right and freedom to enjoy life at the moment. In this mask, I used clay to mold an exaggerated facial expression as well as a high-contrast red for the cheeks. For the scene, I chose to create a symmetrical table implying rules and boundaries and having the figure in the middle breaking that symmetry."
  },

  79:{
    "work number": 78,
    "firstName": "Annabel",
    "lastName": "Demarino",
    "collaborators": "",
    "program": "Undecided",
    "course": "Integrative Studio 1",
    "title": "Crush",
    "description": "Exposure to sex on the internet at an early age, paired with getting involved in misogynistic communities online as a preteen girl, prompted my childhood self to develop an immense fascination with sex. This led to an obsession with being desired as I was growing up: believing my self-worth was derived from my attractiveness and sexual appeal as a woman. I sought to convey a feeling of disturbing naiveté through this self-portrait, creating an eerily cute yet creepy atmosphere that represents the over-sexualization of my younger self."
  },

  80:{
    "work number": 79,
    "firstName": "Vicky",
    "lastName": "Tang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Fate",
    "description": "This is a self-portrait of myself. In the image that I created myself in, I added a hand with red string on it, showing how there is fate behind everything. On the walls, I have string and lyrics of my favorite song."
  },

  81:{
    "work number": 80,
    "firstName": "Fiona",
    "lastName": "Du",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Myself",
    "description": "Exploring the realm of artistic expression has been an exhilarating journey for me. Using acrylics to paint vivid depictions of landscapes is something I used to do, but this particular piece is a far cry from my usual artistic endeavors and is my first attempt at acrylic painting a self-portrait. In order to explore uncharted territory, I dove in and adopted a novel style throughout the creation process. I was inspired by the timeless appeal of Madame Cézanne's classic canvases, which fueled my desire to understand and emulate their subtle techniques. Immersed in my research, I transcended my familiarity and utilized this unique painting style to master the nuances of self-portraiture and navigate the labyrinth of color application. This process has been transformative for me, shaping not only the canvas, but also my own artistic identity as I bridge the gap between familiar acrylic brushstrokes and the nuanced delicacy of classic oil painting."
  },

  82:{
    "work number": 81,
    "firstName": "Yujin",
    "lastName": "Seo",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "Friendship",
    "description": "When choosing what to make with wire, I looked back to my life and considered what my real priorities were, and what values I always thrived to keep. They all connected to one conclusion. Relationship with friends.||I have chosen this picture after scrolling through hundreds and thousands of photos, because I thought it most perfectly fitted the definition or the value that I wanted to portray through this relatively simple project. He is my old friend who were in the same hospital after we were born- so basically someone whom I have been friends with for my entire life."
  },

  83:{
    "work number": 82,
    "firstName": "Alexis",
    "lastName": "Shim",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Drawing and Imaging",
    "title": "Self-Portrait (after \"Ophelia\")",
    "description": "I wanted to create an illustration alluding to my experiences with depression and being at my lowest, inspired by paintings of Shakespeare's Ophelia by Frederich Heyser and John Everett Millais. Ophelia, love interest of Hamlet, is driven mad by the chaos around her and essentially drowns herself in a river. Her death is the subject of many works of art and poetry, and is often romanticized. My dress, although pretty, has a pattern reminiscent of a hospital gown, and the roses floating beside me are romantic but recall a funeral setting. I wanted to subvert the male gaze in my piece by portraying myself still alive, staring directly at the viewer and almost challenging their complicitness in this preventable tragedy."
  },

  84:{
    "work number": 83,
    "firstName": "Grace",
    "lastName": "Gallagher",
    "collaborators": "Serena Huang",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Distress",
    "description": "This project consisted of us making a mask to replicate a certain emotion. The emotion we choose was distress or fear. We wanted to have interactive parts of the mask, so we had the skin being pulled away from the mask as if it was pulling the skin layer off of the face. This mask can represent a deeper meaning about feeling isolated and wanting to escape. Sometimes when we face large emotions we tend to self destruct instead of finding the logical solution to the problem and emotions. The person is pulling the skin off in hopes of it getting better or escaping, but instead this is very self destructive leaving the person with the face underneath."
  },

  85:{
    "work number": 84,
    "firstName": "Zahra",
    "lastName": "Aboul-Magd",
    "collaborators": "",
    "program": "Other",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "Anxiety is something most people have these days and there are way of dealing with it such as medication, therapy etc. The main thing I have found works best for me is controlling my breath. When given this prompt I found myself feeling overwhelmed with anxiety, unable to figure out what to do. I immediately thought about lungs. My lungs are what keep me stable and bring me back to earth. For my piece I created lungs out of wool to give the effect of the softness of lungs but also the firmness. I included a real breathing tube to replicate the treacea but not to scale of the real one in contrast to the scale of the wool lungs I made I order to depict a deep breath or the never ending deep breaths I take."
  },

  86:{
    "work number": 85,
    "firstName": "Carina",
    "lastName": "Dai",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Time",
    "title": "Captured",
    "description": "For this piece, I was thinking of letting people who I love to blow up balloons and filling a container with these balloons. The force that the balloons exert on one another makes them distorted, yet they are still and steady in a structured way. Over time, each balloon will slowly lose air and deflate, which might cause the gap between each balloon to widen and get to the point where the surfaces of each balloon no longer touch each other. The deflated balloons might eventually scatter to the bottom of the box at the end of the semester. By capturing the breath of those I love, and through this change in relationship between the balloons, I wish to concentrate on the question whether tension, conflict, and relationships always fade away?"
  },

  87:{
    "work number": 86,
    "firstName": "Anna",
    "lastName": "Bolla",
    "collaborators": "Isabella Mchale",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Loss and the Emptiness that Follows",
    "description": "This project is about creating a painting and a sculpture that work together but can also be shown separately. The memory we connected on was the unintentional absence of a father figure. Our fathers passed away when we were 11 due to unforeseen circumstances.  || For the painting part of this project, Isabella used a reference image from Google to sketch the outline of the lungs. On top of that, Isabella was inspired by the lightboxes doctors use when taking a closer look at people’s medical scans. As for the sculpture part, Anna was inspired by Anonymous artists who made grief sculptures out of clothing. ||For this project, Anna distressed two recycled men’s dress shirts to create a kind of ghost-like shape. Isabella painted two canvases black and cut out lung-shaped holes, connecting them with the scraps from the shirts. When presenting this artwork we decided to hang the sculptural element behind the painting, with the intention of it being viewed through the painting. ||The ghost silhouettes that Anna created using the shirts symbolize the absence of our fathers in our lives, they are now gone but fragments of them remain in our memories. As for the painting part, we both connected on the fact that the loss of healthy lungs was a big part of our father’s death. Ultimately we wanted this painting/sculpture to be like looking at loss and the emptiness that follows."
  },

  88:{
    "work number": 87,
    "firstName": "Sofia",
    "lastName": "Yu",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "My Love",
    "description": "Through this weaving, I wanted to express the feeling of love. Specifically, the feeling of having a crush on someone. I wanted to express how it feels to be in love, from the excitement to the craziness to the joy of it. Shades of pink and red melt together and different organic textures spill out of the work, like overflowing feelings. The heart is on the left side, representative of the heart in my chest, and the various yarns, fabric and ribbons surrounding create a chaos that feels like butterflies in one’s chest. Love is simultaneously messy and pretty, and I think the medium of weaving really properly expressed that."
  },

  89:{
    "work number": 88,
    "firstName": "Alexia",
    "lastName": "Behar",
    "collaborators": "Alyssa Kim",
    "program": "Strategic Design and Management (BBA)",
    "course": "Integrative Studio 1",
    "title": "N/A",
    "description": "The initial step of bridge 2 required us to interview our partner with the twelve questions by Bhanu Kapil for “Vertical Interrogations”. This interview would be critical in order “to consider how personal identity is made and changed” and “to create a wearable object that shifts the identity of the wearer. What stood out to me whilst interviewing Alyssa was the contrast between Alyssa’s experience living in America whilst knowing and appreciating Korean culture and its values. After making a moodboard, the piece of clothing I designed would encompass several components of this version of Alyssa’s identity. Pink was chosen as the colour for the dress as I thought it would reflect the concept of girlhood but also how it is naturally associated with female childhood since pink acts as a major part of gendered associations and a gender binary. I also decided to incorporate a Brazilian technique of sewing circles of fabric and then sewing them together, each individual circle named \"fuxico\". I was inspired Marina Bitu. One of my first final ideas was to make a Durumagi, a traditional style Korean coat with many Goreum, which is a one loop bow used in hanbok, traditional Korean wear. Underneath the coat, there’d be a more mature and revealing dress. The two pieces would represent the identity shift of Alyssa perception of her self in the past versus the present. However, I decided to merge both of my designs into one and just focus on enhancing one shift in Alyssa’s identity. This was the identity before Parsons and who she sees herself as a child. The final design included four Goreum to reiterate being wrapped. The process of making the dress contributed to my work for Seminar, in which I wrote about seeing Alyssa in the garment as a bystander."
  },

  90:{
    "work number": 89,
    "firstName": "Khanh",
    "lastName": "Phan",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Anyone want to buy flowers?",
    "description": "This work is a transformed version of the baskets that were originally used by the street vendors in Vietnam. With two baskets on the shoulders, street vendors sell all kinds of goods that buyers need such as noodles, snacks, tofu, or newspapers while singing out loud to advertise for their goods. Here, this artwork presents the main product in the baskets as flowers. This object has been considered as a street icon, a Vietnamese culture since it has been used for hundreds of years; however, what the street vendors carry is not simply a culture representation, but a burden that they have to make their living day by day based on these baskets. Their whole family’s lives rely on how many flowers they sell per day. After decades, street vendors become a job that is passed from generation to generation. This is the reason why I chose recycling plastic spoons as the main materials for this piece. The cycle of reusing or recycling the materials somewhat symbolizes the repeating cycle of these street vendors baskets over decades."
  },

  91:{
    "work number": 90,
    "firstName": "Luca",
    "lastName": "Cyr",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Sustainable Systems",
    "title": "Pollution Overtaking the Planet",
    "description": "I chose to respond to pollution in the fashion industry. My project is a sculpture created from thrifted materials that were damaged past the point of use for their original purpose. I used these materials to make a sculptural dress that I painted with a homemade blueberry pigment. The paintings represent the beauty of nature and the various natural systems that are being wounded or destroyed by fashion pollution. I then created a fabric tube filled with fabric scraps that I have collected from past projects. I attached the tube of would-be pollutants to the dress to represent the natural world being overtaken by this man-made pollution."
  },

  92:{
    "work number": 91,
    "firstName": "Mabel",
    "lastName": "Lok",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Space and Materiality",
    "title": "Study of a Boot",
    "description": "As it was my first time coming across orthographic drawing, it was difficult at first. However, as soon as I got the flow, the orthographic drawing became easier to follow. During the study of the boot, I looked closer at my photographs and the real life object. Drawing this out, I had to be very mindful of the softness of the pencil as it gives different tonal values in the drawing.||The boot made in both wire and wood are made exactly to the real size, which is up to knee height. The wire work was where I found most difficult, since I struggled in the beginning to evenly coil the thicker 1/18 gauge. As I got familiar with the material, I began to work towards building the structure so that the tall boot can stand alone - using thin 1/24 wires to outline the shapes as well as to hold the balance of the structure. ||The wood work required much more dedicated thinking, measuring and planning. Following my orthographic drawing, I shifted the measurements to a 4'x4' 1/2\" plywood. When cutting on the band saws, I added the wavy outline on the sides to imitate the crease that leather fabric creates. Then finally, the connector slots took the most consideration in maintaining the outline of the shoe, as well as creating dimension and structure. Overall, I enjoyed making the wooden boot."
  },

  93:{
    "work number": 92,
    "firstName": "Jessica",
    "lastName": "Saadia",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Space and Materiality",
    "title": "Radiant Roots",
    "description": "As a Middle Eastern Syrian Jew, my community plays a crucial role in influencing my outlook on life and world views. Our past molds us into who we are today by providing us with a value system and moral compass. Ties to our roots nurture individuality and foster exchange of culture within the melting pot of NYC. As a first-generation American, I  decided to preserve my Syrian Jewish culture instead of shifting away from it to fit in. I felt that noticing the crossover of one’s past and future is crucial in forging a distinct identity.|Inspired by my heritage, I created a symbolic chandelier highlighting the importance and weight history has on shaping our future. This chain-suspended light fixture is made up of an 11-sided wooden polygon with a hinged top door, bottom light socket and adorned with raw branch pieces throughout. The suspended branches symbolize the metaphorical and literal foundation of a person, equivalent to the roots of a tree. The Arabic and Hebrew inscriptions were a result of bible lessons from my Syrian-born father and grandfather. It translates to “A people with no past has no future.” |This project allowed me to deepen my cultural understanding, uncover new aspects of my identity, and bond with family over stories of the past. Although Parson’s has students of various backgrounds, we can all benefit through rooting ourselves in history."
  },

  94:{
    "work number": 93,
    "firstName": "Rachel",
    "lastName": "Yan",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "n/a",
    "description": "Branching off of the ideas of haptic and touch in the assignment prompt, I created this piece with the intention of the piece being able to move, via touch from the viewer. Hands can communicate a variety of messages, so I wanted the choice in message to be up to the touch of the viewer, to portray whatever they wanted to say. My initial drawing was of a hand with it's finger's crossed, because I wanted a sort of signature on the piece, and the letter \"R\" in sign language is the pointer and middle finger crossed, with the ring and pinky tucked behind the thumb. That's why the thumb is stationary and positioned the way it is, to keep a remnant of the letter R in the piece, even if the other fingers are positioned differently. I chose to use wood for the fingers and clear acrylic for the palm, as I wanted the focus to be on the posability of the fingers, and the notion of touch as well."
  },

  95:{
    "work number": 94,
    "firstName": "Marianne",
    "lastName": "Jeffs",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "A Borrowing of Bones",
    "description": "Looking at how our bones protect the important parts of our body, I wanted to emphasize the fragility they hold and leaves parts of us vulnerable. Specifically focusing on the ribcage, this armors both the heart and lungs which are essential to the human body. When feeling overwhelmed and overworked, our bodies can react to this, such as panicked breathing and increased heart rate. When I am caught in a panicked state, I tend to hold my hand over my heart and ribcage to remind myself to slow down. I decided to use a muslin cloth to imitate medical gauze, putting scrap pieces of fabric over certain bones to emphasize that bones can be brittle, so it is important to take care of every part of yourself. The eyes on both the singular left lung and heart add into the idea of our well-bieng because they are always watching us, for when we feel affected so can our bodies."
  },

  96:{
    "work number": 95,
    "firstName": "Saanvi",
    "lastName": "Gupta",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Integrative Studio 1",
    "title": "Reuse Rethinking project",
    "description": "For this project we were required to use materials lying around the house to make something of use. We were made to experiment with the materials; in my case the bubble wrap. I experimented with different techniques, boiling it, weaving it, pleating and knotting it. That i how i came up with the idea of The bubble wrap dress."
  },

  97:{
    "work number": 96,
    "firstName": "Roman",
    "lastName": "Ingrassia",
    "collaborators": "",
    "program": "Architectural Design (BFA)",
    "course": "Space and Materiality",
    "title": "Foot",
    "description": "This is a plaster cast of my foot I made for my Space and Materiality class. for the mold I used Accu-Cast 570 alginate, and for the cast I used 5 pounds of Hydrocal statuary plaster. This work is obviously inspired by Roman copies of ancient Greek statues, although unlike the original marbles, mine will remain uncolored like the museum works we admire today"
  },

  98:{
    "work number": 97,
    "firstName": "Sadie",
    "lastName": "Kaino",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Integrative Studio 1",
    "title": "What are you?",
    "description": "This piece is a pillow inspired by Japanese streetwear specifically in Harajuku, drawing from elements of my childhood and life through beading, plush objects, embroidery, text, and mosaic tiles. The object represents how my mixed Japanese and Italian heritage has led to countless comments throughout my life asking \"what are you\" referencing my race and 'complimenting' my \"exotic\" features. Even within my own family, relatives from my Italian side continue to comment on my 'exoticness' isolating me from those familial spaces as well. The text \"しゅしんどこですか\" translates to \"Where are you from?\" in Japanese, further speaking to the idea of being an outsider in Japanese spaces as well."
  },

  99:{
    "work number": 98,
    "firstName": "Sophia",
    "lastName": "Ormond",
    "collaborators": "",
    "program": "Photography (BFA)",
    "course": "Space and Materiality",
    "title": "Coiled Mind",
    "description": "This self-portrait serves as a visual manifestation of the inner workings of my mind. Prompted by the theme \"It's All In Your Head\", this head encapsulates my mental landscape. My mind is complicated but creativity flows through me like the blood in my veins. I'm addicted to spontaneous art- art that tells you where to go rather than sticking to a set of fixed guidelines. \"What happens when making becomes a form of thinking and thinking becomes a form of making?\" is a question for discussion. I believe that my head answers that question... this is what happens. Using air dry clay and pipes for armature, I built a head and then completely wrapped it in endless variations of coils."
  },

  100:{
    "work number": 99,
    "firstName": "Emma",
    "lastName": "Li",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Space and Materiality",
    "title": "The High Heel Study",
    "description": "To understand the nature of an object through different forms of observation and translation, it is important to understand the construction of the object. As such, to understand the form of my chosen object, the high-heeled shoe, I created an orthographic drawing that allowed me to visualize the accurate dimensions of the shoe using the side view, top view, and front view. To further understand the shoe, I brought it to life from my drawings using 20 gauge wire to create a life-size model. With this 3D model, I was able to gain a better understanding of the way the shoe is constructed, thus, allowing me to become creative with designing a wooden structure that represented the shoe with 5 intersecting planes. As a result, this intimate study of my object allowed me to gain a deep understanding of how objects, specifically high heels, are constructed and how different elements of it interact with each other."
  },

  101:{
    "work number": 100,
    "firstName": "Roman",
    "lastName": "Ingrassia",
    "collaborators": "",
    "program": "Architectural Design (BFA)",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "This a head made of organic wooden shapes and 16 gauge wire, it is about 10\"x12\"x18\". I used the laser cutter and some hand cutting to make my shapes, and then drilled holes, and connected with wire."
  },

  102:{
    "work number": 101,
    "firstName": "Sophia",
    "lastName": "Wang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Reach for Home",
    "description": "From the letters and interviews with my partner, I was able to learn about her fear of leaving home and coming to NYC from Albania. In this contemporary mask, I decided to include elements of Albania, their nation’s flower red poppy, and the beads commonly found on their traditional clothing. I aim to use these elements to create a sense of home, constructing a large-scale mask capable of surrounding or wrapping the head and body. I wish to convey a comforting message that family will always be there to support our back and that connections will not disappear due to the physical separation.||Moving on to the construction details of the mask, the flowers on the mask, shoes, and the draping vines down the body showcased are stitched on a fabric base and are either hand-crocheted or made with papier-mâché. The silhouette is to resemble the shape of the red poppy and is supported with thin wire stitched to the fabric. This is achieved by wrapping nylon shoelaces to the wires, providing an edge capable of stitching. The mask itself is attached to an altered headband from the inside of a construction hat, enhancing the wearability of the mask. ||The bedroom of our dorm is the location selected for the photoshoot, and the uncanny is emphasized greatly by the fact that the model is wearing her shoes on the bed. In my culture, wearing outdoor shoes on the bed is something uncommon and weird, as they contaminate the ultimate place of privacy and relaxation. Therefore, the fact that the figure in the photo was wearing shoes while reading comfortably on the bed resulted in a great sense of uncanny. This also indirectly leads back to the statement of her not considering the dorm bedroom truly as home."
  },

  103:{
    "work number": 102,
    "firstName": "Yuting",
    "lastName": "Wang",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "My work includes a building and a girl. The building is The New School University Center, and the girl is me. Before I started school, all the information for the school I knew was from the Internet, and I didn't have any real experience. I fantasized about coming to The New School until I experienced what it was like to be a student at The New School. In my work, I was standing on the street and I could only see the outside of the building of The New School. I blew bubbles towards it, and the scene in the bubble contained my dormitory, my classroom, and the scene from inside the school, which represent my experiences at The New School. All the places in this drawing are in perspective. For colors I chose tetradic colors which are blue, orange, red, and green. I chose these colors to express the fantastic feeling."
  },

  104:{
    "work number": 103,
    "firstName": "Anishka",
    "lastName": "Tewari",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Persona Unlocked",
    "description": "“Persona Unlocked” is a wearable art piece that explores the concept of hidden identities and the narratives that often remain concealed beneath the surface. The project’s objective was to create a unique wearable art piece that exposes an alter ego for my partner.||Initially, she came across as someone with a minimalistic fashion taste and a straightforward way of life, and someone who was super introverted . However, as I got to know her better, I discovered layers of her personality that she rarely shared with others. Beneath her reserved exterior, I found a playful, carefree, and somewhat goofy side that exudes happiness.|While she does have minimalistic fashion sense, and avoids colorful maximal fashion, there is a part of her that is attracted to that side of fashion and wished she embraced it.||I wanted the inside to be adorn not just with color for aesthetic but with little elements that tell us more about Joanna’s diverse facets of her personality.||I started by  sourcing waste material from the fashion rooms to use and my colorful base.|I bought pastel pom poms and beads to create funky flowers, and used old candy wrappers stuffed with pom poms, to add more playful elements.|I created tiny teddy bears with the pom pom too, to play with the childish energy.||I also wanted to replace the traditional buttons on the jacket with latches to emphasize the idea of unlocking the other side to her.|once i had added them, it resembled a straight jacket, playing even more into the idea of holding back and restraining ones trueself."
  },

  105:{
    "work number": 104,
    "firstName": "Yinan",
    "lastName": "Xue",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Drawing and Imaging",
    "title": "Memory Palace-Mangrove",
    "description": "This project aimed to utilize the memory palace technique to construct a visual scene housing information to be remembered. My creative intention was to build an immersive mangrove ecosystem inhabited by native flora and fauna within an abandoned art gallery structure. This resonated with the concept of the memory palace by linking visual imagery with information storage.||The materials and architectural choices were relevant in creating an atmospheric, memory-enhancing space. The red glass and wooden art gallery induced a sense of wonder and discovery, while the scattered frames on the ground provided contained spaces to exhibit creatures. The three-tiered structure of producer (mangrove trees) - connector (glass strips) - repository (gallery) mirrored the ecosystem hierarchy.||Sketching using one-point perspective principles allowed me to accurately convey depth and scale when translating my mental envisioning onto paper. This informed the 3D modeling process in Blender to build a structurally-sound digital scene. Finally, vintage-toned posters helped further convey both the repository concept through splitting information into parts, as well as the passage-of-time ambience via the muted coloration. Ultimately, content resonance took primacy over stylistic elements."
  },

  106:{
    "work number": 105,
    "firstName": "Christina",
    "lastName": "Koo",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Still Life",
    "description": "While creating this project, I wanted to get the most out of the different mediums I had and merge them together to end up with an interesting outcome. I cut out different parts of each medium and started to assemble them together, experimenting with the composition of the object layouts and seeing what worked and what didn’t—the whole process was mostly intuitive. The use of negative or positive space on the white background was something that I focused more on, as I wanted to draw more attention to the objects but also incorporate it into the actual drawing to create a compelling effect; for example, utilizing the white, negative space as the fabric the objects are placed on. My biggest takeaway from creating this piece was that making art intuitively and trusting your gut in the process of doing so has the possibility of resulting in captivating art."
  },

  107:{
    "work number": 106,
    "firstName": "Thomas",
    "lastName": "Maggart",
    "collaborators": "",
    "program": "Photography (BFA)",
    "course": "Integrative Studio 1",
    "title": "Pride of a man",
    "description": "I had made this project to represent how my life has changed since I have moved here and how I sort of feel like it is my duty to photograph New York life. These pictures encapsulate everyday life but also showcase things that add to the culture of New York such as established music producers, rappers and other fellow creatives. All of these pictures are taken on 35 mm film or a fujifilm digital camera. If I am selected I would like to blow up the image and show it as a large print."
  },

  108:{
    "work number": 107,
    "firstName": "Eden",
    "lastName": "Schulman",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "For my imagined space, I decided to represent the feeling of being in a nightmare. My piece takes place in a dark hallway with multiple passageways. Those passageways seem like they offer a way out of this ominous hallway, but they don't. In my piece I wanted to capture the feeling of nervousness, anxiety, and fear. Because my piece is based off of the feeling of being in a nightmare and feeling trapped, I added elements like water filling the hallway up and strange thick branches riding up along the walls and floor. I also wanted this piece to be dark. The use of light and dark also implies in my piece that the further you look down the hallway, the darker it gets. and as you look into the other passageways, you see it leads into darkness as well. Which way is the way out? Are there any?"
  },

  109:{
    "work number": 108,
    "firstName": "Jodi",
    "lastName": "Tay",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "N/A",
    "description": "For this assignment, I created a structure with layers and windows. I chose red and black as my color palette to create a chilling mood, and I made the color of the ground and the sky similar in value to make the structure look as if it were floating."
  },

  110:{
    "work number": 109,
    "firstName": "Minsung",
    "lastName": "Kim",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Double Life",
    "description": "Fabricating and morphing the truth is what many of us consider a Lie, in a life where we have the freedom to choose our actions as narrators we many times bend the truth. Whether to boost our social status or give the illusion that we are someone else this piece documents the two parallel worlds of reality and the tongue. People are condemned to their egos and pride, by contouring the truth of our failures we boost   a false sense of confidence, this series of photos documents a day of skating, the tricks that aren't landed, and the sometimes boring periods twisted into something more entertaining for us to tell. By blocking the full truth of events each and everyone of us in a sense live a double life, one that is given to us, and the other we share for self indulgence."
  },

  111:{
    "work number": 110,
    "firstName": "Hyeonwoo",
    "lastName": "Moon",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Drawing and Imaging",
    "title": "Plight",
    "description": "Through this painting, I expressed the image of our human beings gradually being destroyed and corrupted by the elements created by humans. A human being who regrets and tries to stop time, and yet another entity of evil that continues to be injected. Through all of these, it is expressed that the actions taken towards peace and a better future in the present are actually ruining our society even more and killing each other."
  },

  112:{
    "work number": 111,
    "firstName": "Zoe",
    "lastName": "Imas",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Integrative Studio 1",
    "title": "3 People in Harlem",
    "description": "My painting was heavily influenced by the neighborhood itself. I learned a lot about how Harlem’s history, specifically the Harlem renaissance, affected the culture in and around the neighborhood. My intention was to highlight the sense of community within the neighborhood and also to showcase Harlems beauty, as a way to counteract people’s preconceived notion’s of Harlem. My studio class inspired me to look deeper into the neighborhoods of New York and to base my work off of my own experiences and thoughts rather than what I can find online."
  },

  113:{
    "work number": 112,
    "firstName": "Yujin",
    "lastName": "Seo",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "Marionette",
    "description": "I have chosen to do an image of a wooden doll controlled by a hand, because I felt like it would fit the intention of the project, as well as reminding myself of my portfolio subject."
  },

  114:{
    "work number": 113,
    "firstName": "Felicia",
    "lastName": "Hertada",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Integrative Studio 1|Integrative Seminar 1",
    "title": "Beauty Inside",
    "description": "In this project, I made a comforting mask for my partner who sometimes afraid to start a friendship because of the possibility of getting negative effects. When concluding the social identity issue from the interview, I immediately thought of the quote \"Don't judge a book by its cover\". There can be so much beauty and possibility of strong friendships if we get to know people better and are not afraid to start friendships even though caution is important. From there, this mask was inspired where when it's dark or we are just starting to get to know someone, maybe that person can look dangerous, which here is indicated by the red wire. However, maybe behind it all there is the beauty inside that person that we can only know after getting to know them more closely on the brighter side."
  },

  115:{
    "work number": 114,
    "firstName": "Katherine",
    "lastName": "Whitman",
    "collaborators": "",
    "program": "",
    "course": "Integrative Studio 1",
    "title": "Study of Albrecht Durer “Melancholia I”",
    "description": "I made a direct study of Albrecht Durer |Engraving “melancholia I” as my final project for studio."
  },

  116:{
    "work number": 115,
    "firstName": "Edmond",
    "lastName": "Huang",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Integrative Studio 1",
    "title": "Paranormal Synchronicities Movie Poster",
    "description": "A movie poster of a horror-themed supernatural thriller that was supposedly going to air on October 31st, 2023 (i.e. Halloween). The project for which I made this poster involved creating something that would enhance my assigned partner's beliefs. Since my partner had a lot of beliefs that erred on the supernatural and spiritual side and I was super fascinated with the horror genre, I opted to make a horror movie poster. I included a lot of elements that embodied the beliefs my assigned partner had - some more cursory and some more apparent. I even included her as one of the main characters in the made up movie."
  },

  117:{
    "work number": 116,
    "firstName": "Echo",
    "lastName": "Huang",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Drawing and Imaging",
    "title": "Please Write to Me",
    "description": "This is a unrealistic space where I combined bubbles and water in the sink with a children playground. I was inspired by the concept of liminal spaces, the spaces of transitions. The fact that liminal spaces,  like hallways and hotel rooms, can strike poeple's memories made me want to create one of my own. Thinking back, those indoor playgrounds in shopping malls always remind me of the friends I made a long time ago. The friendships were short, but they always stays in my memory. I think of forgetting memories similar to the process of water flowing down the sink. The memories stays like bubbles and they left a long-lasting moisture in your heart. I also included envelopes and letters to tell how much I wanted to keep in touch with them. But reaching out to them is like sending letters that never arrives. The feelings remain, but the people never return."
  },

  118:{
    "work number": 117,
    "firstName": "Jasmine",
    "lastName": "Lin",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Integrative Studio 1",
    "title": "Alice in Wonderland",
    "description": "I was given two scenes from the movie Alice in Wonderland. I took it upon myself to photograph and photoshop my friends into the Alice in Wonderland scene. I chose to only show Alice instead of both scenes."
  },

  119:{
    "work number": 118,
    "firstName": "Xizi",
    "lastName": "Zhou",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Time",
    "title": "年月日",
    "description": "For my work 1, two pieces are pink background. The left piece expresses the painful process that I wake up every morning or probably even noon. The green geometric shape is my bed. My bed sheet is green. The bed sheet is what I have used in school since junior high school, full of memories for me. I really love my bed, because bed is warm and comfortable, and love me forever. For the right pieces, I used watercolor and markers to paint. I like the evolution of Chinese characters. I can feel the flow of time. ||For my work 2, there are four small parts. For the blue-background three, I was inspired by Monet. He painted the same things at different times. So I looked at the cube under the window at different times. The last cube is empty because in different weather and light, the cube has different colors and shadows, so I connect in mind that it's transparent. For the orange one, I really love the motion when my cat sneeze. I sketched her abstract."
  },

  120:{
    "work number": 119,
    "firstName": "Mina",
    "lastName": "Chen",
    "collaborators": "",
    "program": "Interior Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Reflection",
    "description": "In this artwork I aimed to explore my inner personality, emphasizing the process of overcoming insecurities and shyness to connect better with others. For my past portrait, I depicted how, as a child, I wanted attention from my parents by appearing extroverted despite inherent shyness. Reflecting on the present, my portrait portrays an outwardly talkative and extroverted persona, masking internal struggles with opening up and fears of vulnerability. Looking towards the future, my focus shifted to a journey of personal growth, aiming to embrace insecurities and foster self-acceptance and confidence."
  },

  121:{
    "work number": 120,
    "firstName": "Tiffany",
    "lastName": "Liu",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Time",
    "title": "A Puddle",
    "description": "This piece fit due to its utilization of a long landscape canvas. As the reader views the puddle from left to right, the piece progresses through the stages of rain. Starting from no rain, drizzle, heavy rain, and to sunshine. Plants in the background also help depict the passage of time in the piece. ||I really wanted to create a piece that had length. We discussed in class about how art on historic scrolls was a fantastic example of a time map. Mainly because they told a story and by the time you got to x point, time has passed."
  },

  122:{
    "work number": 121,
    "firstName": "Tanya",
    "lastName": "Bansal",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Space and Materiality",
    "title": "My most self",
    "description": "We first built a frame. I chose to use oil as the medium of my self portrait. I painted my working space in the morning, as I think I am my most self during that time. My behavoiur according to me is affected by a lot of things which is exhausting by but how the world works. But when I am waiting alone at 5am, there is no show, no reason to be, no motivation to do things a certain way, just me. It's just me being my most authentic self. That could be calm, angry, frustrated or anything that I deem fit for that day."
  },

  123:{
    "work number": 122,
    "firstName": "Ian",
    "lastName": "Ritter",
    "collaborators": "",
    "program": "Photography (BFA)",
    "course": "Integrative Studio 1",
    "title": "Boyscout",
    "description": "A tryptic of Lina, delving into the dynamics of home, heritage, patriotism, and identity.  The tryptic lacks narrative progression, instead operating as pieces of a whole."
  },

  124:{
    "work number": 123,
    "firstName": "Kiara",
    "lastName": "Li",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Memoir",
    "description": "Before commencing this project, we delved into the concept of an alter ego in class. Among the various reasons and functions that describe the formation of an alter ego, I am particularly fascinated by the idea that an alter ego can help evade insurmountable problems in reality, allowing us to explore different approaches to confront and solve these issues through an alternative personality.||As I reflect on my past, I remember being an extremely socially anxious individual, apprehensive about engaging with strangers. However, during my junior high school years, I created an online account for chatting and sharing daily experiences. Within that virtual persona, I portrayed myself as more optimistic and cheerful than I was in real life. Through this online identity, I connected with numerous netizens, some of whom later became friends in my offline reality. Their encouragement propelled me towards greater extroversion in my actual life. I find this phenomenon intriguing.||In many instances, like myself, individuals often present a different side of themselves online compared to their real-life personas. The alter ego created in this manner may very well embody the person we aspire to be in our day-to-day lives. It allows us to undertake actions that we might hesitate to pursue otherwise. Simultaneously, this virtual account is influenced to a certain extent by a series of events that transpire in our actual lives, thus remaining intertwined with our memories and experiences.||I believe that an avatar created in digital realm, possessing multifaceted qualities and encapsulating our memories and diverse visions of ourselves, is highly appropriate to make in this project."
  },

  125:{
    "work number": 124,
    "firstName": "Nasongphorn (Pie)",
    "lastName": "Thongkukiatkul",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Time",
    "title": "Our Heart",
    "description": "I was inspired by my previous project, making a film and creating a book; I combined the book and video medium to create a unique experience for my audience - a video book. The story revolves around a character named 'Mr. Heart', and the major theme of the work is nostalgia and family. The untold story of Mr. Heart and his parents is brought to life in this work, revealing some of the unseen moments of their relationship. To evoke a sense of nostalgia for childhood memories, I decorated the book with vibrant colours and playful elements and added a special touch with a diary notebook from Mr. Heart's parents, complete with an animation. I aimed to create a warm and comforting experience for my audiences, giving the sense of closure we often felt in our younger years."
  },

  126:{
    "work number": 125,
    "firstName": "Carolyn",
    "lastName": "Mottern",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Space and Materiality",
    "title": "Ship's Cabin-Model",
    "description": "A model of a ships cabin. The room belongs to the navigator of the ship. I remembered this room from a book my mom read to me when I was little. I wanted the design of the model to seem cozy and comfortable because the memory of my mom reading to me feels this way. I started with cardboard as the base and covered constructed the walls with slices of wood. I weathered the wood with paint to give it depth. Then I made the objects that fill the room like the maps and the fireplace. In the fireplace I put an electric candle to give to room a warm glow."
  },

  127:{
    "work number": 126,
    "firstName": "Queena",
    "lastName": "Lee",
    "collaborators": "",
    "program": "Undecided",
    "course": "Time",
    "title": "My Personal Manifesto",
    "description": "A personal manifesto can guid and ground me on my values and beliefs. I reflect on myself from the previous years and discover my goals.| It led me to find what my manifesto can refer to and lean in to.| My manifesto reflects my current values and beliefs. It outlines how I want to be passionate and achieve, and how I can intend it to live my life. |The images were taken while I lived in Vancouver. Each image is the moment when I realized what was important in my life and was inspired."
  },

  128:{
    "work number": 127,
    "firstName": "Shane",
    "lastName": "Smith",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Space and Materiality",
    "title": "Fragile Form",
    "description": "I chose my torso as my sacred body part. I did so because I have had a long, not great, relationship with food and my body. The piece was made to show the strength and power I get from this area of my body. I don't see it as being fragile, or weak, but strong. This is also where the orientation comes from as the body is put on a three legged base leaning towards the side with no leg, as if the body is holding itself up. I created a base out of newsprint paper and painters tape. I then used wire to create a bone structure around the piece. Using plaster strips, I formed the bones and curves further. I finished this process by using bigger sheets of plaster strips to stretch it across the form like skin. I wanted to play on how delicate my body appears by using \"fragile\"/moldable materials, but then turning them into something solid, something that can't be easily destroyed (which is a common correlation to things considered fragile). I also wanted the body to look moldable still, like clay, even in its final form. Using a mixture of acrylic paints helped with this look. To create the wood table base, I cut a flat piece of wood into a square, and then three wooded dowels at different angles and sizes. The goal was for the legs to look wobbly, and as if they have little support and that was achieved. In reality the wooden base is stable and only needs three legs to function. The base was secured with screws and wood glue, then stained/gloss finished. The final piece is supposed to show the strength in delicacy."
  },

  129:{
    "work number": 128,
    "firstName": "Anastasia",
    "lastName": "Smirnova",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Time",
    "title": "A Story About a Night",
    "description": "My artist’s book is a handmade artwork which develops the subject of the inner warmth in every person’s life. This artwork is made out of 22 embroidery pieces with the use of my own text and images illustrating it which creates an impression of reading a fairytale. The main goal of it is to make people think of a bright future ahead of them and calm down while holding a soft piece of art in their hands.My book tells my personal story of a trip in Ireland with one precious person. I am telling the story about seeing lights in the darkness as a metaphor of a bright future ahead, even if it is a hard time now. I want my book to transfer the warmth and that’s why I want to do it entirely handmade."
  },

  130:{
    "work number": 129,
    "firstName": "Antara",
    "lastName": "Chatterjee",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Time",
    "title": "Detangling the eras",
    "description": "I decided to create a book related to hair because for my previous project I had recreated an image of me cutting my own hair and welcoming a new era of creative liberty. Similarly I wanted to make a book with different hairstyles from different eras. Each hairstyle from its respective era held immense significance and was seen as revolutionary even. The book not only contains visuals but text to dive deep into their historical significance. The white patches were hollowed out once I printed the book and thus once the viewer opened it, it had the same face for each hairstyle which I drew digitally at the end. It not only created a fun illusion but was symbolic of me trying on these various hairstyles and once again payed homage the picture representative of my creative liberation."
  },

  131:{
    "work number": 130,
    "firstName": "Lily",
    "lastName": "McMahan",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Sustainable Systems",
    "title": "Tales of Grief and Hope",
    "description": "This piece is a hand-crafted book of stories which were specifically written with the intention of building the capacity of New Yorkers to view the urban environment as part of the natural world. The imagined, socially-ingrained duality which separates humans from 'nature' detrimentally fuels climate anxiety and grief. However, if we start to pay attention to the non-human species in our immediate environment, view them as autonomous beings, and create a kinship with them, then our urban alienation starts to melt away. In order to accomplish this, I wrote and illustrated three stories about iconic species/natural phenomenon in New York City: street trees, squirrels, pigeons, the bedrock, Central Park's boulders, and Manhattan's surrounding waterways. My research revealed that humans have always sought the archetypal stories, myths, and tales which explain our world and lend moral guidance. By continuing to write in this fable tradition, I hope readers gain a mystical understanding of the natural world which has been stripped away by modern science. I made many creative choices to ground the reader in the physical sensations of the natural world. First, I created each sheet of paper by hand, using junk mail and fragments of leaves. The unique texture on every page reminds the natural elements which create paper, unlike many high-gloss children's books today. Also, I bound the book using embroidery thread and a stick gathered from a NYC park. That the reader has a physical piece of another species in their hand while reading my stories. Additionally, I strung wood and stone beads together to make a bookmark. These child-friendly design choices appeal to their urge to make sense of the world around them through touch. It can also be appreciated by adults, as the stark contrast to mass-produced books reminds readers of their origins."
  },

  132:{
    "work number": 131,
    "firstName": "Celine",
    "lastName": "Wang",
    "collaborators": "Lizi Chodrishvilii",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "DIORAMA A car crash on Broadway - Lafayette NYC",
    "description": "Crafted a three dimensional miniature model of a nyc “yellow taxi” crash on|broadway lafayette. Gloomy, sad, tragic scene of people escaping from the accident.|New York City is very fast paced and during rush hours, people seem to be in a hurry.|Therefore, people tend to drive at a fast speed and sometimes aggressively, such as squeeze|in between vehicles and any available opening to get by. This diorama represents a tragic|seen of a crash to raise awareness of safety. To emphasize the importance of safe driving,|we made a tragic car accident scene, hoping to inspire New yorkers to drive safely,|following the signs to avoid any accidents."
  },

  133:{
    "work number": 132,
    "firstName": "Junyi",
    "lastName": "Wang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Escaping From My Room",
    "description": "This is a mixed media collage based on my childhood memory. When I was a kid, I really enjoyed watching TV. Not only because I could watch my favorite cartoons, but also because I believed that the voices and characters on TV made me feel like someone was with me. I wasn't alone. I'm terrified of being alone at home, but most of the time I can't control that because of my parents' busy schedules. The scariest thing was that the TV had no signal. I glued cotton and fabric into a teddy bear to represent my childhood. It also has black and white photos on it to express how much I wish my parents could be with me. I used a 3-D pen to draw a circle that looks like it wraps around the teddy bear and can also be used to hold the TV model. I drew the pattern on the ground in red and black and used swirling lines to show my emotions of fear, anxiety, and frustration."
  },

  134:{
    "work number": 133,
    "firstName": "Hohyun(Michael)",
    "lastName": "Cho",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "On the Sunny Side of the Park",
    "description": "My project is based on a memory about a date with my girlfriend. I used air-dry clay and pottery tools to make a flower vase. This artwork is special to me because it captures the memory of our most memorable moments during our relationship. I focused on one of our favorite spots-Washington Square Park. A place where we can share a cup of coffee and decompress while enjoying the live jazz. Another important aspect of our relationship is flowers. We always marked any special occasions, celebrations, anniversaries, and sometimes just because. Therefore, I wanted to create a sentimental and personal vase filled with our memories so she can always have a place for our flowers. A small and unnoticed detail that can be overlooked is the coat of coffee I glazed over the vase. I did this because coffee was the first thing we bonded over before starting our relationship. As time went on this love for coffee has been a staple in our relationship."
  },

  135:{
    "work number": 134,
    "firstName": "Ginger",
    "lastName": "Vieth",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "Heatless Curls",
    "description": "My found object for this assignment was a curling iron I had found at a thrift store. I wanted to continue a theme of electricity/technology for my assignment. Part of the prompt was to utilize the object in a way that it is not supposed to be used. For this, I played with the idea that you should not leave open wires around heat. I created a sculpture of a woman's head with her hair being made of wire, displayed through a short video of me curling her hair."
  },

  136:{
    "work number": 135,
    "firstName": "Mikhail",
    "lastName": "Lychagin",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Integrative Studio 1",
    "title": "searching for Identity",
    "description": "The idea is to show that we all consist from similar patterns. Maps of european cities are simillar to eye patterns and fingerprints. We all similar in the way of our differences. The main theme was shift that’s why I chose things that we cannot change like fingerprints and things that are definitely important part of our identity but could be changed like a place where we live etc"
  },

  137:{
    "work number": 136,
    "firstName": "Ireen",
    "lastName": "Jeang",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Integrative Studio 1",
    "title": "Looming Clowns",
    "description": "I created two intertwined objects relating to my partner's social identity when she migrated to a foreign country and her previous alter ego project in studio class. Using fragile and sharp materials, I created a somewhat enclosed sphere to represent my partner's comfort zone that was on the verge of breaking down because of the negative words and actions she received when she first moved to Canada. The shadows of the clown's faces created from the string lights that looms over her personal bubble represent the negative, belittling attitude the people showed towards her."
  },

  138:{
    "work number": 137,
    "firstName": "Lucas",
    "lastName": "Hsu",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Transfer",
    "description": "The concept and design of my deck were inspired by the hyper-fixation of things I saw and felt moving to New York City, my awareness heightened by the concept of transfer – change, juxtaposition, turbulence. These objects and emotions I experienced are reflected in the meanings of the cards, which are written in the instruction manual.||The visual language of my deck approaches transfer through letterforms, specifically Chinese characters, and how I could juxtapose ideas of familiarity and unfamiliarity. For each card, I took a Chinese character that reflected the meaning of the card, deconstructed the strokes based on the Eight Principles of Yong, and then reconstructed the strokes into imagery that reflected the meaning of the card – creating visual juxtaposition. The objective and familiar Chinese characters turn into abstract forms to be questioned, similar to how I saw objects on the street or felt conflicting emotions moving to New York City – with a curious, questioning eye.||The manual is also fully bilingual, and for the definitions I used double-sided printing on vellum paper so both languages would appear on the same page."
  },

  139:{
    "work number": 138,
    "firstName": "Krishna",
    "lastName": "Shah",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Space and Materiality",
    "title": "Positivity of Negative",
    "description": "Through the project, I was able to make two versions of my piece- first a bit technical and the second more creative. I selected the my space to be the intersection of the the staricase. The creative model that I made had the concept of making stairs for the birds. I wanted to make the stairs for the birds as it was the exact opposit of the human stairs. Also I used more delicate and airy medium to make the transparent creative model of my project."
  },

  140:{
    "work number": 139,
    "firstName": "Daenie",
    "lastName": "Park",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Space and Materiality",
    "title": "Your ideas are getting snooped on",
    "description": "This artwork originated from the stress I experienced while I am taking a class that required me to create a physical construction that I had never done before in my life, having never learned art. Watching classmates who were familiar with creating artwork by hand effortlessly come up with creative ideas and dive into the project, skillfully handling various materials, made me feel a sense of relative deprivation. That led me to imagine having the hacking system in my body to listen to what kind of creative ideas others were conceiving in their head.||The inspiration for this artwork comes from the shape of a stethoscope. The narrative behind this art work is placing the ear shapes near people's hearts allows me to 'hack' their ideas. Fashioned after blood vessels, the red wire crochet metaphorically signifies the presence of a system within my body capable of hacking, completed with ears engraved with the words 'Your ideas are getting snooped on.' The collected ideas from the ears are stored in a memory chip situated within the central resin segment. I aimed to convey the complex anatomy of the human body by incorporating a varied selection of materials to the fullest extent, and I also sought to introduce the computer system into the organic framework for a contrasting effect."
  },

  141:{
    "work number": 140,
    "firstName": "Diya",
    "lastName": "Dhiman",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Come Back to Earth (pls)",
    "description": "I decided to explore the theme of addiction. Having witnessed the struggles of individuals battling various forms of addiction and recognizing the impact on both the individual and those around them, I aimed for a universally relatable approach. he goal was to create a narrative that could apply to any type of addiction, whether it be substance abuse, overindulgence in food, dependence on technology, or even an unhealthy relationship with a person.||The key challenge lay in finding an object that symbolized addiction. I settled on ramen, a universally comforting food. Addiction often begins with a sense of comfort and solace, much like the warmth of a familiar meal. However, as it deepens, the comforting noodles metaphorically transform into consuming worms, gradually hollowing out the individual and leaving only a shadow of their former self."
  },

  142:{
    "work number": 141,
    "firstName": "Carina",
    "lastName": "Dai",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Time",
    "title": "A Wall's Silent Dialogue",
    "description": "In the relentless march of time, we are all witnesses to our own existence and the evolving world around us. In my piece, I sought to explore the concept of witnessing by capturing a series of photographs documenting the gradual destruction of a wall over time. I positioned myself in close proximity to the wall, adopting a perspective that intimately connected me with its process of decay.||This project invites viewers to engage with questions about perception and the transient nature of existence. It encourages viewers not merely to observe the photographs but to become witnesses themselves, contemplating the beauty in decay, the passage of time, and the ever-evolving nature of our world."
  },

  143:{
    "work number": 142,
    "firstName": "Vicky",
    "lastName": "Tang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "This wire shoe almost exactly replicates a shoe that I own myself. I used around 100 feet of the black wire to complete the straps of the shoe."
  },

  144:{
    "work number": 143,
    "firstName": "Yuki",
    "lastName": "Zhao",
    "collaborators": "",
    "program": "Interior Design (BFA)",
    "course": "Space and Materiality",
    "title": "Seeing the World in Red",
    "description": "Everyone has their filter for sensing the world. My filter for world definitely will be red since I always care about the unfair and unequal. Therefore, this project is visualizing how I see the world."
  },

  145:{
    "work number": 144,
    "firstName": "Madeline",
    "lastName": "Teska",
    "collaborators": "",
    "program": "Design History and Practice (BFA)",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "For this assignment, I am drawing a lot of inspiration from my personal experiences at gay bars and as a member of the LGBTQIA+ community. Through this project, I am going to recreate the scene of a gay bar while referencing my life as a lesbian and member of a supportive and empowering community. I am taking a lot of inspiration from the lesbian pride flag and will be using primarily red, pink and yellow colors for my piece. Pride flags are a predominate symbol of LGBTQIA+ Pride and have been used to showcase that for many years. Gay bars have adapted through history as a safe haven for my community, a place to express yourself freely without judgment or fear. I have spent a long time struggling with my personal forms of self expression and was unsure of who I wanted to be. Although, when surrounded by the love and safety of my community, a gay bar always feels like home."
  },

  146:{
    "work number": 145,
    "firstName": "Suhani",
    "lastName": "Mukherjee",
    "collaborators": "",
    "program": "undecided (BFA)",
    "course": "Space and Materiality",
    "title": "A heel",
    "description": "I believe that the objects and possessions we have, such as my black heel, are not just material items but carry deeper meanings. These objects we own can serve as symbols or reflections of our cultural background, personal connections, and relationships. In the context of the culture of my object, this strappy black heel was gifted to me by my mother, with the prefixed excuse that she ordered the wrong size of it online. Therefore for me, it is a symbol of this silent show of affection between my mother and I. In this case, this heel is also a symbol of the shared values and traditions within your Indian culture, as gifts and familial relationships are often highly significant in Indian culture."
  },

  147:{
    "work number": 146,
    "firstName": "Iris",
    "lastName": "Ferranti",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Twin peaks sign",
    "description": "For this project I made a miniature version a sign outside of the town Twin Peaks. I only used paper, glue and acrylic paint."
  },

  148:{
    "work number": 147,
    "firstName": "Grace",
    "lastName": "Han",
    "collaborators": "",
    "program": "Architectural Design (BFA)",
    "course": "Integrative Studio 1|Integrative Seminar 1",
    "title": "Values Compass",
    "description": "This deck of cards is a handcrafted deck of 104 creative cards designed for players to discover through interaction with art and creative writing practices, what their core values, identities, aspirations, and personalities are. It wishes to give guidance and reflection, or be used as educational material with artistic flair, showcasing from game and action, the importance of knowing who we are and acting not only from mere self interest but from passion of life and the future, of the world and those around us. ||I was inspired by a book about a traveler who researched 101 countries and what their 101 values are. 52 cards present these unique values mined from global perspectives, and 52 transparent cards showcase abstract, intuitive designs and drawings. Abstract forms and shapes transcend cultural boundaries, and can be enjoyed universally. I thought of the human action associated in the pursuit of a value, and with least words possible, manifested images in a continual, rhythmic way. Players first interact and pick illustrations, which pivot upon one’s instinctual and visual inclinations, or emotional intelligence. They then find the matching value from the manual, such as 'Endurance' or 'Happiness' and reflect, have discussions with fellow players, or journal about their choices. Playing continues until one ends up with a set of values which speak to them the most. ||This skewed slightly from the original prompt of the assignment which was closer to a deck of Tarot cards. I ventured through the process and gained a lot of creative freedom and ideas as we explored disciplines in the world of cards/print during our studio classes. I am grateful for this project, to have navigated and experiment around the school in my first year, and also to express myself and my ideas."
  },

  149:{
    "work number": 148,
    "firstName": "Arindam",
    "lastName": "Kalita",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Space and Materiality",
    "title": "The tea box",
    "description": "This project was about highlighting the community that I belong or relate to. I come from a state in the Northeastern part of India called Assam. Tea plays a huge role in the Assamese culture. This Tea box was made keeping in mind the symbols of the Assamese culture. The laminated patterns on the exterior was inspired from the Gamusa (a traditional fabric). The lid of the box also features illustrations of Bihu dance which is the traditional dance form of the state. |The box itself has a lid and a drawer. The top part is supposed to be the compartment for two types of tea and the drawer acts as a storage for the spices that are supposed to go in the tea. |The designs are made using the lamination technique. First the the individual pieces were cut using the laser printers than pasted on the surface of the wood base to create the effect of carved wood. The box was stained using tea as well as its a more sustainable form of staining wood and also a good replacement for toxic artificial stains. The tea stain gives this box its soothing yellow bamboo colored patina.  |This tea box acts as an object that uses tea as a source to express the Assames culture on its five surfaces."
  },

  150:{
    "work number": 149,
    "firstName": "Emma",
    "lastName": "Li",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Space and Materiality",
    "title": "The High Heel Study",
    "description": "To understand the nature of an object through different forms of observation and translation, it is important to understand the construction of the object. As such, to understand the form of my chosen object, the high-heeled shoe, I created an orthographic drawing that allowed me to visualize the accurate dimensions of the shoe using the side view, top view, and front view. To further understand the shoe, I brought it to life from my drawings using 20 gauge wire to create a life-size model. With this 3D model, I was able to gain a better understanding of the way the shoe is constructed, thus, allowing me to become creative with designing a wooden structure that represented the shoe with 5 intersecting planes. As a result, this intimate study of my object allowed me to gain a deep understanding of how objects, specifically high heels, are constructed and how different elements of it interact with each other."
  },

  151:{
    "work number": 150,
    "firstName": "Thuc",
    "lastName": "Pham",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "Vertigo",
    "description": "The piece revolves around femininity and how women are expected to achieve this impossible balance between their rougher side and softer side to be considered “perfect”."
  },

  152:{
    "work number": 151,
    "firstName": "Shane",
    "lastName": "Smith",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Space and Materiality",
    "title": "Stretched Perspectives",
    "description": "My head, based on my face, is stretched across my skull and held together by surgical pins (under the knife). It is a reflection upon body dysmorphia and how the face is nothing but a moldable/displayable subject for people.The piece started with a foam head. I shaped it with a heated metal tool to get the shape of my own bone structure in the front, and then a spine in the back. I covered the back with air dry clay and then let it set to get the look of an exposed skull. I decided the leave the dry cracks as it felt more authentic. I then covered it in a sparkly, translucent power, and added silver leaf to the center crease. For the face, I made a mold of my head/ears using plaster strips. I chose to keep a \"normal\" expression as if the surgery to my face that is so extreme was something I was familiar with/used to. I then dyed brush on rubber and used my plaster mold, as well as the paper extensions I added on, as a base to brush it onto. After a couple hours the cast slipped right out and It slipped onto the foam head like a glove. I pulled everything back and connected the ears with sewing pins so they were more secure and hid them with the excess rubber. I added my earrings, and carefully added a small gaged wire in the back of the skull/onto the latex skin making it look like they are doing the job of pulling the face back. For a final touch, I placed everything on a clear sheet base, that is held up by a half inch cylinder, to give the illusion of it floating slightly off the table while being presented."
  },

  153:{
    "work number": 152,
    "firstName": "Sadie",
    "lastName": "Kaino",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "This piece is put together to create a very geometric object, while working with softer and less rigid materials. I designed the individual cells to create the illusion of a second form within the pink exterior, while none of the patchwork tiles actually touch."
  },

  154:{
    "work number": 153,
    "firstName": "April",
    "lastName": "Hoffmeister",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "The Maze With No Escape",
    "description": "The Maze With No Escape was Inspired by Ana Mendieta’s ‘Silueta’ figures. I wanted|my model to explore the limitations set |onto women by society. Drawn by the |symbol of a maze, I decided to engrave|an ‘inescapable’ maze into the figure. |Aiming to convey the social constructs |inscribed into our culture. Furthermore, |to amplify the purpose of this piece I casted a screw through the head of the |figure, depicting the violent nature of gender roles."
  },

  155:{
    "work number": 154,
    "firstName": "Saanvi",
    "lastName": "Gupta",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Integrative Studio 1",
    "title": "Suramya",
    "description": "My card deck explores a fusion between Indian traditions and the dramatic flare of Bollywood. The Indian culture is a vibrant tapestry of traditions, values and practices that continue to evolve while retaining their deep-rooted significance, on the other hand, Bollywood is a unique combination of entertainment, music and fun. My aim is to find a unique cultural experience for the players and viewers alike. The deck can be meticulously arranged, and the player may select up to 3 cards. Each card within the deck is imbued with specific emotional or situational themes which portray the player's current situation. Furthermore, each card also has its own Bollywood song. The link to the playlist is given at the end of the manual. In addition to their specialised use, these cards can also be employed in a conventional manner similar to normal playing cards."
  },

  156:{
    "work number": 155,
    "firstName": "Rachel",
    "lastName": "Vita",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Time",
    "title": "My Real Life Coming of Age",
    "description": "For my project, I based it off of a video I made a month before I graduated high school. The video, “My Real Life Coming of Age,” stars my closest friends and was inspired by teen movies I’ve watched. Creating this video was a way for me to make something special with my friends before we left for college and to preserve a part of our lives that was coming to an end. In the video, I narrate a poem that my friend Emma wrote which perfectly incapsulated our feelings towards growing up and graduating. Because the original video was meant to be cinematic, I wanted to create a DVD case as if it were a real movie. My actual book is inside of the DVD case since many DVDs come with a booklet. In the booklet, I used stills from the video and various pictures I took during my Senior year and the poem. I wanted to control how the reader read through by how I split up the poem throughout the book and where I placed the text on the page. Generally, I had the text flow from top to bottom and the pictures follow along with it. On some pages, I placed the text in one block, allowing the reader to slow down. On others, I split up the text in chunks so I could control the rhythm the reader reads at. With the pictures, I used consecutive stills to show the progression of an action. Also, on pages 18-19, I used lots of smaller pictures and organized them in chronological to order, highlighting the number of events and special moments from my Senior year and the physical changes of my friends and I from the beginning and end of the year."
  },

  157:{
    "work number": 156,
    "firstName": "Gabriel Paolo",
    "lastName": "Villos",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "Hammered Head",
    "description": "My wearable headpiece, Hammered Head functions as a form of protection for the wearer. The headpiece is meant to be worn in and damaged as a sign of that protection from a physical environment. For me it was simply the day to day commute from house to school that was my battlefield. I chose metal to depict hardness and also be able to show signs of damage better. It also contrasts the fragility of my plastic material which is full of holes and is softer. Through my process I was able to make organic elements such as holes and more curvier shapes of the uneven metal contrast the geometric form of the piece."
  },

  158:{
    "work number": 157,
    "firstName": "Carolyn",
    "lastName": "Mottern",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Integrative Seminar 1",
    "title": "Memoir-2020",
    "description": "For this project we were to write a five page paper about our experiences during the pandemic. When I first received the prompt I did not feel very inspired. But as I started writing the paper and getting into the ideas it began to be kind of cathartic. The beginning of 2020 and the pandemic were tough on everyone and I had not actually really processed the drastic change to my lifestyle that covid brought. This paper is one that I am proud of from my first year. I think writing out everything that I was feeling in this way was actually the start of some very good emotional healing."
  },

  159:{
    "work number": 158,
    "firstName": "Xizi",
    "lastName": "Zhou",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Space and Materiality",
    "title": "Damp place",
    "description": "This is a soft sculpture made by felt, bobbles, and pins. There is a female head with pearl stud earrings who grow a lot of mushrooms on her brain. |Every time when I feel sad, there is a mushroom grow up in my head. Every mushroom represents different physical expression and action. Mental internal friction makes my mushrooms grow fast. Having to many mushrooms is not a good thing. However, it is not a bad to have some of the mushroom. We need to learn how to deal with the mushroom, because mushroom help us improve. So, treating your mushroom well, they are not horrible things."
  },

  160:{
    "work number": 159,
    "firstName": "Charis",
    "lastName": "Pao",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "The 'Revive' Zine",
    "description": "Based on our class discussions and readings about climate action, I designed an easily accessible form of advocacy and awareness in a visually captivating way. Each panel is illustrated to depict a different aspect of global warming with descriptions and statistics that inform audiences. Actual sources are linked through citations and QR codes that further the purpose of the advocacy project. The zine is designed to be printed and made through one sheet of paper - keeping in mind the environmental aspects of the cause. The zine can be easily integrated into store fronts and public spaces where it can be referenced or distributed to a large group of people. ||The title 'Revive' signals the need to restore a balance to our planet in order to preserve it."
  },

  161:{
    "work number": 160,
    "firstName": "April",
    "lastName": "Hoffmeister",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Space and Materiality",
    "title": "N/A",
    "description": "This piece depicts a naked figure of a woman dancing on four different panels, her body is furthermore distorted through the geometric lines that have been added to the background. The contrast of the fluid movements created through the sturdy material of wire allows the piece to look like its defining the natural laws of physics."
  },

  162:{
    "work number": 161,
    "firstName": "Lauren Yoon",
    "lastName": "Sagong",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Time",
    "title": "I was a Prisoner, not long ago",
    "description": "As I mentioned at the end of the book, I was inspired by someone's life story and wanted to make his story a book. I arranged the pages in a way that makes the story flow best. When you open the book to a random page, you'll see a deliberate contrast between the two pages. I chose only two colors, blue and white, to keep it simple, like doodles in pen on paper. The pen strokes are consistent, like writing in a journal with a pen. I chose the original font, which is the handwriting of the story's owner, to capture the writer's feelings.The goal is to make the book not just about the events but also conveying the person's emotions, creating a powerful experience for the reader."
  },

  163:{
    "work number": 162,
    "firstName": "Daniel",
    "lastName": "Berger",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Space and Materiality",
    "title": "Challah Board",
    "description": "Over the course of four weeks, students were tasked with creating a 3D object that showcases their connection to their identified community, personal beliefs, or personality. The item should express their feelings of belonging to a particular community of their choosing.||Personally, the Jewish community, is where I feel most energized, fulfilled, and connected to something larger than myself. The Jewish community defines everything in my life, from my core values to my relationships, and my interactions with the world. While Orthodox Jews are more engaged with the daily practice of traditional Judaism, in almost every affiliation of Judaism, Jewish people host a Shabbat or holiday meal at some point in the year. These meals are sacred, serving as a space to share ideas, bond with family, and celebrate the Jewish tradition. In Jewish practice, bread is the centerpiece of these meals. In fact, in Jewish law, for eating to be considered a proper meal, one must eat bread. At these Shabbat and holiday meals, it is the practice to have two special loaves of bread called challah and to place them on a special board covered by a decorative piece of cloth. This board is meant to emphasize the importance and sacred nature of the challah. Ultimately, what it means to be a part of a community is to come together, and although my daily practice as an Orthodox Jew encompasses many factors, the challah board represents the essence of the Jewish community as the space where all types of Jews coalesce."
  },

  164:{
    "work number": 163,
    "firstName": "Sofia",
    "lastName": "Yu",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "Flesh Ball Sex Object",
    "description": "This work is a soft sculpture that centers around objectification. With the prompt of “create a soft sculpture,” it felt like a wonderful opportunity to pursue this concept. Inspired by a conversation with my roommate on the universal experience of harassment, I wanted to explore what male perception of the female body can look like. Where does the boundary between femininity and sex object lie? At what point in our interactions are we simply dehumanized? This is my take on what the so-called ideal “woman” is. Made of fabric scraps and created with a mix of machine and hand stitching, the visible stitches convey how fabricated this societal idealization of women can feel like."
  },

  165:{
    "work number": 164,
    "firstName": "Eden",
    "lastName": "Schulman",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Sustainable Systems",
    "title": "N/A",
    "description": "In an earlier assignment for my Sustainable Systems class, I created multiple bioplastics. One of those bioplastics was a success. That one successful bioplastic I created, I created my own measurements and added components to the recipe. I realized, because it worked so well, that I wanted to create a bag from it. So I proposed the idea and got to work. It took about a week and a half to make the bioplastics and let them fully dry. Once it was dried, I peeled away the foil that I poured it onto. Then I began cutting the bioplastics into one long continuous thin line. With the bioplastic string that I cut up, I began to crochet it. I crochet 6 squares and cut out another 6 squares. I wanted my bag to have a quilt-like pattern. Then I sewed everything together including the side parts to the bag and the bottom part of the bag. I used my original bioplastic from the previous experiment for the bottom. Then I crochet the strap and sewed it on. Throughout Sustainable Systems we learned about how to be sustainable and how the Earth is being impacted by climate change/global warming. creating this bag, means that it can biodegrade and no toxic plastic was used."
  },

  166:{
    "work number": 165,
    "firstName": "Reagan",
    "lastName": "Carlson",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "Isolation",
    "description": "When creating my piece, I chose to focus on disconnection in the form of social isolation. For this reason, I decided to surround both sides of my head with a mirrored fan that cuts off my sight with my reflection. This emphasizes the theme of social isolation, leaving the wearer only left with their head and your thoughts around them. Additionally, the piece is rigid, and binding, showing how imposed social isolation is uncomfortable. Social isolation also results in a loneliness, which is why the wearer is meant to be cut off from the world with the fans at each side. For my conceptual photo I wanted to emphasize my theme of social isolation. For that reason, I wanted to create a photograph that had me lost in a blur, confined only to my head, surrounded on all sides by the fans."
  },

  167:{
    "work number": 166,
    "firstName": "Luana",
    "lastName": "Pangaio Da Silva",
    "collaborators": "",
    "program": "Strategic Design and Management (BBA)",
    "course": "Integrative Studio 1",
    "title": "Body Image and Fashion",
    "description": "A magazine on the topic of body image issues in the Fashion industry. It contains a collage, an interview, and an article written by me."
  },

  168:{
    "work number": 167,
    "firstName": "Rachel",
    "lastName": "Vita",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "House of Sonny",
    "description": "I collect these figurines called Sonny Angels and I wanted to create a \"house\" for them. When constructing our models, we had to use mechanical fasteners rather than glue which was a challenge. For my model, I used plastic tabs and embroidery thread to \"sew\" the pieces together. Through my design, I wanted to maintain the playfulness and happiness of the Sonny Angels through the colors and designs. I also liked how packing them inside the space and including the one figurine hanging off the side creates this fun and lively environment that’s more reminiscent of a club or party."
  },

  169:{
    "work number": 168,
    "firstName": "Xihong",
    "lastName": "Liu",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Sustainable Systems",
    "title": "Chip's story",
    "description": "For my project, I designed a children's picture book for kindergarten through second grade students to briefly talk about how microplastics are formed and the dangers they pose to humans. Also, it gives suggestions for methods to reduce plastic pollution and be environmentally friendly. I illustrate the story through the journey of the main character, Chip, who is transformed from a shampoo bottle fragment."
  },

  170:{
    "work number": 169,
    "firstName": "Emma",
    "lastName": "Miller",
    "collaborators": "",
    "program": "BA/BFA",
    "course": "Integrative Studio 1",
    "title": "(Fake) Beanie",
    "description": "For this project called \"my so-called life\", we were supposed to bring 2 objects to class. One was completely handmade and the other was a real or found object. I brought in a guitar pick (real), and a knitted beanie. I claimed that my grandmother had made the hat so the story behind it was fake and I constructed it myself."
  },

  171:{
    "work number": 170,
    "firstName": "Rachel",
    "lastName": "Vita",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Space and Materiality",
    "title": "Sweet Nostalgia",
    "description": "Baking is one of my favorite hobbies and I've always done it since I was very little. In this project, I wanted to create a cake and combine two of my passions: baking and art. Because baking is deeply rooted in my childhood, I wanted my model to have a nostalgic feeling. I constructed my mold so the cake would appear lopsided and painted my model with pastel pink, blue, and green to create a dreamy, innocent look. During the process, I learned that you could use spackle as fake frosting, so I put it in a piping bag and piped out a decorative pattern on the edges."
  },

  172:{
    "work number": 171,
    "firstName": "Tracy",
    "lastName": "Qiao",
    "collaborators": "Triet, Vo",
    "program": "Architectural Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Navigation",
    "description": "Navigation\" illustrates the vivid emotions of international students living far from home. One Chinese and one Vietnamese collaborated to depict the simultaneity of the need to adapt to a new city - New York - with an irresistible gravitation towards home. The two nests lit by warm light are each artist's conception of their home's material cultures. They use embroideries, patchwork and collage to materialize traditional customs, familiar elements and important sceneries. Despite their emotional presence, the two nests are elevated from the representation of where the artists physically reside, emphasizing the unavoidable truth about how distant homes have become."
  },

  173:{
    "work number": 172,
    "firstName": "Amy",
    "lastName": "Chen",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Space and Materiality",
    "title": 3.35,
    "description": "A monument dedicates to the comfort women during WWII. To tell a better story, I choose to show both side of the story rather than limited to the comfort women. The overall structure is a mock up of a simple and crude shelter the women lived in. There’s a bruised woman body on one side and a soldier wearing old-Japanese military uniform figures on either side of the monument. The middle point hang a 1940 version of Japanese flag and each side is fill with some items of the figures. |Some items that portrait the women’s story has:|Wooden genitalia- this reflect the most on the soldier’s side. It shows how women were not seen as human, but as a sexual-relief tool.|Condom- a tool that can make sex safer for women in modern day are often not being use, but a tool could’ve benefit those women from these rape.|Leg pieces and traditional clothing for young women of a specific tribe in Hualian, Taiwan, where the monument is being proposed.|3 acrylic pieces that says: 3。350: each person is limited to 3 minutes each, and each women could have up to 350 soldiers a day; 貞潔: meaning purity in Chinese; andクリーン: meaning Clean in Japanese.|The flag with fetas- the result of the rape, many women are require to keep working even pregnant or treated poorly/ being killed. The beautiful gift of baring a new life is now the most cruel reminder of their life.|These item were chosen to portray the life before, during, and after the abomination act.||Most item in the soldier’s side are war-related, what they see in their everyday life. The items as \"tools\", related to the Women’s genitalia, most of these war items are tools, so they’re carve out of wood."
  },

  174:{
    "work number": 173,
    "firstName": "Ajani",
    "lastName": "Belle",
    "collaborators": "",
    "program": "Photography (BFA)",
    "course": "Integrative Studio 1",
    "title": "Ajani Belle Bridge 2: Friend of Fear",
    "description": "Seeing that everything combined of Sophia's fears falls under the umbrella of a fear of a change I decided my film would center around that. As first year students we're all experiencing a big shift in our lives. Part of Sophia's fear was nothing topping high school so I decided to flashback to high school in my film. I also put the \"Into the Spider-verse\" clip because that was the coming of age moment for Miles when he was fully entering the next chapter of his life of being Spider-Man. I also used clips from \"Degrassi Next Class\" and \"Grand Army\" to show how lonely and depressing the switch from highschool to college can be but also how it can get better. I mixed up the clips to lead up to Miles jumping off the building in the Spider-Verse clip as I wanted it to be a build up to taking that next step in life. I used music from the series finale of Star Wars: The Clone Wars to set the emotional tone of the film. ||Sources:||Grand Army||Spider-Man: Into the Spider-Verse||Degrassi Next Class||Star Wars The Clone Wars Soundtrack: \"Burying the Dead\" by Kevin Kiner||https://youtu.be/cfQczP603RI?si=jkkhYAFV5o5Jq0Nu"
  },

  175:{
    "work number": 174,
    "firstName": "Gabriel",
    "lastName": "Tenesaca",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Hourglass Interviews",
    "description": "I interviewed my partner whose fears were aging and wasted time. I wanted to offer a solution to these fears by showing that it’s okay to change your goals as you grow older, and that some things might not work out but open the door for new possibilities instead. I would go on to interview other Parsons students about their current goals, if they feel they’ll reach that goal, and if they’re content with where they are right now. |\tFor equipment, I borrowed a Canon Vixia HF M32, and used my phone as the microphone while conducting interviews. I used Premiere Pro to arrange the clips, mix the audio, and add captions. Song name is “Limerence” by Yves Tumor."
  },

  176:{
    "work number": 175,
    "firstName": "Hayden",
    "lastName": "Tutton",
    "collaborators": "",
    "program": "Photography (BFA)",
    "course": "Integrative Studio 1",
    "title": "Her Name is Keren",
    "description": "This animation was based off an interview I did with my partner Keren. We discussed details of her childhood, hobbies, lifestyle, hometown etc. I then took the details that I thought were most interesting and interpreted them through my own creative lense. We had an option of using manual animation or Procreate so I mainly used procreate but did do the introduction manually. As I worked on the animation I would discover new ways to transition from one scene to the next or make the video more interesting. I wanted it to have a wacky and childlike feel, while also being obvious it was still about Keren. Our paper that corresponded with this assignment in Seminar was really helpful in making this. Our prompt was to write 2-3 page a creative essay on aspects we choose from our partners interviews. I used my writing as a an aid to visualize what to include in the animation. We did an exercise in Seminar where we had to turn a normal paragraph into a creative writing type. I chose to transform my to poetry which made me think deeper about how I can go even further in depth on these small aspects, like laundry."
  },

  177:{
    "work number": 176,
    "firstName": "Jacqueline",
    "lastName": "Filip",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Memories of Buni",
    "description": "An ode to my memories as a child spent with my grandma in her garden. The video is shot from my perspective as a young girl observing the world around her."
  },

  178:{
    "work number": 177,
    "firstName": "Junyi",
    "lastName": "Wang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Two Different Dimensions",
    "description": "This is a video portrait of my group partner: Jiwon. I will be featuring a video of Jiwon's three most important things: family, study degree, and friendship.  Moreover, she gave me an answer to the question \"What would you change if you can be absent from the present?\"| I shot lots of footage of strangers walking on the road and applied a variety of video effects to show the clutter of the city and how big the world is, but it's my pleasure to have a chance and get to know what kind of person my partner is. City scenes can also be used as a transition between three important things. The candle with a lower opacity layered on the top represents the present and Jiwon's life. The mosaic patterns on the faces of the family members indicate the distance between Jiwon's family. I used four items to symbolize facing death: a candle, burning paper, dangling water, and smoke. Then I changed the color of the video to a combination of green and purple with a high light exposure to create a vibe of an imaginary world. I also shot a video of my hand counting down to the end of Jiwon's life. The last video clip that flashed up was of her playing with friends proving that she chose to leave more time for her friends in the end."
  },

  179:{
    "work number": 178,
    "firstName": "Kylie",
    "lastName": "Lu",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Integrative Studio 1",
    "title": "Which is me",
    "description": "This portrait is an encounter with myself because this is a new way to know about myself. I drew out the different ME in combined sections and chose the color of red and dark tones.  I consider myself to have lots of different personalities or characteristics in daily life. It is hard for me to recognize what my style is, sometimes I get confused with what I should be like, or in other words, what should I act like ME, the style that people see me. The process of seeing myself internally and from external comments sometimes bothers me a lot. I felt that in the way I understand myself, I get more confident in presenting ME, not the way people would think that ME fits my style. The movie project is related to the painting, which expands a further picture of me."
  },

  180:{
    "work number": 179,
    "firstName": "rachel",
    "lastName": "george",
    "collaborators": "joe cox, mia arculeo, elizabeth su",
    "program": "Architectural Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "Just A Dream",
    "description": "When thinking about what to do with this film, all of us agreed that we wanted to make it a psychological thriller, where the viewer is kind of creeped out by the state of the main character. We also all naturally agreed that this film needed music and only one character, to make it simple for the viewer to understand. We all decided that we wanted to make Mia the main actor and just make her look psychotic the whole entire film. When coming up with the plot of the story, we wanted to highlight that Mia only daydreams in real life, so we kind of wanted to show day dream in the beginning of the story, and towards the end of the story reality starts to kick in and Mia starts to wake up. I think one thing when developing the idea for this film, was the transitions. We wanted the movie to flow like a dream, where things just happen out of blue but they flow, and it makes sense. I think towards the end of the film we wanted to make it more abrupt because the truth of reality is that things happen for no reason sometimes, and thinks are hard to comprehend, so that’s the point that we wanted to get across with this."
  },

  181:{
    "work number": 180,
    "firstName": "Rai",
    "lastName": "Everett",
    "collaborators": "",
    "program": "Integrated Design (BFA)",
    "course": "Integrative Studio 1",
    "title": "JOE",
    "description": "The end goal of the project as a whole was to represent my partner, Joe, in the most authentic way I could. By employing multiple things that my partner loves, I was able to create a fuzzy feeling because of how intimate it was. From song lyrics to One Piece Manga pannels I wanted to include all the things that I could that make Joe...Joe! Close discussion and fun questionnaires all helped inform my decisions as well. |Having always wanted to create a mixed media video, I had to take a chance and do it! There were no excuses as everything I needed was at my hands. Mixed media pieces always feel rather intimate as they take a lot of mechanical work, they take time and it shows that thought was put into them."
  },

  182:{
    "work number": 181,
    "firstName": "Roan",
    "lastName": "Fraser",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Integrative Studio 1",
    "title": "Memory of Ketamine Therapy",
    "description": "I wanted to depict my memory of doing ketamine therapy for my depression. Often visualizing my experiences and memories can help me further process them and this felt like the perfect opportunity.||Every time I went felt the same and I aimed to use visual metaphors of circles as well as the pacing of the video to show the cycle of each appointment. Although many of the experiences I show through this video occurred over the span of months they all feel like the same memory. Boiling my experience down into a short video did justice to how much I actually remember, and now that I have a summary of my thoughts and feelings, it has relieved me from some of the fear of forgetting them.||While in ketamine therapy I would always listen to the same album on CD; Whatever and Ever Amen by Ben Folds Five, and a few visuals in the video are sourced from it: the rings are a cut up photo of the back of the CD, and there is also a clip from an iTunes visualizer of the album."
  },

  183:{
    "work number": 182,
    "firstName": "Talia",
    "lastName": "Dang",
    "collaborators": "",
    "program": "Product Design (BFA)",
    "course": "Sustainable Systems",
    "title": "Tackling Food Waste: A Call To Action!!!",
    "description": "Embark on an engaging exploration of the pervasive issue of food waste through my illustrative video project. I aim to shed light on the intricacies of food waste beyond the mere act of discarding leftovers.||The journey unfolds by delving into the profound impact of food waste on our environment, the strain it places on valuable resources, and its consequential effects on our day-to-day lives. Through a captivating narrative, I aim to convey the importance of this issue and inspire action.||My video endeavors to simplify the complexities of food waste in a fun and easy-to-understand manner, making the information accessible to a broad audience. By unraveling the story behind food waste, I seek to empower viewers to make informed decisions and implement small changes that collectively contribute to a significant positive impact.||Join me on this adventure, and together, let's transform into food waste warriors, taking small yet impactful steps toward a healthier planet. Get ready for an enlightening journey as we navigate the world of food waste and strive for a more sustainable and mindful future."
  },

  184:{
    "work number": 183,
    "firstName": "Carina",
    "lastName": "Dai",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Time",
    "title": "Drip",
    "description": "I am making a video that recreates some of the scenes that have occurred or inspired by my previous dreams, where elements and objects in it are combined in a strange way that you would not normally expect, or transformations into something that is totally unexpected and unrelated. ||Music sources/credits: Single person Studio, \"Dancer In The Dark\" song by Yico Zeng|Music edited by: Carina Dai"
  },

  185:{
    "work number": 184,
    "firstName": "Cecilia",
    "lastName": "Yang",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Time",
    "title": "Distraction",
    "description": "In this project, I tried to illustrate a simple story: a student kept thinking about cooking the noodles when doing her time assignment. Through “sound montage” and video collages, I forced my audience to experience the theme of “distraction” by providing a flood of sounds and images. The film is about the process of creating it, and the process of creating the film turns out to be the film itself. This experimental film has this LOOP nature with a clear explanation of the content in the middle and an end, which can link to the beginning; thus, the audience can enter the video at any time and figure out the story after a few loops."
  },

  186:{
    "work number": 185,
    "firstName": "Diana",
    "lastName": "Luo",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Time",
    "title": "N/A",
    "description": "In this project, I chose to recreate a famous scene from Kar-wai Wang's film Chunking Express. I chose to alter some scenes and include some of the narrations from his other movies such as Fallen Angel. In this video, I used an old camera to capture multiple photos of the same action and a low shutter speed to create movement. This is similar to how some parts of Kar-wai's film use step printing, I wanted to explore more possibilities of Photo Roman through this technique. I also applied a filter to limit the color pallet, it is used to create harmony and tension."
  },

  187:{
    "work number": 186,
    "firstName": "Fangai",
    "lastName": "Yan",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Time",
    "title": "N/A",
    "description": "This film communicates the stress emerging from the pursuit of perfection. The motif of the circle captures how details of life slowly destroys ideal standard, symbolizing a perpetual cycle of striving for flawlessness."
  },

  188:{
    "work number": 187,
    "firstName": "Julia",
    "lastName": "Kim",
    "collaborators": "",
    "program": "Interior Design (BFA)",
    "course": "Time",
    "title": "Overconsumption",
    "description": "Overconsumption\" serves as a thought-provoking commentary on the consequences of overconsumption of media, urging introspection on the balance between digital engagement and the preservation of mental well-being in an increasingly interconnected yet demanding world."
  },

  189:{
    "work number": 188,
    "firstName": "Kelly",
    "lastName": "Su",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Time",
    "title": "It Comes and Goes",
    "description": "From the assignment requirements, I thought of my “daily rituals. While I don’t have many, I do wake up and go to bed thinking of affirmations and words of gratitude, and I wanted to convey how my emotions swell and deflate, come and go. When thinking about the medium for my daily ritual I planned to depict, I knew I wanted a medium that would shift in some sort of way, even when it was a still image, and the chemical reaction between iodine and cornstarch popped into my head.||My inspiration for the premise of this project came from a science experiment I performed during middle school. Originally, we used iodine and starchy water for a germ transmission activity, but I found the chemical reaction more fascinating than the activity itself.||The premise of the project itself is experimental—in the hands of chemistry, there’s much spontaneity that could make or break the whole project. Using iodine and cornstarch to paint in general was a success in itself, but I hadn’t realized how performative the work truly was until I’d filmed it. Much of this project felt like I wasn’t in control—chemical reactions are fickle, especially when you don’t know every facet of the reaction itself, or the used materials. Even still, this project taught me a lot more about control: even if there are parts of the project out of my hands, I can be creative with what I do have control over, just like how I have control over my emotions and how I apply them to the chaotic, spontaneous world around me."
  },

  190:{
    "work number": 189,
    "firstName": "Melody",
    "lastName": "Zhang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Time",
    "title": "Back鸭ard",
    "description": "The film provides a glimpse into the mind of an introvert – a space of inner peace within a world of chaos."
  },

  191:{
    "work number": 190,
    "firstName": "Michelle (Elle)",
    "lastName": "Choo",
    "collaborators": "",
    "program": "Communication Design (BFA)",
    "course": "Time",
    "title": "Elle's Soundscape Sagittarius A",
    "description": "For this soundscape animation, I created an unidentifiable sculpture out of clay (with organic and rigid shapes) and used its image from different angles as subjects for my video. I then colored and warped these images with all different kinds of video effects to create a sequence of abstract movements. Although this project needed to mostly be unidentifiable, I did have a loose concept. The sculpture represents human pollution that is infecting the waters of our planet, and as it slowly decomposes it changes its shape and texture. In the end, the water is consumed by the pollution and its color becomes unnatural. The sounds I used for my soundscape are combinations of recordings I did myself as well as audios that were distorted to sound like the bottom of the sea."
  },

  192:{
    "work number": 191,
    "firstName": "Sophia",
    "lastName": "Wang",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Time",
    "title": "The Manipulated Relations",
    "description": "In this project, I wish to present the concept of manipulated time by using audio. The entire video is audio driven, suggesting that the pace of the flash light varies on each separate set accordingly to the character speaking. The dialogue is an excerpt taken from the play A Midsummer Night’s Dream by William Shakespeare. I found the play interesting as the plot and the movement of time is driven by characters blindly manipulated by love. In the video, the scenography work I created of the forest is multiplied.||The center frame being the pace controller, playing in a constant speed. The frame on the left representing Hermia and the right representing Helena. When one is speaking, they’re corresponding frame’s spotlight speeds up. The forest trees are formed with distorted hands, further symbolizing for manipulation.||The audio of the recorded dialogue is processed by adding some studio reverb. Moreover, the single channel audio was worked to achieve the effect of two, left and right channels. Panner keyframes were added to do so. In addition, I also layered the audio of light rain on top of the background music, in order to help advocate the central conflict between the two female characters. Lastly, when watching the video, the audiences would have to first close their eyes. This is to allow the audience to better immerse and feel embodied within the video."
  },

  193:{
    "work number": 192,
    "firstName": "Tiffany",
    "lastName": "Tran",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Time",
    "title": "Who am I?",
    "description": "“Who am I?” is a mosaic of identities, a memoir cast in the hues of past, present, and those yet to be unveiled. Through the lens of portrait photography and storytelling, “Who am I”  delves into a visual and emotional exploration of identity, capturing its essence as a a fluid and multifaceted construction and uniqueness of every individual. It explores how we perceive ourselves, how others perceive us, and how these perceptions evolve over time. The narrative is a reflection on the complexities of feeling lost, overwhelmed, and navigating through an identity crisis, all while pondering the elusive concept of self. Blended with visual and textual elements, “Who am I” challenges preconceptions and invites introspection.||They aren’t just about capturing moments; they are about capturing souls. It aspires to be a gallery of personalities, an artistic exploration of cultural identity, self-acceptance, societal expectations, and transformation. Employing a non-linear and unconventional structure, metaphorical imagery, sensory elements, typography, and effects, the book plays with colors to evoke different emotions and time periods. ||“Who am I?” presents different facets of one’s identity at different points in the book, allowing the readers to piece together the puzzle of one’s identity over time, the enigma of existence. In “Who am I?,” the question lingers, lingering like the final notes of a melody. Through the eyes of others, we glimpse ourselves. Through the years, we craft our identity. Through time, we answer the eternal question.||Who are you? The answer, perhaps, lies within these pages, where time and identity entwine, where portraits whisper the secrets of the soul, and where time, as a constant presence, guides us through these stories. “Who am I?” is not just a book; it’s an experience. It’s art, it’s soul, and it’s a whole lot of fun. ||(https://cattuongt505.wixsite.com/who-am-i)"
  },

  194:{
    "work number": 193,
    "firstName": "Tobias",
    "lastName": "Cobin",
    "collaborators": "",
    "program": "Fine Arts (BFA)",
    "course": "Time",
    "title": "I AM HOME",
    "description": "I AM HOME is a photo roman that explores the idea of \"home\". Is it a house, an object, a person, yourself? It is comprised entirely of images and the soundtrack is an original song, written and played by myself, overlayed with audio from home videos taken throughout my life. I am home."
  },

  195:{
    "work number": 194,
    "firstName": "Yinan",
    "lastName": "Xue",
    "collaborators": "",
    "program": "Illustration (BFA)",
    "course": "Time",
    "title": "The only one left behind",
    "description": "The freedom of this project is very high, so I will mainly explain the content of the story, and the materials involved are Premior Pro and Procreate. My imaginary creature is a kind of elf, and her image is a reference to the classic elf look, with a little red pointed hat.  And her moral is not just the appearance of an elf on the surface, her deep meaning is a fairy tale dream that only children with childlike innocence can have.|My little elf wakes up in the city.   She feels like she has been asleep for so long that she no longer knows where she is, so she tries to find her family in the steel jungle.|I show the city as a black and white image in my photo-roman, and the elf will have color.   When the elf finally finds color in this black and white city, she finds that it is a tombstone belonging to the children’s fairy tale, and it is a funeral belonging to the naivete.   The black and white repression of the city will not longer allow the existence of innocence, and this last spirit also slowly disappeared in this funeral, turned into a burial flower for the tombstone."
  },

  196:{
    "work number": 195,
    "firstName": "zhengyuan",
    "lastName": "Zhao",
    "collaborators": "",
    "program": "Design and Technology (BFA)",
    "course": "Time",
    "title": "Zombie Zapper Z",
    "description": "This video symbolizes my childhood fantasies.   In my world, I was always the hero who killed zombies.   The desire for superpowers was great, the power of magic.   The idea to incorporate these characteristics in my works originates from my childhood when I was scared of horror movies and zombies at the same time admiring and fantasizing about the wizard world of Harry porter.   It is in this manner that I wish to face my childhood fears and overcome them with the fairy-tale magic of childhood.||In this piece, I used fun music, and some funny things, but in the video I was very serious.   I have made this comparison to establish that I take this issue with the seriousness it deserves.   This is not a joke, I want to encounter this.   For me, all the other quirky things are not just amusing features that give me some relaxation sense, but a certain recognition that I won’t get wonders like in the video."
  },

  197:{
    "work number": 196,
    "firstName": "Ginger",
    "lastName": "Vieth",
    "collaborators": "",
    "program": "Fashion Design (BFA)",
    "course": "Space and Materiality",
    "title": "Heatless Curls",
    "description": "My found object for this assignment was a curling iron I had found at a thrift store. I wanted to continue a theme of electricity/technology for my assignment. Part of the prompt was to utilize the object in a way that it is not supposed to be used. For this, I played with the idea that you should not leave open wires around heat. I created a sculpture of a woman's head with her hair being made of wire, displayed through a short video of me curling her hair."
  },